Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: |Easy to make payments and create new addresses |Mobile app “wallet” |Simplified backups |HD wallets are generated from a seed. Only the seed, 12 to 24 English words, needs to be backed up. |Creating addresses in insecure environments |HD wallets can generate public key trees without ever seeing any of the private keys.
de_de: |Einfacher, zu bezahlen und neue Adressen zu generieren |Mobile App “Wallet” |Vereinfachte Backups |HD Wallets werden aus einem Seed erzeugt. Nur der Seed, 12 bis 24 englische Wörter, muss gesichert werden. | Erzeugen von Adressen in unsicheren Umgebungen |HD Wallets können public Key Bäume erzeugen, ohne je einen der private Keys zu sehen.

source: |Safe from expensive typing errors |Cookie token addresses |Privacy improvements |A PKH is stored in the spreadsheet instead of a personal name. |2.0 |Secure payments |Digital signatures solve the problem with imposters.
de_de: |Sicher gegen teure Tippfehler |Cookie Token Adressen. |Privacy Verbesserungen |Ein PKH statt eines Namens steht im Spreadsheet. |2.0 |Sichere Zahlungen |Digitale Signaturen lösen das Problem mit Betrügern.

source: Suppose you use a bitcoin wallet app and want to receive 50 BTC from your friend to your Bitcoin address `155gWNamPrwKwu5D6JZdaLVKvxbpoKsp5S`. Construct a payment URI to give to your friend. Hint: in Bitcoin, the URI starts with `bitcoin:` instead of `ct:`. Otherwise, they’re the same.
de_de: Angenommen, du benutzt eine Bitcoin Wallet App und willst 50 BTC von deinem Freund auf deiner Bitcoin Adresse `155gWNamPrwKwu5D6JZdaLVKvxbpoKsp5S` empfangen. Konstruiere eine Zahlungs-URI für deinen Freund. Hinweis: in Bitcoin beginnt die URI mit `bitcoin:`anstatt mit `ct:`. Abgesehen davon sind sie gleich.

source: How many coin flips does a random password of 10 characters correspond to? The password is selected from a 64-character alphabet.
de_de: Wie vielen Münzwürfen entspricht ein zufälliges Passwort von 10 Zeichen Länge? Das Passwort benutzt ein Alphabet von 64 Zeichen.

source: Name a few problems with password-protected backups. There are at least four.
de_de: Nenne ein paar Probleme mit passwortgeschützten Backups. Es gibt mindestens vier.

source: How is the seed created in an HD wallet?
de_de: Wie wird in HD Wallets der Seed generiert?

source: What does an xprv consist of?
de_de: Woraus besteht ein xprv?

source: What does an xpub consist of?
de_de: Woraus besteht ein xpub?

source: Exercises 4.7 and 4.8 assume that you read <<hardened-key-derivation>>. If you skipped that section, you can skip these exercises, too.
de_de: Übungen 4.7 und 4.8 setzen voraus, dass du <<hardened-key-derivation>> gelesen hast. Wenn du das übersprungen hast, kannst du auch diese Übungen überspringen.

source: Suppose you want to make a hardened xprv with index `7` from `m/2/1`. What information do you need to create `m/2/1/7'`?
de_de: Angenommen, du möchtest einen gehärteten xprv mit Index `7`aus `m/2/1` erzeugen. Welche Information brauchst du, um `m/2/1/7'` zu generieren?

source: Can you derive xpub `M/2/1/7'` from `M/2/1`? If not, how would you derive `M/2/1/7'`?
de_de: Kann man den xpub `M/2/1/7'` aus `M/2/1` erzeugen? Falls nicht, wie würde man dann `M/2/1/7'` erzeugen?

source: Suppose you’re a bad guy and have the master xpub of a clueless victim. You’ve also stolen the private key `m/4/1` that contains 1 BTC. Assume you also know this private key has this specific path. Describe how you’d go about calculating the master xprv. Use these hints:
de_de: Stell dir vor, du bist ein Bösewicht und besitzt den Master xpub eines ahnungslosen Opfers. Du hast ausserdem den private Key `m/4/1` gestohlen, der 1 BTC enthält. Angenommen, du weisst ausserdem, dass der private Key diesen speziellen Pfad besitzt. Beschreibe, was du anstellen würdest, um den Master xprv auszurechnen. Verwende dabei diese Hinweise:

source: Suppose instead that your clueless victim had 0 bitcoins on the private key `m/4/1`, but plenty of money on other addresses under the same xprv. Would you be able to steal any money?
de_de: Nimm stattdessen an, dein ahnungsloses Opfer hat 0 bitcoins auf dem private Key `m/4/1`, aber massenhaft Geld auf anderen Adressen unter demselben xprv. Kämst du in diesem Fall an das Geld heran?

source: If you didn’t read <<hardened-key-derivation>>, you can skip exercise 4.11.
de_de: Wenn du <<hardened-key-derivation>> nicht gelesen hast, kannst du Übung 4.11 überspringen.

source: Suggest a better approach your victim could have used to prevent you from stealing all the money.
de_de: Schlage ein besseres Verfahren vor, das dein Opfer hätte benutzen können, um dich am Diebstahl des ganzen Geldes zu hindern.

source: Say the cafe owner wants employees to have access to the counter sales account because they must be able to create a new address for each sale. But they must not have access to the private keys because the owner doesn’t trust the employees to handle them securely. Suggest how to achieve this. Hint: a wallet can import an xpub.
de_de: Sagen wir, der Cafébesitzer möchte seinen Angestellten Zugriff auf das Thekenverkaufskonto einräumen, weil sie für jeden Verkauf eine neue Adresse erzeugen müssen. Sie dürfen aber keinen Zugriff auf die private Key haben, weil der Besitzer den Angestellten nicht zutraut, diese sicher zu handhaben. Schlage vor, wie er dies erreichen kann. Hinweis: ein Wallet kann einen xpub exportieren.

source: Suppose you work at the cafe and have loaded an xpub into your wallet. Your colleague Anita has loaded the same xpub into her wallet. You can both request payments from customers that go into the same account. How would you notice when Anita has received money into a previously empty key? Hint: you can create keys ahead of time.
de_de: Angenommen du arbeitest in dem Café und hast einen xpub in dein Wallet geladen. Deine Kollegin Anita hat denselben xpub in ihrem Wallet. Ihr könnt beide Zahlungen von Kunden anfordern, die in dasselbe Konto gehen. Wie würdest du feststellen, dass Anita Geld auf einen zuvor leeren Key erhalten hat? Hinweis: man kann Keys im voraus erzeugen.

source: You usually use a mobile app, called a wallet, to send and receive money—cookie tokens or bitcoins.
de_de: Du benutzt normalerweise eine mobile App, genannt Wallet, um Geld zu senden oder zu empfangen–Cookie Tokens oder bitcoins.

source: The wallet creates and stores keys, scans or shows payment details, sends payments, shows your balance, and backs up keys. You don’t have to do any of this manually.
de_de: Das Wallet erzeugt und speichert Keys, scannt Zahlungsdetails und zeigt sie an, sendet Zahlungen, zeigt deinen Kontostand und sichert Keys. Du brauchst nichts davon mehr selber zu machen.

source: Backups are hard to do right. Password-protected backups suffer from problems with forgotten passwords, technology improvements, and humans being lousy random number generators.
de_de: Backups richtig zu machen ist schwer. Passwortgeschützte Backups leiden unter Problemen mit vergessenen Passwörtern, technologischen Verbesserungen und Menschen, die lausige Zufallszahlengeneratoren sind.

source: With HD wallets, you back up your random seed and store that seed in a safe place. Do it only once.
de_de: Mit HD Wallets sichert man seinen Random Seed und legt diesen Seed geschützt ab. Das tut man nur einmal.

source: The seed can be encoded using a mnemonic sentence, which makes it easier to write down the seed.
de_de: Der Seed kann als mnemonic sentence codiert sein, was das Aufschreiben vereinfacht.

source: HD wallets generate multiple private keys from a seed and organize them in a tree structure to improve privacy.
de_de: HD Wallets erzeugen mehrere private Keys aus einem Seed und organisieren sie in eine Baumstruktur, um die Privacy zu erhöhen.

source: The tree of public keys—or any of its branches—can be generated from an xpub. This is useful for insecure environments such as web servers.
de_de: Der Baum von public Keys–oder einer seiner Zweige–kann aus einem xpub erzeugt werden. Das ist für unsichere Umgebungen wie Web Server geeignet.

source: Hardened private key derivation keeps “accounts” compartmental­ized. It confines an attacker to a single account.
de_de: Die gehärtete private Key Ableitung hält “Konten” kompartmentalisiert. Es beschränkt einen Angriff auf ein einzelnes Konto.

source: Transactions
de_de: Transaktionen

source: Bitcoin, or cookie token, transactions
de_de: Bitcoin oder Cookie Token Transaktionen

source: Creating, confirming, and verifying transactions
de_de: Erzeugung, Bestätigung und Verifikation von Transaktionen

source: Programming money
de_de: Programmierung von Geld

source: The cookie token payments you and your coworkers have been making so far have some serious problems. The worst is that Lisa can steal, which worries some new people. They’re hesitant to use the system if they know Lisa can steal from them.
de_de: Das Cookie Token Bezahlsystem, das du mit deinen Kollegen aufgestellt hast, hat ein paar ernsthafte Probleme. Das schlimmste ist, dass Lisa stehlen kann, was einige der neuen Kollegen beunruhigt. Sie zögern, das System zu benutzen, wenn sie wissen, dass Lisa ihnen Geld wegnehmen kann.

source: This chapter will focus mainly on _transactions_ (<<fig0501>>): pieces of data that formalize how users send payments to Lisa. Transactions replace the old email to Lisa. They’ll be stored as is in the spreadsheet instead of using the current To, From, and CT scheme. This will make it impossible for Lisa to steal other people’s money because anyone can now verify all payments in the spreadsheet.
de_de: Dieses Kapitel konzentriert sich im Wesentlichen auf _Transaktionen_ (<<fig0501>>): Datenblöcke, die formalisieren, wie Benutzer Zahlungen an Lisa senden. Transaktionen ersetzen die alten Mails an Lisa. Sie werden unverändert im Spreadsheet gespeichert, anstelle des aktuellen VON, AN und CT Schemas. Das macht es Lisa unmöglich, das Geld von anderen Leuten zu stehlen, weil jetzt jeder alle Zahlungen im Spreadsheet verifizieren kann.

source: Bitcoin transactions
de_de: Bitcoin Transaktionen

source: In this chapter, we’ll go deep on transactions and explore how they’re _programmable_, meaning they’re flexible as far as what you can do with them. For example, multisignature transactions can require two signatures out of three possible signatures, to spend money shared among three people.
de_de: In diesem Kapitel tauchen wir tief in Transaktionen ein und erforschen, wie _programmierbar_ diese sind, was bedeutet, flexibel in Hinsicht auf das, was man mit ihnen machen kann. Zum Beispiel können Multisignatur-Transaktionen zwei von drei möglichen Signaturen benötigen, um Geld, das drei Leuten gehört, ausgeben zu können.

source: After this chapter, the system will have changed a lot—in how wallets create payments, how Lisa verifies payments, and how payments are stored. Most important, everyone will be able to verify payments in the spreadsheet.
de_de: Nach diesem Kapitel wird sich das System erheblich verändert haben–in Bezug darauf, wie Wallets Zahlungen erzeugen, wie Lisa Zahlungen verifiziert, und wie Transaktionen gespeichert werden. Noch wichtiger aber, jeder wird in der Lage sein, Zahlungen im Spreadsheet zu überprüfen.

source: Problems with the old system
de_de: Probleme mit dem alten System

source: Lisa is performing valuable work. She makes sure no one cheats by verifying digital signatures and checking public key hash (PKH) balances before confirming a payment. She confirms payments by adding them to the cookie token spreadsheet.
de_de: Lisa leistet wertvolle Arbeit. Sie sorgt dafür, dass niemand betrügt, indem sie digitale Signaturen überprüft und nach den Guthaben von public Key Hashes (PKH) schaut, bevor sie eine Zahlung bestätigt. Sie bestätigt die Zahlungen, indem sie sie an das Cookie Token Spreadsheet anhängt.

source: But this old approach presents several problems:
de_de: Aber dieser Ansatz führt zu einigen Problemen:

source: Lisa is getting tired of calculating the balance before approving a payment. The ledger is growing, and each check becomes more time-consuming as new payments are added.
de_de: Lisa ist es leid, vor jeder Zahlung den Guthabenstand ausrechnen zu müssen. Der Ledger wächst, und mit jeder neuen Zahlung werden die Berechnungen und Prüfungen zeitraubender.

source: If you have two addresses with 5 CT each, you must make two separate payments to pay 10 CT for a cookie. This lays an unnecessary burden on the sender as well as Lisa. It also bloats the spreadsheet with excessive rows.
de_de: Wenn du zwei Adressen mit je 5 CT hast, musst du zwei separate Zahlungen mit je 5 CT leisten, um 10 CT für einen Keks zu bezahlen. Das belastet sowohl den Empfänger als auch Lisa unnötig. Es bläht ausserdem das Spreadsheet mit zusätzlichen Zeilen auf.

source: Because the company has grown and some people don’t know Lisa well, trust in her begins to fade. Some people fear Lisa will steal cookie tokens from them in the spreadsheet. Only Lisa can verify signatures because only she sees the emails sent to her. So she _could_ increase the CT column of a payment to her or add a row with a false payment from, say, John to Lisa (<<fig0502>>). No one could prove Lisa committed fraud. It doesn’t matter that she’s the most trustworthy human on earth. If people don’t know that, they’re going to assume Lisa is as greedy as everyone else.
de_de: Weil die Firma gewachsen ist und einige Leute Lisa nicht gut kennen, schwindet langsam das Vertrauen in sie. Einige Kollegen befürchten, dass Lisa im Spreadsheet Cookie Tokens von ihnen stehlen könnte. Nur Lisa kann die Signaturen überprüfen, weil nur sie die Mails sieht, die an sie geschickt werden. Sie _könnte_ also die CT Spalte von einer Zahlung an sie vergrössern, oder eine Zeile mit einer gefälschten Zahlung von, sagen wir, John an Lisa eintragen (<<fig0502>>). Niemand könnte Lisa einen solchen Betrug nachweisen. Es spielt keine Rolle, dass sie die vertrauenswürdigste Person der Welt ist. Wenn die Leute das nicht wissen, dann werden sie annehmen, dass Lisa genauso gierig ist wie jeder andere.

source: Bad stuff Lisa _could_ do. She wouldn’t, but she could.
de_de: Schlimme Dinge, die Lisa tun _könnte_. Würde sie ja nicht, aber sie könnte.

source: Note that Lisa can’t create any new money, other than the 7,200 CT per day as agreed. Also if she tries to steal more than what’s available on a PKH, someone verifying the spreadsheet will notice the total amount of money is becoming too big. Lisa will get busted.
de_de: Bedenke, dass Lisa kein neues Geld über die vereinbarten 7.200 CT pro Tag hinaus erzeugen kann. Und wenn sie mehr stiehlt als das, was auf einem PKH verfügbar ist, wird jemand beim Verifizieren des Spreadsheets feststellen, dass die Geldmenge zu gross geworden ist. Dann würde Lisa auffliegen.

source: Minimize trust
de_de: Vertrauen minimieren

source: Minimizing trust between people is what Bitcoin is all about. Transactions bring us one step closer to a trustless system in which everyone can verify everything.
de_de: Bei Bitcoin geht es im Kern um die Minimierung von Vertrauen zwischen Leuten. Transaktionen bringen uns einen Schritt näher an ein vertrauensfreies System, in dem jeder alles verifizieren kann.

source: Lisa hates that people distrust her. She knows there’s not much she can do to change her coworkers’ level of trust. An interesting alternative is to _minimize the trust needed_. She concludes that the best way to do this is to make the process super-transparent so everyone can verify payments. At the same time, she’ll improve how she verifies that people don’t spend money they don’t have and how to spend from multiple addresses at the same time. She invents the _cookie token transaction_ to solve the three problems outlined previously.
de_de: Lisa gefällt es überhaupt nicht. dass ihr Leute misstrauen. Ihr ist klar, dass sie nicht viel daran ändern kann, um das Vertrauensniveau ihrer Kollegen zu erhöhen. Eine interessante Alternative ist, das _notwendige Vertrauen zu minimieren_. Sie beschliesst, dass der beste Weg dazu ist, den Prozess möglichst transparent zu gestalten, sodass jeder die Zahlungen verifizieren kann. Gleichzeitig wird sie das Verfahren verbessern, mit dem sie sicherstellt, dass Leute kein Geld ausgeben, das sie nicht haben, und wie man von mehreren Adressen gleichzeitig Geld ausgeben kann. Sie erfindet die _Cookie Token Transaktion_, um alle drei Probleme gleichzeitig zu lösen.

source: Paying using a transaction
de_de: Zahlung mittels Transaktion

source: Transactions will replace both how a user’s wallet sends a payment to Lisa and what’s stored in the spreadsheet. They won’t change how wallets behave from a user’s perspective—the wallet app will _look_ exactly the same.
de_de: Transaktionen ändern sowohl die Art, wie Wallets Zahlungen an Lisa schicken, als auch das, was im Spreadsheet gespeichert wird. Sie ändern nicht, wie Wallets aus Benutzersicht funktionieren–die Wallet App wird unverändert _aussehen_.

source: Suppose John wants to buy a cookie in the cafe. He won’t email Lisa the way he’s done so many times before. The wallet software now uses transactions, so his wallet will create a transaction instead, as <<fig0503>> shows. The transaction’s purpose is to pay 10 CT to the cafe’s cookie token address.
de_de: Angenommen John will ein Keks im Café kaufen. Er mailt jetzt nicht mehr Lisa eine Zahlung, wie er es früher so oft gemacht hatte. Die Wallet Software benutzt jetzt Transaktionen, also wird sein Wallet stattdessen eine Transaktion erzeugen, wie in <<fig0503>> gezeigt. Der Zweck der Transaktion ist, 10 CT an die Cookie Token Adresse des Cafés zu senden.

source: The payment process is the same for users, but it’s different for Lisa and the spreadsheet.
de_de: Der Bezahlvorgang bleibt aus Benutzersicht unverändert, stellt sich für Lisa und das Spreadsheet aber anders dar.

source: John scans the cafe’s payment URI, and his wallet creates a transaction and asks him to accept it. He clicks OK, and the wallet signs the transaction. John’s wallet then sends the signed transaction as an attachment in an otherwise empty email to Lisa.
de_de: John scannt die Zahlungs-URI des Cafés, und sein Wallet erzeugt eine Transaktion und bittet ihn, sie zu akzeptieren. Er klickt OK, und das Wallet signiert die Transaktion. Johns Wallet schickt dann die Transaktion als Attachment in einer anderweitig leeren Mail an Lisa.

source: The transaction contains information about where to send money. But it also contains information about _what money_ to spend by referencing specific “coins” called _unspent transaction outputs_ (UTXOs) that John received in previous transactions.
de_de: Die Transaktion enthält Informationen darüber, wo das Geld hin soll. Aber auch darüber, _welches Geld_ ausgegeben werden soll, indem es spezifische “Coins” namens _unspent transaction outputs_, unverbrauchte Transaktions Outputs (UTXOs), nennt, die John in früheren Transaktionen erhalten hatte.

source: Lisa verifies that the coins spent in the transaction exist and aren’t already spent. She also verifies that the signatures—there might be several in a transaction—are valid. If all checks pass, Lisa confirms the transaction by appending it, exactly as she received it, to the end of the spreadsheet.
de_de: Lisa verifiziert, dass die Coins, die in der Transaktion ausgegeben werden sollen, existieren und noch nicht anderweitig verbraucht worden sind. Sie überprüft auch, dass die Signaturen–es könnten mehrere in einer Transaktion sein–gültig sind. Wenn alle Prüfungen erfolgreich verlaufen sind, bestätigt Lisa die Transaktion, indem sie sie unverändert an das Ende des Spreadsheets hängt.

source: Once the transaction hits the spreadsheet, anyone can make the same verification of that transaction that Lisa did. They can do this to verify Lisa doesn’t steal money from someone else or otherwise mess with other people’s money.
de_de: Wenn die Transaktion im Spreadsheet landet, kann jeder dieselben Überprüfungen daran vornehmen, wie Lisa dies tat. Sie können damit sicherstellen, dass Lisa kein Geld von jemandem stiehlt oder anderweitig mit anderer Leute Geld Schindluder treibt.

source: In the next three subsections, we’ll dig deeper into the three phases: create, confirm, and verify.
de_de: In den nächsten drei Abschnitten gehen wir näher auf die drei Phasen ein: Erzeugen, Bestätigen und Verifizieren.

source: Creating the transaction
de_de: Erzeugen der Transaktion

source: John’s transaction
de_de: Johns Transaktion

source: [ ] Create (John)
de_de: [ ] Erzeugen (John)

source: [ ] Confirm (Lisa)
de_de: [ ] Bestätigen (Lisa)

source: [ ] Verify (anyone)
de_de: [ ] Verifizieren (jedermann)

source: Let’s dive in and look closer at how John’s transaction is created.
de_de: Tauchen wir tiefer ein und schauen, wie Johns Transaktion zusammengebaut wird.

source: John’s wallet prepares to pay 10 CT for a cookie. He uses two keys with funds to cover the cost. He pays himself the change of 3 CT to a fresh address. The transaction isn’t yet signed.
de_de: Johns Wallet bereitet eine Zahlung von 10 CT für einen Keks vor. Er benutzt zwei Keys mit Guthaben, um die Kosten dafür zu decken. Er zahlt sich selbst das Wechselgeld von 3 CT an eine neue Adresse. Die Transaktion ist noch nicht signiert.

source: John’s wallet has created a new transaction (<<fig0504>>). It has two _inputs_ and two _outputs_. Inputs specify which outputs of previous transactions to spend. Outputs specify where the money goes.
de_de: Johns Wallet hat eine neue Transaktion generiert (<<fig0504>>). Diese hat zwei _Inputs_ und zwei _Outputs_. Inputs geben an, welche Outputs früherer Transaktionen ausgegeben werden sollen. Outputs geben an, wo das Geld hingehen soll.

source: The inputs specify which transaction outputs to spend. John has two UTXOs, one with 8 CT and one with 5 CT. The unspent outputs belong to two previous transactions, transaction 1 and transaction 2, that paid money to John. Now, John wants to spend these UTXOs.
de_de: Die Inputs geben an, welche Transaktions Outputs ausgegeben werden sollen. John besitzt zwei UTXOs, eine mit 8 CT und eine mit 5 CT. Die unverbrauchten Outputs gehören zu zwei früheren Transaktionen, Transaktion 1 und Transaktion 2, mit denen Geld an John bezahlt wurde. Jetzt möchte John diese UTXOs ausgeben.

source: A transaction input references a previous transaction using the previous transaction’s _transaction ID_ (txid). The transaction’s txid is its double SHA256 hash. It’s called a transaction _ID_ because this hash is often used to refer to the transaction, as in the case with inputs in <<fig0504>>.
de_de: Ein Transaktionsinput nimmt Bezug, oder _zeigt_ auf eine vorangegangene Transaktion mit Hilfe von deren _Transaktions ID_ (txid). Die txid der Transaktion ist deren doppel-SHA256 Hash. Sie heisst Transaktions _ID_, weil dieser Hash oft zum Referenzieren, oder Bezugnehmen auf die Transaktion verwendet wird, wie das bei den Inputs in <<fig0504>> der Fall ist.

source: The rationale for using double SHA256 here isn’t entirely clear, but doing so prevents something called a _length-extension attack_. Bitcoin’s creator probably used double SHA256 as a security measure in order to not have to think about these kinds of attacks. For details, see <<web-length-extension-attack>>.
de_de: Die Begründung für die Verwendung von doppel-SHA256 ist nicht ganz klar, aber es verhindert jedenfalls eine sogenannte _Verlängerungs-Attacke_. Bitcoin's Schöpfer hat sich wahrscheinlich doppel-SHA256 ausgesucht, damit er sich nicht auch noch um diese Art von Attacken kümmern musste. Details findest du unter <<web-length-extension-attack>>.

source: John’s first input, with index 0, contains
de_de: Johns erster Input, mit Index 0, enthält
