Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: Selma’s node shouldn’t initially connect to just one node. If that single node is malicious, she’d have no way of knowing it. If you connect to multiple nodes initially, you can verify that they all send data consistent with each other. If not, one or more nodes are deliberately lying to you, or they themselves have been fooled.
de_de: Selmas Node sollte sich nicht anfangs mit nur einem Node verbinden. Falls dieser einzelne Node bösartig wäre, könnte sie das unmöglich feststellen. Wenn man sich gleich zu Beginn mit mehreren Nodes verbindet, kann man überprüfen, dass die Daten, die diese senden, miteinander konsistent sind. Wenn nicht, dann lügen eine oder mehrere Nodes dich an, oder sie sind selbst hereingefallen.

source: The default way of finding initial node addresses is to look them up in the DNS system. DNS is a global name lookup system, used to look up IP numbers from computer names. For example, when you visit https://bitcoin.org with your web browser, it will use DNS to look up the IP number of the name bitcoin.org. The Bitcoin Core software does the same. Names to look up are hardcoded into Bitcoin Core, just like the hardcoded IP addresses and ports. Several DNS seeds are coded into the software. A lookup of a DNS seed can return several IP addresses, and every new lookup might return a different set of IP addresses. The final, third option is used as a last resort.
de_de: Der normale Weg, initiale Node Adressen zu finden ist, sie im DNS System nachzuschlagen. DNS ist ein globales Namen Nachschlagesystem, das benutzt wird, um die IP Adressen zu Computernamen zu finden. Zum Beispiel, wenn du https://bitcoin.org mit deinem Web Browser besuchst, wird er DNS benutzen, um die IP Adresse zu dem Namen bitcoin.org zu finden. Die Bitcoin Core Software tut dasselbe. Die nachzuschlagenden Namen sind in Bitcoin Core hartkodiert, genau wie die hartkodierten IP Adressen und Ports. Mehrere DNS Seeds sind in die Software hineincodiert. Ein Nachschlagen im DNS kann mehrere IP Adressen zurückliefern, und jedes neue Nachschlagen könnte einen anderen Satz von IP Adressen liefern. Die dritte und letzte Option wird als letzter Ausweg benutzt.

source: Note from <<fig0830>> that DNS lookups don’t return port numbers. The other two methods of finding initial peers usually include one, but the DNS response can return only IP addresses. The nodes on these IP addresses are assumed to listen on the default port that Bitcoin Core listens on, which is 8333.
de_de: Bedenke von <<fig0830>>, dass DNS Nachschlageresultate keine Portnummern enthalten. Die anderen beiden Methoden, initiale Peers zu finden, enthalten normalerweise eine, aber die DNS Antwort kann lediglich IP Adressen liefern. Von den Nodes dieser IP Adressen kann man annehmen, dass sie auf den Default Port von Bitcoin Core horchen, und der ist 8333.

source: Suppose Selma’s node chooses to connect to Qi’s node, 1.234.63.203:4567, and to Rashid’s node, 47.196.31.246:8333. Selma sets up a TCP connection to each of the two nodes and sends an initial message to both of them on the new TCP connections. Let’s look at how she talks to Qi’s node (<<fig0831>>).
de_de: Angenommen Selmas Node verbindet sich mit Qis Node, 1.234.63.203:4567 und mit Rashids Node, 47.196.31.246:8333. Selma richtet eine TCP Verbindung zu jedem der beiden Nodes ein und schickt eine initiale Message an jede der beiden über die neuen TCP Verbindungen. Schauen wir uns an, wie sie mit Qis Node spricht (<<fig0831>>).

source: Selma exchanges a `version` message with Qi.
de_de: Selma tauscht eine `version` Message mit Qi aus.

source: The exchange, called a _handshake_, starts with Selma, who sends a `version` message to Qi. The handshake is used to agree on which protocol version to use and tell each other what block heights they have. The `version` message contains a lot of information not shown in the figure, but the most essential stuff is there:
de_de: Der Austausch, genannt _Handshake_, beginnt bei Selma, die eine `version` Message an Qi schickt. Der Handshake wird benutzt, um sich auf eine Protokollversion zu einigen und um einander mitzuteilen, welche Block Heights sie jeweils haben. Die `version` Messsage enthält eine Menge Information, die nicht im Bild gezeigt wird, aber das Wichtigste ist da:

source: Protocol version
de_de: Protokollversion

source: The version of the network protocol, or “language,” that peers use to talk to each other. Selma and Qi will use version 70012 because that’s the highest version Qi will understand. Selma knows all protocol versions up to her own.
de_de: Die Version des Netzwerkprotokolls, oder der “Sprache,” die Peers benutzen, um miteinander zu reden. Selma und Qi werden version 70012 benutzen, weil das die höchste Version ist, die Qi versteht. Selma kennt alle Protokollversionen bis hinauf zu ihrer eigenen.

source: This is shown as “software identification” in the figure because “user agent” is a bit cryptic. It’s used to hint to the other node what software you’re running, but it can be anything.
de_de: Das wird im Bild als “Software Identifikation” bezeichnet, weil “User Agent” etwas kryptisch klingt. Es wird als Hinweis an den anderen Node benutzt, welche Software bei uns läuft, kann aber beliebig sein.

source: This is the height of the tip of the best chain the node has.
de_de: Dies ist die Höhe, die Height der Spitze der besten Chain, die der Node hat.

source: Other useful information in the `version` message includes
de_de: Sonstige nützliche Informationen in der `version` Message sind unter anderem

source: A list of features this node supports, such as bloom filtering used by lightweight clients.
de_de: Eine Liste von Features, die dieser Node unterstützt, wie die von Lightweight Clients benutzten Bloom Filter.

source: My address
de_de: Meine Adresse

source: The IP address and port of the node sending the `version` message. Without it, Qi wouldn’t know what address to connect to if she restarts and wants to reconnect to Selma’s node.
de_de: Die IP Adresse und Portnummer des Nodes, der die `version` Message schickt. Ohne sie wüsste Qi nach einem Restart nicht, wie sie sich wieder mit Selmas Node verbinden könnte.

source: When Qi’s node receives Selma’s `version` message, Qi will reply with her own `version` message. She’ll also send a `verack` message immediately after the `version` message. The `verack` doesn’t contain any information; rather, it’s used to acknowledge to Selma that Qi has received the `version` message.
de_de: Wenn Qis Node Selmas `version` Message empfängt, antwortet Qi mit ihrer eigenen `version` Message. Ausserdem schickt sie eine `verack` Message direkt am Anschluss an die `version` Message. Das `verack` enthält keine weitere Information; es wird nur benutzt um Selma zu bestätigen, dass Qi die `version` Message erhalten hat.

source: As soon as Selma’s node receives Qi’s `version` message, it will reply with a `verack` message back to Qi’s node. The handshake is done. Selma also goes through the same procedure with Rashid’s node.
de_de: Sobald Selmas Node Qis `version` Message erhalten hat, antwortet sie Qis Node mit einer `verack` Message. Der Handshake ist erledigt. Selma geht dieselbe Prozedur mit Rashids Node durch.

source: Finding peers’ peers
de_de: Die Peers der Peers finden

source: When Selma’s node is connected to Rashid’s node, it will ask that node for other peer addresses to connect to. This way, Selma will be able to expand her set of peers (<<fig0832>>).
de_de: Wenn Selmas Node sich mit Rashids Node verbunden hat, bittet er diesen Node um weitere Peer Adressen, mit denen er sich verbinden kann. So kann Selma ihre Menge an Peers erweitern (<<fig0832>>).

source: Selma asks her peers for more peer addresses to connect to.
de_de: Selma bittet ihre Peers um zusätzliche Peer-Adressen.

source: Selma is only connected to two peers: Qi’s node and Rashid’s node. But she thinks she needs more nodes to connect to. Being connected to only two nodes has some implications:
de_de: Selma ist erst mit zwei Peers verbunden: Qis Node und Rashids Node. Aber sie findet, dass sie Verbindung zu mehr Nodes braucht. Nur mit zwei Nodes verbunden zu sein hat einige Implikationen:

source: Qi and Rashid can collude to hide transactions and blocks from Selma.
de_de: Qi und Rashid könnten kollaborieren, um Transaktionen und Blocks vor Selma geheimzuhalten.

source: Qi’s node may break, leaving Selma with only Rashid’s node. Rashid can then singlehandedly hide information from Selma.
de_de: Qis Node könnte ausfallen, womit Selma dann auf Rashids Node angewiesen ist und dieser könnte den Informationsfluss an Selma beliebig einschränken.

source: Both Qi’s and Rashid’s nodes may break, in which case Selma will be completely disconnected from the network until she connects to some other nodes via the initial peer-lookup mechanisms.
de_de: Sowohl Qis als auch Rashids Nodes könnten ausfallen, womit dann Selma vollständig vom Netzwerk getrennt wäre, bis sie sich über den initialen Peer-Nachschlage-Mechanismus wieder mit ein paar anderen Nodes verbindet.

source: <<fig0833>> shows how Selma asks Rashid for more peer addresses to connect to.
de_de: <<fig0833>> zeigt, wie Selma Rashid um mehr Peer-Adressen zum Verbinden bittet.

source: Selma requests more peer addresses from Rashid’s node. He responds with a bunch.
de_de: Selma erbittet mehr Peer-Adressen von Rashids Node. Er antwortet mit einem ganzen Bündel.

source: Initial nodes
de_de: Initiale Nodes

source: After getting an `addr` message, nodes disconnect from initial nodes (except manually configured ones) to avoid overloading them. They’re initial nodes for many other nodes.
de_de: Nach Empfang einer `addr` Message trennen sich Nodes von den Initialnodes wieder (ausser von den manuell konfigurierten), um deren Überlastung zu verhindern. Sie dienen schliesslich vielen weiteren Nodes als Initialnodes.

source: Selma sends a `getaddr` message to a peer, Rashid’s node. Rashid responds with a set of IP addresses and TCP ports that Selma can use to connect to more peers. Rashid chooses which addresses to send to Selma, but it’s usually the addresses to which Rashid is already connected and possibly some that Rashid collected from his peers but didn’t use himself.
de_de: Selma schickt eine `getaddr` Message an einen Peer, Rashids Node. Rashid antwortet mit einem Satz IP Adressen und TCP Ports, die Selma zum Verbinden mit weiteren Peers benutzen kann. Rashid bestimmt, welche Adressen er Selma schickt, aber normalerweise sind es die Adressen, mit denen Rashid bereits verbunden ist und vielleicht noch ein paar, die Rashid von seinen Peers aufgesammelt, aber nicht selbst verwendet hat.

source: Selma will connect to any number of the received addresses to increase her _connectivity_. The more peers you’re connected to, the better your connectivity. A high degree of connectivity decreases the risk of missing out on information due to misbehaving peers. Also, information propagates more quickly if nodes have higher connectivity. A typical full node in Bitcoin has about 100 active connections at the same time. Only eight (by default) of those are _outbound connections_, meaning connections initiated by that node. The rest are _inbound connections_ initiated by other nodes. Consequently, a full node that isn’t reachable on port 8333 from the internet—for example, due to a firewall—won’t get more than eight connections in total.
de_de: Selma verbindet sich mit einigen der empfangenen Adressen, um ihren Verbindungsgrad, ihre _Connectivity_, zu erhöhen. Mit je mehr Peers man verbunden ist, desto höhere Connectivity hat man. Ein hoher Grad an Connectivity verringert das Risiko, Informationen zu verpassen, weil sich Peers schlecht benehmen. Ausserdem verbreitet sich Information schneller, wenn mehr Nodes eine höhere Connectivity haben. Ein typischer Bitcoin Full Node hat etwa 100 aktive Verbindungen gleichzeitig. Davon sind nur acht (in der Standardeinstellung, dem _Default_) ausgehende Verbindungen oder _outbound Connections_, also Verbindungen, die von diesem Node ausgehend aufgebaut wurden. Der Rest sind einkommende Verbindungen oder _inbound Connections_, die von anderen Nodes aufgebaut wurden. Demzufolge wird ein Full Node, der nicht auf Port 8333 aus dem Internet erreichbar ist–zum Beispiel aufgrund einer Firewall–insgesamt nicht mehr als acht Verbindungen haben.

source: Step 3—Synchronize
de_de: Schritt 3–Synchronisieren

source: Now that Selma is well-connected to, and part of, the Bitcoin network, it’s time for her to download and verify the full blockchain up to the latest block available. This process is called _synchronization_, _sync_, or _initial blockchain download_.
de_de: Jetzt, da Selma gut verbunden mit, und Teil von, dem Bitcoin Netzwerk ist, ist es Zeit für sie, die volle Blockchain bis zum letzten verfügbaren Block herunterzuladen und zu verifizieren.Dieser Prozess heisst _Synchronisierung_, _sync_ oder _Initial Block Download_.

source: Selma has only a single block: the genesis block. The genesis block is hardcoded in the Bitcoin Core software, so all nodes have this block when they start.
de_de: Selma hat nur einen einzigen Block: den Genesis Block. Der Genesis Block ist in der Bitcoin Core Software hartcodiert, sodass alle Nodes ihn beim Start bereits haben.

source: She needs to download all historic blocks from her peers and verify them before she can verify newly created blocks. This is because she has no idea what the current unspent transaction output (UTXO) set looks like. To build the current UTXO set, she needs to start with an empty UTXO set, go through all historic blocks from block 0, and update the UTXO set with the information in the transactions in the blocks.
de_de: Sie muss alle historischen Blocks von ihren Peers herunterladen, bevor sie neu erzeugte Blocks verifizieren kann. Denn sie hat keine Ahnung, wie die aktuelle Menge an unbenutzten Transaktions Outputs (unspent transaction outputs, UTXO Set) aussieht. Um sich das aktuelle UTXO Set zusammen zu bauen, muss sie mit einem leeren UTXO Set beginnen, alle historischen Blocks beginnend bei Block 0 durchgehen und das UTXO Set mit den Informationen aus den Transaktionen in den Blocks aktualisieren.

source: The process is as follows:
de_de: Der Prozess ist wie folgt:

source: Download all historic block headers from one peer, and verify the proof of work.
de_de: Lade alle historischen Block Header von einem Peer herunter und verifiziere den Proof of Work.

source: Download all blocks on the strongest chain from multiple peers in parallel.
de_de: Alle Blocks der stärksten Chain von mehreren Peers gleichzeitig herunterladen.

source: Selma selects one of her peers, Tom, to download all block headers from. <<fig0834>> shows how Selma’s node downloads the block headers from Tom’s node.
de_de: Selma sucht Tom als den Peer aus, von dem sie alle Block Header herunterladen möchte. <<fig0834>> zeigt, wie Selmas Node die Block Header von Toms Node lädt.

source: Simplified
de_de: Vereinfacht

source: The `getheaders` message contains a list of some block IDs from Selma’s blockchain so that Tom can find a common block they both have in case Tom doesn’t have Selma’s tip. Let’s not bother with that.
de_de: Die `getheaders` Message enthält eine Liste einiger Block IDs von Selmas Blockchain, sodass Tom auch dann einen gemeinsamen Block mit Selma finden kann, wenn Tom nicht Selmas Chain Tip hat. Kümmern wir uns aber nicht gross darum.

source: She sends a `getheaders` message containing Selma’s latest block ID, which happens to be the genesis block, block 0. Tom sends back a list of 2,000 block headers; each block header is 80 bytes. Selma verifies each header’s proof of work and requests a new batch of headers from Tom. This process continues until Selma receives a batch of fewer than 2,000 headers from Tom, which is a signal that he has no more headers to give her.
de_de: Sie schickt eine `getheaders` Message mit Selmas jüngster Block ID, die zufälligerweise der Genesis Block, Block 0, ist. Tom schickt eine Liste mit 2.000 Block Headern zurück; jeder Block Header ist 80 Bytes. Selma verifiziert den Proof of Work von jedem Header und fordert ein neues Bündel Header von Tom an. Dieser Prozess setzt sich fort, bis Selma ein Bündel von weniger als 2.000 Headern von Tom erhält, was das Signal dafür ist, dass er keine weiteren Header für Selma hat.

source: Selma downloads block headers from Tom by repeatedly sending a `getheaders` message with her latest block ID.
de_de: Selma lädt die Block Header von Tom, indem sie wiederholt `getheaders` Messages mit ihrer jüngsten Block ID schickt.

source: When Selma has received all the headers from Tom, she determines which branch is the strongest and starts downloading actual block data belonging to that branch from her peers. She can download block data from multiple peers at the same time to speed things up. <<fig0835>> shows her communication with Rashid’s node.
de_de: Wenn Selma alle Header von Tom bekommen hat, bestimmt sie, welcher Zweig der stärkste ist und fängt an, die eigentlichen Blockdaten dieses Zweiges von ihren Peers zu laden. Sie kann von mehreren Peers gleichzeitig Daten holen, um die Geschwindigkeit zu erhöhen. <<fig0835>> zeigt ihre Kommunikation mit Rashids Node.

source: Bigger batches
de_de: Grössere Brocken

source: In this example, Selma requests 3 blocks at a time, but in reality, Bitcoin Core would request a list of at most 16 blocks per batch.
de_de: In diesem Beispiel fordert Selma 3 Blocks auf einmal an, aber in Wirklichkeit würde Bitcoin Core eine Liste von mindestens 16 Blocks pro Bündel anfordern.

source: It starts with Selma, who sends a `getdata` message to Rashid. This message specifies which blocks she wants to download from Rashid, who sends back the requested blocks in `block` messages, one by one. Note that Selma downloads only some of the blocks from Rashid. She also downloads blocks from Tom in parallel, which is why there are gaps in the sequence of requested blocks. The process repeats until Selma doesn’t want any more blocks from Rashid.
de_de: Es beginnt mit Selma, die eine `getdata` Message an Rashid schickt. Diese Message spezifiziert, welche Blocks sie von Rashid laden will, und dieser schickt die angeforderten Blocks einzeln in `block` Messages. Selma lädt wohlgemerkt nur einige der Blocks von Rashid. Sie lädt gleichzeitig auch Blocks von Tom, weshalb es in der Abfolge von Blocks Lücken gibt. Dieser Prozess wiederholt sich, bis Selma keine weiteren Blocks mehr von Rashid will.

source: Selma downloads blocks from Rashid by repeatedly sending a `getdata` message with a list block IDs she wants the blocks for.
de_de: Selma lädt Blocks von Rashid, indem sie wiederholt `getdata` Messages mit einer Liste von Block IDs schickt, zu denen sie die Blocks braucht.

source: Initial download
de_de: Initialer Download

source: The initial blockchain download, about 210 GB as of this writing, takes several hours, even days, depending on your hardware performance and internet speed.
de_de: Der Initial Blockchain Download, ungefähr 210 GB zum Zeitpunkt des Schreibens, dauert einige Stunden bis Tage, abhängig von der Hardwareleistung und Internetgeschwindigkeit.

source: As Selma downloads blocks, Rashid will probably receive more fresh blocks from his peers. Suppose he has received a new block by the time Selma has received the first 100 blocks from Rashid. Rashid will then send out a `headers` message to his peers, including Selma, as described in <<include-the-transaction-in-a-block>>. This way, Selma will be aware of all new blocks appearing during her initial synchronization and can later request them from any peer.
de_de: Während Selma Blocks lädt, wird Rashid wahrscheinlich weitere neue Blocks von seinen Peers erhalten. Angenommen er bekommt einen neuen Block während Selma die ersten 100 Blocks von Rashid erhält. Dann wird Rashid eine `headers` Message an seine Peers, einschliesslich Selma, schicken, wie in <<include-the-transaction-in-a-block>> beschrieben. Auf diese Weise bleibt Selma über alle neuen Blocks informiert, die während ihrer initialen Synchronisation erscheinen, und kann sie später von irgendeinem Peer anfordern.

source: As Selma receives blocks, she verifies them, updates her UTXO set, and adds them to her own blockchain.
de_de: Während Selma Blocks empfängt, verifiziert sie diese, aktualisiert ihr UTXO Set und fügt die Blocks ihrer eigenen Blockchain hinzu.

source: Verifying early blocks
de_de: Verifikation früher Blocks

source: The most time-consuming part of verifying a block is verifying the transaction signatures. If you know of any block ID that’s part of a valid blockchain, you can skip verifying the signatures of all blocks prior to and including this block (<<fig0836>>). This will greatly speed up the initial blockchain download up to that block.
de_de: Der zeitraubendste Teil an der Verifikation eines Blocks ist die Verifikation der Transaktions-Signaturen. Wenn man irgendeine Block ID kennt, die Teil der gültigen Blockchain ist, dann kann man das Verifizieren der Signaturen aller Blocks bis einschliesslich zu diesem überspringen (<<fig0836>>). Das beschleunigt den Initial Blockchain Download bis zu diesem Block stark.

source: To speed up initial block download, signatures of reasonably old transactions won’t be verified.
de_de: Um den Initial Block Download zu beschleunigen, werden die Signaturen hinreichend alter Transaktionen nicht verifiziert.

source: Of course, other stuff, like verifying that no double spends occur or that the block rewards are correct, is still done. The syncing node must build its own UTXO set, so it must still go through all transactions to be able to update the UTXO set accordingly.
de_de: Andere Dinge, wie die Prüfung, dass keine Double-Spends passieren oder dass die Block Rewards korrekt sind, werden immer noch durchgeführt. Der synchronisierende Node muss sein eigenes UTXO Set aufbauen, also muss er immer noch durch alle Transaktionen gehen, um das UTXO Set entsprechend zu aktualisieren.

source: Bitcoin Core ships with a preconfigured block ID of a block from some weeks back from the release date. For Bitcoin Core 0.17.0, that block is
de_de: Bitcoin Core kommt mit der vorkonfigurierten Block ID eines Blocks von einigen Wochen vor dem Release Datum. Für Bitcoin Core 0.17.0 ist dieser Block

source: This is about 10,000 blocks back in the blockchain at release date. This is, of course, a configuration parameter, and the aforementioned block is just a default reasonable value. Selma could have changed this when starting her node, or she could have verified with friends and other sources she trusts that this block is in fact representing an “all valid transactions blockchain.” She could also have disabled the feature to verify all transaction signatures since block 0.
de_de: Das ist ungefähr 10.000 Blocks älter als das Release Datum. Das ist natürlich ein Konfigurationsparameter, und der erwähnte Block ist nur ein vernünftiger Defaultwert. Selma hätte das ändern können, als sie ihren Node gestartet hat, oder sie hätte mit Freunden und anderen vertrauten Quellen verifizieren können, dass dieser Block in der Tat eine “alle Transaktionen sind gültig Blockchain” repräsentiert. Sie hätte das Feature auch sperren können, um alle Transaktionssignaturen seit Block 0 zu überprüfen.

source: After a while, Selma is finally on the same page as the other nodes and ready to enter the normal mode of operation.
de_de: Nach einer Weile ist Selma endlich auf gleicher Höhe mit den anderen Nodes und bereit zum Übergang in den Normalbetrieb.

source: Step 4—Normal operation
de_de: Schritt 4–Normalbetrieb
