Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: You give this transaction, Tx~1~, to your daughter. It’s currently invalid; your daughter stores it on her computer and prints a backup that she keeps in another place. It isn’t broadcast; no full node will accept a block containing this transaction yet. The transaction will become valid the morning of 30 April 2019. If you die before that, your daughter must wait until after the lock-time date and then claim the money by broadcasting the transaction, which will have become valid by then.
de_de: Du gibst diese Transaktion, Tx~1~, deiner Tochter. Die Transaktion ist momentan ungültig; deine Tochter speichert sie in ihrem Computer ab und druckt ein Backup aus, das sie anderswo aufbewahrt. Die Transaktion wird nicht ins Netzwerk gesendet; kein Full Node wird jetzt schon einen Block akzeptieren, der diese Transaktion enthält. Die Transaktion wird erst am Morgen des 30. April 2019 gültig. Wenn du vorher stirbst, muss deine Tochter bis nach der Lock-time warten und dann das Geld anfordern, indem sie die Transaktion sendet, die dann endlich gültig geworden ist.

source: If you don’t die before that date, you want to make sure the time-locked transaction becomes useless so your daughter can’t take the money once the date has passed.
de_de: Wenn du bis zu diesem Tag nicht stirbst, möchtest du sichergehen, dass die time-locked Transaktion nutzlos wird, damit deine Tochter sich nicht nach Ablauf des Datums einfach das Geld nehmen kann.

source: You can create, but not yet broadcast, a new transaction, Tx~2~, that double spends an output that Tx~1~ spends (<<fig0902>>). You then create a new transaction, time-locked for yet another year, for your daugher. When she’s stored the transaction safely, you broadcast Tx2.
de_de: Du kannst eine Transaktion Tx~2~ erzeugen, aber noch nicht senden, die einen Output, den Tx~1~ ausgibt, doppelt ausgibt (<<fig0902>>). Dann erzeugst du eine neue Transaktion für deine Tochter, die für ein weiteres Jahr time-locked ist. Nachdem sie die Transaktion sicher abgespeichert hat, sendest du Tx~2~.

source: Make Tx~1~ invalid by spending an output that Tx~1~ spends, and create a new time-locked transaction for your daughter.
de_de: Mache Tx~1~ ungültig, indem du einen Output ausgibst, den auch Tx~1~ ausgibt, und erzeuge eine neue time-locked Transaktion für deine Tochter.

source: Transaction malleability
de_de: Transaktions-Umformbarkeit, Transaction Malleability

source: There’s a problem here. The txid of Tx~2~ _can_ change while being broadcast, making Tx~3~ forever invalid. This is called _transaction malleability_ and is fixed by using segregated witness as discussed in <<ch10>>.
de_de: Es gibt hier ein Problem. Die txid von Tx~2~ _kann_ sich ändern, während sie gesendet wird, wodurch Tx~3~ für immer ungültig wird. Dieses Problem wird als Transaktions-Umformbarkeit oder _Transaction Malleability_ bezeichnet und durch Segregated Witness behoben, was in <<ch10>> diskutiert wird.

source: You need to
de_de: Du musst

source: Create and sign a transaction, Tx~2~, that spends at least one of the outputs spent by Tx~1~. Tx~2~ is a normal, not time-locked, transaction. Don’t broadcast this transaction just yet.
de_de: Eine Transaktion Tx~2~, erzeugen, die mindestens einen der Outputs ausgibt, die von Tx~1~ ausgegeben werden. Tx~2~ ist eine normale, nicht time-locked Transaktion. Sende diese Transaktion aber noch nicht.

source: Create a new time-locked transaction, Tx~3~, that spends all your outputs as if Tx~2~ was confirmed. Tx~3~ is locked for another year. + Give it to your daughter.
de_de: Eine neue time-locked Transaktion Tx~3~ erzeugen, die alle deine Outputs so ausgibt, als wäre Tx~2~ confirmed. Tx~3~ ist für ein weiteres Jahr gesperrt. + Gib die Transaktion deiner Tochter.

source: Broadcast Tx~2~. Once Tx~2~ is mined, Tx~1~ will become forever invalid because one of the inputs of Tx~1~ is spent by Tx~2~.
de_de: Broadcaste Tx~2~. Wenn Tx~2~ bestätigt ist, wird Tx~1~ für immer ungültig, weil einer der Inputs von Tx~1~ durch Tx~2~ ausgegeben wird.

source: Note how the order of events is important here. If Tx~2~ is broadcast _before_ you give Tx~3~ to your daughter, there’s a chance you’ll die before giving her Tx~3~. Then, your daughter won’t be able to receive the funds because she has no valid transaction to claim them with. Tx~1~ is invalidated by Tx~2~ in the blockchain, and Tx~3~ isn’t in your daughter’s possession.
de_de: Beachte, wie die Reihenfolge der Ereignisse hier wichtig ist. Wenn Tx~2~ gesendet wird _bevor_ du Tx~3~ deiner Tochter gibst, könnte es sein dass du stirbst, bevor du ihr Tx~3~ geben kannst. Dann kann deine Tochter das Geld nicht bekommen, weil sie keine gültige Transaktion hat, mit der sie das Geld einfordern kann. Tx~1~ wurde durch Tx~2~ in der Blockchain ungültig gemacht, und Tx~3~ ist noch nicht im Besitz deiner Tochter.

source: Time measurements
de_de: Zeitmessungen

source: You can express a lock time in two ways. The first is by setting a date and time as in the previous example. The second is to set a block height.
de_de: Du kannst die Verschlusszeit auf zwei Weisen angeben. Erstens durch Setzen von Datum und Zeit wie im vorangegangenen Beispiel. Zweitens durch Setzen einer Blockhöhe oder Block Height.

source: Block time
de_de: Blockzeit

source: The first example expressed the lock time as a date and time. This means the _median time past_ must be greater than the lock time in the transaction. In <<ch07>>, I noted that a block’s timestamp must be greater than the past 11 blocks’ median timestamp, or the _median time past_ of the block. We use the median time past to decide whether a transaction is valid as regards the lock time. Suppose you died on 24 January 2019. Your mourning daughter wouldn’t be able to claim your money until 30 April 2019. <<fig0903>> illustrates this more precisely.
de_de: Das erste Beispiel drückte die Lock Time als Datum und Zeit aus. Das bedeutet, die _Median Time Past_ musste grösser sein als die Lock Time in der Transaktion. In <<ch07>> habe ich angemerkt, dass der Timestamp eines Blocks grösser sein muss als der Median der letzten 11 Block Timestamps, die _Median Time Past_ des Blocks. Wir verwenden Median Time Past, um zu entscheiden, ob eine Transaktion bezüglich der Lock Time gültig ist. Angenommen, du stirbst am 24. Januar 2019. Deine trauernde Tochter wäre bis zum 30. April 2019 nicht in der Lage, dein Geld zu beanspruchen. <<fig0903>> illustriert dies deutlicher.

source: Your daughter can claim your money after the median time past is earlier than your lock time.
de_de: Deine Tochter kann dein Geld beanspruchen, nachdem die Median Time Past vor deiner Lock Time liegt.

source: Your daughter’s transaction can’t be mined in any block before the last one shown. Before that block, the median time past is too early.
de_de: Die Transaktion deiner Tochter kann in keinem Block vor dem letzten gezeigten bestätigt werden. Vor diesem Block ist die Median Time Past zu früh.

source: Her transaction won’t even propagate through the Bitcoin network until the lock time has passed. The nodes don’t want to keep time-locked transactions in their memories because there are better uses for their precious memory space than to fill them up with transactions that aren’t even valid (yet). It’s up to your daughter to broadcast the transaction after the lock time has passed.
de_de: Ihre Transaktion würde sich nicht einmal durch das Bitcoin Netzwerk verbreiten, bis das Time Lock abgelaufen ist. Die Nodes wollen keine zeitgebundenen Transaktionen im Speicher halten, weil es bessere Anwendungen für ihren kostbaren Speicher gibt, als ihn mit Transaktionen zu füllen, die (noch) nicht einmal gültig sind. Es liegt an deiner Tochter, die Transaktion zu senden, nachdem die Lock Time vergangen ist.

source: You can also express time using block height. You can say that a transaction isn’t valid, for example, until after block height 571019. This means the transaction shown in <<fig0904>> can’t be mined until after block 571019 has been mined.
de_de: Man kann Zeit auch als Block Height ausdrücken. Man kann zum Beispiel sagen, dass eine Transaktion nicht gültig ist bis nach Block Height 571019. Das bedeutet, die Transaktion in <<fig0904>> kann nicht bestätigt werden, bis Block 571019 erzeugt worden ist.

source: A time-locked transaction based on block height. This transaction is first valid at block height 571020.
de_de: Eine time-locked Transaktion basierend auf Block Height. Die Transaktion wird erst gültig bei Block Height 571020.

source: The earliest block in which the transaction can be included is at height 571020. It’s hard to predict exactly when that block will be mined, but thanks to the difficulty adjustments that keep the average block time at about 10 minutes, you can expect about 52,596 blocks per year.
de_de: Der früheste Block, in den die Transaktion eingebunden werden kann, ist auf Höhe 571020. Es ist schwer vorauszusagen, wann dieser Block genau produziert werden wird, aber dank der Difficulty Adjustments, welche die durchschnittliche Blockzeit auf rund 10 Minuten einregeln, kann man etwa 52.596 Blocks pro Jahr erwarten.

source: This Bitcoin Improvement Proposal (BIP) describes how an input can require a certain distance in time or blocks from the spent transaction output. It applies to transactions with a version of at least 2.
de_de: Dieser Bitcoin Verbesserungsvorschlag (Bitcoin Improvement Proposal, BIP) beschreibt, wie ein Input einen bestimmten Abstand in Form von Zeit oder Blocks vom ausgegebenen Transaktions Output angeben kann. Er gilt für Transaktionen mit einer Versionsnummer von mindestens 2.

source: The earlier example showed a use case for absolute time locks on transactions. But you can also lock an input of a transaction until its spent output is old enough. This is called a _relative time lock_. You do this on a per-input basis (<<fig0905>>).
de_de: Das frühere Beispiel zeigte einen Anwendungsfall von absoluten Time Locks auf Transaktionen. Man kann den Input einer Transaktion aber auch so lange blockieren, bis sein ausgegebener Output alt genug ist. Das wird als _relativer Time Lock_ bezeichnet. Das geschieht auf Basis der einzelnen Inputs (<<fig0905>>).

source: Relative time locks can be expressed either as a number of blocks or as a number of time units. You use the inputs’ sequence numbers for this.
de_de: Relative Time Locks können entweder als Anzahl Blocks oder als Anzahl Zeiteinheiten angegeben werden. Dafür wird die Sequenznummer der Inputs benutzt.

source: The transaction’s first input has a sequence number of `004013c6`. This says the transaction isn’t valid until 30 days have passed since the spent output was confirmed (<<fig0906>>).
de_de: Die Folgenummer des ersten Inputs der Transaktion lautet `004013c6`. Das bedeutet, dass der Input erst 30 Tage nach Bestätigung des ausgegebenen Outputs gültig wird (<<fig0906>>).

source: The first input locks the transaction for 30 days from the spent output.
de_de: Der erste Input blockiert die Transaktion bis 30 Tage nach Bestätigung des ausgegebenen Outputs.

source: The leftmost bit of this sequence number is 0, which means the relative lock time is enabled. The bit at index 9 from the left is 1, which means the rightmost 16 bits should be interpreted as “number of 512-second intervals.” The 16 rightmost bits are `13c6`, which translates to 5,062 in decimal form; 5,062 intervals of 512 seconds is roughly 30 days.
de_de: Das am weitesten links stehende Bit der Folgenummer ist 0, was bedeutet, dass hier relative Time Locks benutzt werden. Das Bit an Position 9 von links ist 1, was bedeutet, dass die rechten 16 Bits interpretiert werden sollten als “Anzahl Intervalle zu je 512-Sekunden.” Die 16 rechten Bits sind `13c6`, was in dezimaler Form 5.062 lautet; 5.062 Intervalle zu je 512 Sekunden entspricht rund 30 Tagen.

source: The second input has a sequence number of `000003e8` (<<fig0907>>). This means the transaction is invalid until 1,000 blocks have been mined since the spent output was mined.
de_de: Der zweite Input hat eine Sequenznummer von `000003e8` (<<fig0907>>). Das bedeutet, die Transaktion ist solange ungültig, bis 1.000 Blocks produziert wurden, nachdem der ausgegebene Output bestätigt wurde.

source: The second input locks the transaction for 1,000 blocks from the spent output.
de_de: Der zweite Input blockiert die Transaktion für 1.000 Blocks ab dem ausgegebenen Output.

source: The leftmost bit is 0 here, too, which means the relative lock time is enabled for this input. The bit at index 9 from the left is 0, which means the 16 rightmost bits should be interpreted as the number of blocks; `03e8` is hex code for 1,000.
de_de: Das ganz links stehende Bit ist auch hier 0, was bedeutet, dass relative Time Locks für diesen Input eingeschaltet sind. Das Bit an Stelle 9 von links ist 0, was bedeutet, die 16 Bits ganz rechts sollen als Blocknummer interpretiert werden. Der Hex Code `03e8` entspricht 1.000 im Dezimalsystem.

source: The transaction’s version needs to be at least 2 for relative time locks to work. If the version is 1, the sequence numbers won’t have any effect on the relative lock time, but they will affect absolute lock time and the replace-by-fee feature, which I’ll discuss later in <<replace-by-fee>>.
de_de: Die Transaktionsversion muss mindestens 2 sein, damit relative Time Locks funktionieren. Wenn die Version 1 ist, haben die Folgenummern keine Wirkung auf die relative Lock Time, aber sie beeinflussen die absolute Lock Time und das Replace-by-Fee Feature, die wir beide später in <<replace-by-fee>> besprechen.

source: Time-locked outputs
de_de: Zeitverriegelte Outputs

source: Time locks aren’t particularly useful in themselves. The only thing you can do with them is create a transaction that might eventually become valid.
de_de: Zeitschlösser oder Time Locks sind an und für sich nicht sonderlich nützlich. Das einzige, was man mit ihnen machen kann ist, Transaktionen zu erzeugen, die irgendwann gültig werden.

source: It might be more useful to say something like, “The money in this output can’t be spent before New Year’s Eve.” This is an example of a _time-locked output_. An output can be locked absolutely or relatively, and locks can be time-based or height-based.
de_de: Es ist wohl nützlicher, so etwas zu sagen wie: “Das Geld in diesem Output kann erst nach Neujahr ausgegeben werden.” Das wäre ein Beispiel für einen zeitverriegelten Output, oder _time-locked Output_. Ein Output kann absolut oder relativ verriegelt werden, und die Schlösser können zeitbasiert oder blockhöhenbasiert sein.

source: Absolute time-locked outputs
de_de: Absolutzeit-verriegelte Outputs

source: This BIP describes in detail the script operator `OP_CHECKLOCK-` `TIMEVERIFY`, which implements the absolute time-locked output.
de_de: Dieser BIP beschreibt detailliert den Script Operator `OP_CHECKLOCK-` `TIMEVERIFY`, der den Absolutzeit-verriegelten Output implementiert.

source: Suppose you want to give your daughter 1 BTC in allowance on 1 May. You can make a transaction as <<fig0908>> shows.
de_de: Angenommen, du willst deiner Tochter 1 BTC Taschengeld zum 1. Mai geben. Dann kannst du dafür eine Transaktion erzeugen wie in <<fig0908>> dargestellt.

source: Paying allowance in advance to your daughter. She may not spend it before 1 May.
de_de: Taschengeld an die Tochter zahlen. Sie kann es nicht vor dem 1. Mai ausgeben.

source: Using OP_CHECKLOCKTIME VERIFY requires a successive `OP_DROP` due to how the operator was deployed in Bitcoin. You’ll learn about that in <<ch10>>. Ignore it for now.
de_de: Die Benutzung von OP_CHECKLOCKTIME VERIFY verlangt ein anschliessendes `OP_DROP` aufgrund der Art, wie der Operator in Bitcoin umgesetzt wurde. Du lernst darüber mehr in <<ch10>>. Ignoriere es im Moment noch.

source: You can broadcast this transaction immediately to the Bitcoin network and have it mined. The first output is the interesting part. It says that this output can’t be spent before 1 May. For the curious, the exact pubkey script is
de_de: Du kannst diese Transaktion sofort an das Bitcoin Netzwerk senden, und sie bestätigen oder minen lassen. Der erste Output ist der interessante Teil. In ihm steht, dass der Output nicht vor dem 1. Mai ausgegeben werden kann. Für die Neugierigen lautet das genaue Pubkey Script

source: This script will make sure the transaction spending the output is sufficiently time-locked, as <<fig0909>> shows.
de_de: Dieses Script garantiert, dass die Transaktion, die den Output ausgibt, zeitgebunden ist, wie <<fig0909>> zeigt.

source: Various spending transactions and their validity
de_de: Verschiedene ausgebende Transaktionen und ihre Gültigkeit.

source: The first two transactions will never be valid because their time locks aren’t sufficiently late. The first one isn’t locked, which is illegal according to the pubkey script. The second one is at least time-locked, but it isn’t late enough—1 second before 1 May is too early.
de_de: Die ersten beiden Transaktionen werden nie gültig, weil deren Zeitschlösser nicht spät genug sind. Die erste ist gar nicht verriegelt, was laut Pubkey Script ungültig ist. Die zweite ist zwar wenigstens zeitverriegelt, aber nicht spät genug–1 Sekunde vor dem 1. Mai ist zu früh.

source: The third transaction is OK because the time lock is at least as high as the time in the pubkey script, 2019-05-01 00:00:00. This transaction will be valid on and after 1 May. The last transaction will be valid on New Year’s Eve, right before the fireworks. Note, however, that you can’t get both of the last two transactions confirmed—you can get at most one of them confirmed—because they spend the same output.
de_de: Die dritte Transaktion ist OK, weil das Zeitschloss mindestens so spät ist wie die Zeit im Pubkey Script, nämlich 2019-05-01 00:00:00. Diese Transaktion wird ab dem 1. Mai gültig sein. Die letzte Transaktion wird an Sylvester direkt vor dem Feuerwerk gültig. Beachte aber, dass die letzten Transaktionen nicht beide bestätigt werden können–man kann höchstens eine davon bestätigen lassen–da sie beide denselben Output ausgeben.

source: The result of this example is that your daughter will be able to spend the output as she pleases after 1 May.
de_de: Das Ergebnis des Beispiels ist, dass deine Tochter den Output ab dem 1. Mai nach Belieben ausgeben kann.

source: Relative time-locked outputs
de_de: Relativzeit-verriegelte Outputs

source: This BIP describes relative time-locked outputs. The script operator is called `OP_CHECKSEQUENCEVERIFY`.
de_de: Dieser BIP beschreibt Relativzeit-verriegelte Outputs. Der Script Operator heisst `OP_CHECKSEQUENCEVERIFY`.

source: A relative time-locked output works similarly to an absolute time-locked output, but relative locks require a certain amount of time to _pass_ between the block containing the spent output and the block containing the spending transaction (<<fig0910>>).
de_de: Ein Relativzeit-verriegelter Output funktioniert ähnlich wie ein Absolutzeit-verriegelter Output, aber relative Locks fordern, dass eine gewisse Menge Zeit zwischen dem Block mit dem auszugebenden Output und dem Block mit der ausgebenden Transaktion _vergangen_ ist (<<fig0910>>).

source: Spending a relative time-locked output is allowed after a certain number of blocks have passed.
de_de: Das Ausgeben eines Relativzeit-verriegelten Outputs wird nach Ablauf einer gewissen Anzahl Blocks erlaubt.

source: Relative time locks are most commonly used in _digital contracts_. A digital contract can be regarded as a traditional contract between parties, but it’s enforced by the rules of the Bitcoin network rather than national laws. Contracts are expressed as Bitcoin pubkey scripts. We’ll illustrate the use of relative time-locked outputs with an atomic swap in the next subsection. An atomic swap means two people swap coins with each other across different cryptocurrencies.
de_de: Relative Zeitschlösser werden am häufigsten in _Digitalen Verträgen_ verwendet. Ein digitaler Vertrag kann als herkömmlicher Vertrag angesehen werden, der aber mit Hilfe der Regeln des Bitcoin Netzwerks durchgesetzt wird und nicht durch nationale Gesetze. Verträge werden als Bitcoin Pubkey Scripts ausgedrückt. Wir verdeutlichen die Verwendung von zeitverriegelten Outputs bei einem atomaren Tauschgeschäft, einem _atomic Swap_, im nächsten Abschnitt. Ein atomic Swap bedeutet, zwei Leute tauschen Coins miteinander über verschiedene Kryptowährungen hinweg aus.

source: Atomic swaps
de_de: Atomare Tauschgeschäfte / Atomic Swaps

source: Atomic
de_de: Atomar

source: In computer science, the word _atomic_ means a process either completes in its entirety or not at all. For atomic swaps, it means either the swap completes or both parties get to keep their old coins. No other outcomes are possible.
de_de: In der Informatik wird das Wort _atomar_ für Vorgänge benutzt, die entweder vollständig oder gar nicht ablaufen. Bei atomaren Tauschgeschäften bedeutet das, entweder der Tausch läuft vollständig durch, oder beide Seiten behalten ihre alten Coins. Andere Ergebnisse sind ausgeschlossen.

source: A commonly mentioned digital contract is the _atomic swap_, where two parties want to swap coins with each other between different blockchains.
de_de: Ein häufig erwähnter digitaler Vertrag ist der _atomic Swap_, bei dem zwei Parteien Coins über Blockchains hinweg miteinander tauschen wollen.

source: Suppose John is chatting with Fadime on a public forum on the internet. They don’t know each other and have no reason to trust one another. But they both want to trade.
de_de: Angenommen, John chattet mit Fadime auf einem öffentlichen Forum im Internet. Sie kennen einander nicht und haben keine gemeinsame Vertrauensbasis. Aber sie wollen miteinander handeln.

source: They agree that John will trade 2 BTC for 100 of Fadime’s namecoins (NMC). Namecoin is an alt-coin used as a decentralized naming system, like DNS. We talked briefly about alt-coins in <<ch01>>. It isn’t important what Namecoin actually is used for in this example; we only conclude that it’s another cryptocurrency on a blockchain other than Bitcoin’s.
de_de: Sie einigen sich darauf, dass John 2 BTC gegen 100 von Fadimes namecoins (NMC) eintauscht. Namecoin ist eine Alt-Coin, die als dezentralisiertes Namenssystem, ähnlich DNS, benutzt wird. Wir haben Alt-Coins schon kurz in <<ch01>> besprochen. Es ist jetzt nicht wichtig zu wissen, wofür Namecoin eigentlich benutzt wird; wir belassen es dabei, dass es eine andere Kryptowährung auf einer anderen Blockchain als der von Bitcoin ist.

source: The conversation between John and Fadime starts as follows:
de_de: Die Unterhaltung zwischen John und Fadime fängt etwa so an:

source: *John:* Do you want to swap 100 NMC for my 2 BTC? My Namecoin public key is `02381efd…88ca7f23`. I’ve created a secret random number that has the SHA256 hash value H. I will not tell you the secret number yet.
de_de: *John:* Möchtest du 100 NMC gegen meine 2 BTC eintauschen? Mein Namecoin public Key ist `02381efd…88ca7f23`. Ich habe eine geheime Zufallszahl erzeugt, die den SHA256 Hashwert H hat. Ich sage dir aber die Geheimzahl noch nicht.

source: *Fadime:* Sure John, let’s do it! My Bitcoin public key is `02b0c907…df854ee8`.
de_de: *Fadime:* Klar John, machen wir! Mein Bitcoin public Key ist `02b0c907…df854ee8`.

source: We’ll call the secret number S. Only John knows S for now, but he shares the hash of S—which is H—with Fadime. Now, they both have enough information to get started.
de_de: Wir nennen die Geheimzahl S. Nur John kennt momentan S, aber er gibt den Hash von S–das ist H–an Fadime weiter. Jetzt haben beide genug Information, um loszulegen.
