Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: The txid of transaction 1
de_de: Die txid von Transaktion 1

source: The index, 1, of the output in transaction 1 to spend
de_de: Den Index, 1, des Outputs in Transaktion 1, der ausgegeben werden soll

source: An empty placeholder for a signature
de_de: Einen leeren Platzhalter für eine Signatur

source: His second input, with index 1, contains
de_de: Sein zweiter Input, mit Index 1, enthält

source: The txid of transaction 2
de_de: Die txid von Transaktion 2

source: The index, 0, of the output in transaction 2 to spend
de_de: Den Index, 0, des Outputs in Transaktion 2, der ausgegeben werden soll

source: John will fill in the signatures last, after the transaction is otherwise complete.
de_de: John wird die Signaturen am Schluss ausfüllen, nachdem die Transaktion ansonsten vollständig ist.

source: A transaction output contains an amount and a PKH. John’s transaction has two outputs. The output at index 0 pays 10 CT to PKH~C~, the cafe, for the cookie. The output at index 1 pays 3 CT back to one of John’s own keys, PKH~3~. We call this _change_ because it resembles traditional change, in which you pay $75 with a $100 bill and get $25 back: John pays with 13 CT and gets 3 CT back to his change address, PKH~3~. Change is needed because you can’t partly spend a transaction output. You either spend it completely, or you don’t spend it.
de_de: Ein Transaktions-Output enthält einen Betrag und einen PKH. Johns Transaktion hat zwei Outputs. Der Output an Index 0 zahlt 10 CT an PKH~C~, das Café, für den Keks. Der Output an Index 1 zahlt 3 CT an einen von Johns Keys zurück, PKH~3~. Wir nennen das _Rückgeld_ oder _Change_, weil es traditionellem Wechselgeld oder Rückgeld entspricht, wie man es bekommt, wenn man $75 mit einem $100 Schein bezahlt und $25 zurückbekommt: John bezahlt mit 13 CT und bekommt 3 CT zurück an seine Change Adresse, PKH~3~. Change ist nötig, weil man einen Transaktions-Output nicht nur teilweise ausgeben kann. Man verbraucht ihn entweder ganz oder gar nicht.

source: The outputs and inputs are a bit more advanced than just specifying a PKH in an output and a signature in the input. In reality, the output contains a computer program that will verify the signature in the spending input. We’ll talk more about this later.
de_de: Hinter Outputs und Inputs steckt ein bisschen mehr als nur die Angabe eines PKH in einem Output und einer Signatur in einem Input. Tatsächlich enthält ein Output ein Computerprogramm, das die Signatur im ausgebenden Input verifiziert. Wir besprechen das später genauer.

source: Transaction fee
de_de: Transaktionsgebühr

source: Normally, you need to pay a transaction fee for the Bitcoin network to process your transaction.
de_de: Normalerweise muss man eine Transaktionsgebühr an das Bitcoin Netzwerk bezahlen, damit die Transaktion bearbeitet wird.

source: For a transaction to be valid, the sum of the input amounts must be greater than or equal to the sum of the output amounts. The difference, if any, is called a _transaction fee_, which we’ll discuss in <<ch07>>. For now, John pays no transaction fee, so his output sum matches the input sum exactly.
de_de: Damit eine Transaktion gültig ist, muss die Summe der Inputbeträge grösser oder gleich der Summe der Outputbeträge sein. Die Differenz, so vorhanden, ist die _Transaktionsgebühr_, die wir in <<ch07>> behandeln. werden. Im Moment zahlt John keine Transaktionsgebühren, also sind die Summen der Outputs und Inputs gleich.

source: The transaction is now created, but it isn’t yet signed. Anyone could have created this transaction because it’s based completely on public information. The inputs just refer to transactions in the spreadsheet and indexes within those transactions. But only John will be able to sign this transaction, because only he has the private keys corresponding to PKH~1~ and PKH~2~.
de_de: Die Transaktion ist jetzt zwar erzeugt, aber noch nicht signiert. Diese Transaktion hätte jeder zusammenbauen können; sie basiert vollständig auf frei zugänglicher Information. Die Inputs referenzieren Transaktionen im Spreadsheet und Indizes innerhalb dieser Transaktionen. Aber nur John allein ist in der Lage, diese Transaktion zu signieren, denn nur er hat den private Key, der zu PKH~1~ und PKH~2~ passt.

source: Signing the transaction
de_de: Signieren der Transaktion

source: John clicks OK in his wallet to approve signing the transaction. The wallet now needs to make two signatures, one for PKH~1~ and one for PKH~2~. This is because John must prove he has both the private key for PKH~1~ and the private key for PKH~2~. See <<fig0505>>.
de_de: John klickt in seinem Wallet auf OK, um das Signieren der Transaktion freizugeben. Das Wallet muss jetzt zwei Signaturen erzeugen, eine für PKH~1~ und eine für PKH~2~. Das liegt daran, dass John beweisen muss, dass er sowohl den private Key für PKH~1~ als auch den für PKH~2~ besitzt. Siehe <<fig0505>>.

source: John’s wallet signs the transaction. Each input gets its own signature. The public key is also needed in the inputs because anyone should be able to verify the signature.
de_de: Johns Wallet signiert die Transaktion. Jeder Input bekommt seine eigene Signatur. Auch der public Key wird in den Inputs gebraucht, denn jeder soll die Transaktion verifizieren können.

source: Each input needs to be signed individually. The private key corresponding to PKH~1~ must be used to sign the input at index 0 because that input spends money addressed to PKH~1~. Similarly, the private key corresponding to PKH~2~ must be used for the signature of the input at index 1 because it spends money addressed to PKH~2~.
de_de: Jeder Input muss einzeln signiert werden. Der zu PKH~1~ gehörende private Key muss zum Signieren des Inputs an Index 0 benutzt werden, weil dieser Input Geld ausgibt, das an PKH~1~ geschickt worden war. Entsprechend muss der zu PKH~2~ gehörende private Key zum Signieren des Inputs an Index 1 benutzt werden, denn dieser gibt Geld aus, das an PKH~2~ adressiert worden war.

source: Each signature will commit to the entire transaction, which means the signing algorithm will hash the entire transaction, excluding signatures. If anything changes in the transaction, any signature made for this transaction will become invalid.
de_de: Jede Signatur bindet sich an die gesamte Transaktion, was bedeutet, der Signatur-Algorithmus hasht die gesamte Transaktion, ohne Signaturen. Wenn sich irgendetwas an der Transaktion ändert, wird jede Signatur für diese Transaktion ungültig.

source: To make verification easier, you sign a cleaned version of the transaction, which means there are no signatures in any of the inputs. You can’t put a signature in input 0 and _then_ sign input 1. Verification would be difficult if the person verifying didn’t know in what order the signatures were made. If you make _all_ signatures from a cleaned transaction and _then_ add all signatures to it, it doesn’t matter in what order the signatures were made.
de_de: Zur Vereinfachung der Überprüfung signiert man eine bereinigte Version der Transaktion, also eine ohne Signaturen für irgendeinen der nputs. Man kann nicht eine Signatur in Input 0 eintragen und _dann_ Input 1 signieren. Die Verifikation wäre dann schwierig, weil derjenige nicht weiss, in welcher Reihenfolge die Signaturen erstellt wurden. Erstellt man aber _alle_ Signaturen aus einer bereinigten Transaktion und fügt _dann_ alle Signaturen ein, dann ist es egal, in welcher Reihenfolge die Inputs signiert wurden.

source: When the wallet has made all signatures, it adds them to the transaction. But one piece is still missing. How can someone verifying the transaction—for example, the cafe—know which public key to use to verify a signature? The cafe can see only the PKH in the spent output and the signature in the spending input. It can’t get the public key from the PKH because cryptographic hashes are one-way functions, remember? John’s wallet must explicitly add the corresponding public key to the input. The signature in input 0 that spends money from PKH~1~ needs to be verified with the public key from which PKH~1~ was generated. Similarly, input 1 gets the public key corresponding to PKH~2~.
de_de: Wenn das Wallet alle Signaturen erstellt hat, fügt es sie in die Transaktion ein. Aber ein Teil fehlt noch. Woher soll jemand, der die Transaktion überprüfen will–das Café zum Beispiel– wissen, welchen public Key sie zum prüfen der Signatur benutzen sollen? Das Café sieht nur den PKH im ausgegebenen Output und die Signatur im ausgebenden Input. Es kann den public Key aus dem PKH nicht herleiten, weil kryptografische Hashes Einbahnfunktionen sind, weisst du noch? Johns Wallet muss ausdrücklich den entsprechenden public Key dem Input hinzufügen. Die Signatur in Input 0, die Geld von PKH~1~ ausgibt, muss anhand des public Keys geprüft werden, aus dem PKH~1~ generiert wurde. Ebenso bekommt Input 1 den public Key, der zu PKH~2~ gehört.

source: Lisa confirms the transaction
de_de: Lisa bestätigt die Transaktion

source: [x] Create (John)
de_de: [x] Erzeugen (John)

source: The transaction is ready to be sent to Lisa. John’s wallet sends it as an attachment in an email. Lisa picks up the transaction and verifies that:
de_de: Die Transaktion ist bereit zum Senden an Lisa. Johns Wallet schickt es als Anhang in einer Mail. Lisa schnappt sich die Transaktion und prüft, dass:

source: The transaction spends outputs of transactions that actually exist in the spreadsheet and that they aren’t already spent by some other transaction in the spreadsheet.
de_de: Die Transaktion Outputs ausgibt, die im Spreadsheet tatsächlich existieren und noch nicht anderweitig ausgegeben wurden.

source: The total value of the transaction outputs doesn’t exceed the total value of the transaction inputs. Otherwise, the transaction would create new money out of thin air.
de_de: Der Gesamtwert der Transaktions-Outputs den der Transaktions-Inputs nicht übersteigt. Ansonsten würde die Transaktion Geld aus dem Nichts erschaffen.

source: The signatures are correct.
de_de: Die Signaturen korrekt sind.

source: Lisa doesn’t have to calculate the PKH balance anymore, but she needs to check that the spent output exists and isn’t already spent.
de_de: Lisa braucht das Saldo des PKH nicht mehr zu berechnen, aber sie muss noch prüfen, dass der ausgegebene Output existiert und nicht bereits ausgegeben wurde.

source: How does she check that an output of a transaction is unspent? Doesn’t she have to search the spreadsheet to look for transactions that spend this output? Yes, she does. This seems about as cumbersome as searching through the spreadsheet to calculate balances. Don’t worry: Lisa has a plan.
de_de: Wie prüft sie, ob ein Output noch unverbraucht ist? Muss sie nicht das Spreadsheet durchsuchen, um Transaktionen zu finden, die diesen Output verwenden? Ja, das muss sie. Das scheint nicht weniger mühsam als durch das Spreadsheet zu gehen, um die Salden zu berechnen. Aber keine Sorge: Lisa hat einen Plan.

source: Unspent transaction output set
de_de: Unverbrauchter Transaktions Output Set

source: All nodes in the Bitcoin network maintain a private UTXO set to speed up transaction verification.
de_de: Alle Nodes im Bitcoin Netzwerk unterhalten ihr eigenes UTXO Set, um die Verifikation von Transaktionen zu beschleunigen.

source: To make the unspent checks easier, she creates a new, private database that she calls the _UTXO set_ (<<fig0506>>). It’s a set of all UTXOs.
de_de: Um leichter checken zu können, ob ein Output schon verbraucht wurde, erzeugt sie eine neue, private Datenbank, die sie _UTXO set_ nennt (<<fig0506>>). Sie enthält die Menge aller UTXOs.

source: Lisa verifies that John doesn’t double spend by using her UTXO set.
de_de: Lisa verifiziert mit ihrem UTXO Set, dass John nichts doppelt ausgibt.

source: An entry in the UTXO set consists of a txid, an index (idx), and the actual transaction output. Lisa keeps her UTXO set updated while verifying transactions.
de_de: Ein Eintrag im UTXO set besteht aus einer txid, einem Index (idx) und dem eigentlichen Transaktions-Output. Lisa hält ihr UTXO Set während der Überprüfung von Transaktionen stets aktuell.

source: _Double spend_ means to spend the same output twice. Lisa can prevent double spends by consulting her UTXO set.
de_de: _Double Spend_ bedeutet, denselben Output zweimal auszugeben. Lisa kann Double Spends verhindern, indem sie ihr UTXO Set zu Rate zieht.

source: Before Lisa adds John’s transaction to the spreadsheet, she makes sure all outputs that the transaction spends are in the UTXO set. If not, then John is trying to spend money that either never existed in the spreadsheet or is already spent (usually referred to as a _double-spend attempt_).
de_de: Bevor Lisa Johns Transaktion zum Spreadsheet hinzufügt prüft sie, ob alle Outputs, die die Transaktion ausgibt, im UTXO Set sind. Wenn nicht, dann versucht John Geld auszugeben, das entweder nie im Spreadsheet existiert hat, oder das bereits ausgegeben wurde (so etwas wird üblicherweise als _Double Spend Attacke_ bezeichnet).

source: For each input in John’s transaction, Lisa uses her UTXO set to look up the txid and the output index. If all spent outputs are present in the UTXO set, no double-spend attempt or spending of nonexistent coins is detected. In this case, Lisa finds both outputs in her UTXO set and starts verifying signatures. Lisa needs to verify the signatures of both of John’s transaction inputs.
de_de: Zu jedem von Johns Inputs schaut Lisa in ihr UTXO Set nach der txid und dem Output index. Wenn alle auszugebenden Output im UTXO Set liegen, dann findet keine Double-Spend Attacke und kein Ausgeben nicht-existenter Coins statt. In unserem Fall findet Lisa beide Outputs in ihrem UTXO Set und beginnt, die Signaturen zu verifizieren. Lisa muss die Signaturen von beiden von Johns Transaktions-Outputs verifizieren.

source: Lisa verifies the first signature of John’s transaction.
de_de: Lisa verifiziert die erste Signatur von Johns Transaktion.

source: She grabs the PKH from the output spent by the first input and verifies that it matches the hash of the public key in the input (<<fig0507>>). She verifies the signature in the input using the public key, the signature, and the transaction, and then verifies the second input’s signature the same way. Both are good.
de_de: Sie holt sich den PKH von dem Output, der vom ersten Input ausgegeben wird, und verifiziert, dass dieser mit dem Hash des public Keys im Input übereinstimmt (<<fig0507>>). Sie verifiziert die Signatur im Input mit Hilfe des public Keys, der Signatur und der Transaktion und prüft anschliessend die Signatur des zweiten Inputs genauso. Beide Prüfungen verlaufen erfolgreich.

source: Lisa then adds the confirmed transaction to the spreadsheet. She must remove the newly spent outputs from the UTXO set and add the outputs of John’s transaction to it (<<fig0508>>). This is how she keeps the UTXO set updated to reflect the transaction spreadsheet’s contents.
de_de: Lisa trägt die Transaktion dann in ihr Spreadsheet ein. Sie muss jetzt die neu ausgegebenen Outputs aus ihrem UTXO Set entfernen und die Outputs von Johns Transaktion hinzunehmen (<<fig0508>>). So hält sie das UTXO Set aktuell, damit es stets den Inhalt des Spreadsheet widerspiegelt.

source: Lisa adds the transaction to the spreadsheet and removes the spent outputs from the UTXO set.
de_de: Lisa hängt die Transaktion an das Spreadsheet an und entfernt die verbrauchten Outputs aus dem UTXO Set.

source: Rebuilding the UTXO set
de_de: Neuaufbau des UTXO Sets.

source: The UTXO set is built from the transactions in the spreadsheet only. It can be re-created at any time, notably by anyone with read access to the spreadsheet.
de_de: Das UTXO Set wird ausschliesslich aus den Transaktionen im Spreadsheet gewonnen. Es kann jederzeit neu erzeugt werden, und zwar von jedem, der Lesezugriff auf das Spreadsheet hat.

source: Lisa keeps the UTXO set up to date by updating it as <<fig0508>> illustrates for every incoming transaction. If she loses the UTXO set, she can re-create it from the spreadsheet by starting with an empty UTXO set and reapplying all transactions in the spreadsheet to it, one by one.
de_de: Lisa hält das Spreadsheet up-to-date, in dem sie es wie in <<fig0508>> gezeigt mit jeder hereinkommenden Transaktion nachführt. Sollte sie das UTXO Set einmal verlieren, kann sie es aus dem Spreadsheet wieder neu gewinnen, indem sie mit einem leeren UTXO Set beginnt und alle Transaktionen im Spreadsheet eine nach der anderen abarbeitet.

source: It isn’t only Lisa who can create a UTXO set. Anyone with access to the spreadsheet can now do the same. This is important in later chapters, when we replace Lisa with multiple people doing her job. It’s also important for people who just want to verify the spreadsheet to convince themselves the information in it is correct.
de_de: Aber nicht nur Lisa kann ein UTXO Set erzeugen. Jeder mit Zugang zum Spreadsheet kann jetzt dasselbe tun. Das wird in den späteren Kapiteln wichtig, wenn wir Lisa durch mehrere Leute ersetzen, die ihren Job übernehmen. Es ist auch für Leute wichtig, die nur das Spreadsheet verifizieren wollen, um sich von der Korrektheit der Informationen darin überzeugen wollen.

source: Anyone verifies the transaction
de_de: Jeder verifiziert die Transaktion

source: [x] Confirm (Lisa)
de_de: [x] Bestätigen (Lisa)

source: Now that John’s transaction is stored in the spreadsheet exactly as he created it, anyone with read access can verify it. Anyone can create a _private_ UTXO set, work through all the transactions, and end up with the exact same UTXO set as Lisa.
de_de: Jetzt, da Johns Transaktion genauso abgespeichert wird wie er sie erzeugt hat, kann jeder mit Lesezugriff sie überprüfen. Jeder kann ein privates UTXO Set generieren und sich durch die Transaktionen durcharbeiten. Am Ende wird er dasselbe UTXO Set wie Lisa haben.

source: This means anyone can make the same checks that Lisa does. They can verify that Lisa is doing her job. These verifiers are important to the system because they make sure updates to the spreadsheet obey the agreed-on rules.
de_de: Das bedeutet, jeder kann dieselben Checks durchführen wie Lisa. Alle können prüfen, dass Lisa ihren Job korrekt erledigt. Diese Verifikationen sind wichtig für das System, weil sie garantieren, dass Änderungen am Spreadsheet alle vereinbarten Regeln einhalten.

source: In Bitcoin, these verifiers are called _full nodes_. Lisa is also a full node (a verifier), but she does more than a full node—she updates the spreadsheet. A full node is also called a _verifying node_ or, more casually, a _node_ in Bitcoin.
de_de: In Bitcoin heissen diese Verifikatoren _Full Nodes_. Lisa ist also ein Full Node (ein Verifizierer), aber sie tut mehr als ein Full Node–sie aktualisiert auch das Spreadsheet. Ein Full Node heisst auch _verifizierender Node_ oder einfach _Node_ in Bitcoin.

source: [x] Verify (anyone)
de_de: [x] Verifizieren (jeden)

source: Lisa can no longer steal someone else’s money, because doing so would make the spreadsheet invalid. For example, suppose she tried to change the output recipient of John’s transaction from PKH~C~ to PKH~L~. She effectively tries to steal 10 CT from the cafe (<<fig0509>>).
de_de: Lisa kann nicht mehr jemand anderem Geld stehlen, weil das Spreadsheet ungültig würde, wenn sie es täte. Nehmen wir zum Beispiel an, sie würde versuchen, den Output Empfänger von Johns Transaktion von PKH~C~ auf PKH~L~ abzuändern. Sie würde damit effektiv versuchen, 10 CT vom Café zu stehlen (<<fig0509>>).

source: Lisa can no longer steal someone else’s money. If she does, the signatures will become invalid and disclose her immoral act.
de_de: Lisa kann jetzt nicht mehr jemand anderem Geld stehlen. Wenn sie das täte, würden die Signaturen ungültig und damit würde ihr unmoralisches Handeln enthüllt.

source: Because Lisa has changed the contents of John’s transaction, that transaction’s signatures will no longer be valid. Anyone with access to the spreadsheet can notice this because everything is super-transparent.
de_de: Weil Lisa den Inhalt von Johns Transaktion geändert hat, sind die Signaturen nicht mehr gültig. Jeder mit Zugriff auf das Spreadsheet kann dies bemerken, weil alles super transparent ist.

source: Security consequences of public signatures
de_de: Konsequenzen öffentlicher Signaturen für die Sicherheit

source: The good thing about public signatures is that anyone can verify all transactions. But there’s a slight drawback.
de_de: Das Gute an öffentlichen Signaturen ist, dass jeder alle Transaktionen verifizieren kann. Aber es gibt einen kleinen Nachteil.

source: Remember in <<ch03>>, when we introduced PKHs? When you used PKHs, the public key wasn’t revealed in the spreadsheet. This protected money with two security layers: the public-key derivation function and a cryptographic hash function (SHA256 + RIPEMD160). If the public key was revealed somehow, the private key would still be protected by the public-key derivation function. It was like a belt and suspenders type of thing.
de_de: Erinnerst du dich an <<ch03>>, wo wir PKHs eingeführt haben? Wenn du PKH benutzt hast, wurde der public Key im Spreadsheet nicht preisgegeben. Das hat das Geld mit zwei Lagen Sicherheit geschützt: der public Key Ableitungsfunktion und einer kryptografischen Hashfunktion (SHA256 + RIPEMD160). Wenn der public Key irgendwie enthüllt wurde, war der private Key immer noch durch die public Key Ableitungsfunktion geschützt. Es war, wie wenn man Gürtel und Hosenträger gleichzeitig trägt.

source: But using transactions, the public key is revealed in the spending transaction’s input when an output is spent. Look at John’s transaction again in <<fig0510>>.
de_de: Aber wenn man Transaktionen benutzt, wird der public Key im Input der ausgebenden Transaktion preisgegeben, wenn ein Output ausgegeben wird. Schau dir Johns Transaktion in <<fig0510>> noch einmal an.

source: The input reveals the public key. We made an extra effort to avoid this in <<ch03>>.
de_de: Der Input gibt den public Key preis. Wir trieben in <<ch03>> aber einigen Aufwand, um das zu vermeiden.

source: Don’t reuse addresses
de_de: Benutze Adressen nicht mehrfach

source: Bitcoin addresses shouldn’t be reused. Reusing addresses degrades both security and privacy.
de_de: Bitcoin Adressen sollten nicht wiederbenutzt werden. Wiederbenutzung von Adressen verringert sowohl Sicherheit als auch Privacy.

source: The input contains the public key. But it only reveals the public key once the output is spent. This brings up an important point: don’t reuse addresses! If John has other unspent outputs to PKH~1~, those outputs are now less secure because they’re no longer protected by the cryptographic hash function—only by the public-key derivation function.
de_de: Der Input enthält den public Key. Aber er enthüllt den public Key erst, wenn der Output ausgegeben wird. Dies bringt einen wichtigen Punkt hoch: benutze Adressen nie mehrmals. Wenn John noch andere UTXOs auf PKH~1~ hat, dann sind diese Output jetzt weniger sicher, weil sie nicht mehr von der kryptografischen Hashfunktion gesichert werden–nur noch von der public Key Ableitungsfunktion.
