Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: The main worry when doing a soft fork is that the blockchain will split in two and stay that way over a significant time period. If this happened, we would effectively have two cryptocurrencies.
de_de: Die Hauptsorge, wenn man eine Soft Fork macht, ist, dass die Blockchain sich aufspaltet und über eine erhebliche Zeitspanne so bleibt. Wenn dies passiert, haben wir effektiv zwei Kryptowährungen.

source: This would cause confusion: Exchanges would need to decide which branch they considered to be “Bitcoin” and which branches to support for their exchange service. Users would need to be made aware that a split had happened so they could avoid sending money on the wrong branch. Merchants would have to make sure they charged the currency or currencies they intended to. A blockchain split might also cause the cryptocurrency value to change dramatically.
de_de: Das würde zu Konfusion führen: Exchanges müssten entscheiden, welchen Zweig sie als “Bitcoin” betrachten und welche Zweige sie mit ihren Exchange Diensten unterstützen. Benutzer müssten informiert werden, dass ein Split passiert ist, damit sie vermeiden können, Geld an den falschen Zweig zu schicken. Händler müssten sicherstellen, dass sie Rechnungen in der beabsichtigten Währung ausstellen. Ein Blockchain Split könnte auch den Wert der Kryptowährung drastisch fallen lassen.

source: Using coinbase signaling—BIP16
de_de: Coinbase Signalisierung—BIP16

source: When p2sh was introduced in 2012, the Bitcoin community had no experience in upgrading. It had to come up with a way to avoid a blockchain split. The community implemented soft-fork _signaling_ using the coinbase. New miners signaled support for p2sh by putting the string `/P2SH/` into the coinbase of the blocks they produced (<<fig1116>>).
de_de: Als p2sh 2012 eingeführt wurde, hatte die Bitcoin Gemeinde keine Erfahrung mit Upgrades. Sie musste sich etwas einfallen lassen, um einen Blockchain Split zu vermeiden. Die Gemeinde implementierte Soft Fork Signalisierung, oder _Signaling_, mittels der Coinbase. NEU Miner signalisierten Unterstützung für p2sh, indem sie den String `/P2SH/` in die Coinbase der von ihnen produzierten Blocks schrieben (<<fig1116>>).

source: A miner signals support for p2sh by writing `/P2SH/` in the coinbase’s signature script.
de_de: Ein Miner signalisiert Unterstützung für p2sh, indem er `/P2SH/` in das Signatur Script der Coinbase Transaktion einträgt.

source: User-activated soft fork
de_de: Benutzer-aktivierte Soft Fork

source: A deployment method in which users, not just miners, start enforcing rules has become known as a _user-activated soft fork_. We’ll talk about this later in this chapter.
de_de: Eine Deployment Methode, bei der die Benutzer, nicht nur die Miner, mit der Durchsetzung der Regeln beginnen, ist als _User Activated Soft Fork_ bekannt geworden. Wir besprechen dies später in diesem Kapitel

source: On a specific day, the Bitcoin developers checked if at least 550 of the last 1,000 blocks contained `/P2SH/`. They did, so the developers made a new software release that would start enforcing the p2sh rules on 1 April 2012, a flag day.
de_de: An einem bestimmten Tag schauten die Bitcoin Entwickler nach, ob mindestens 550 der letzten 1.000 Blocks `/P2SH/` enthielten. Das war der Fall, und so stellten die Entwickler am 1. April 2012 eine neue Software Release zur Verfügung, die die p2sh Regeln verlangt. Dieser Tag wurde als “Flag Day” bezeichnet, als Signaltag.

source: This worked out well; miners quickly adopted the soft fork, and the entire network upgraded within a reasonable time. No split occurred because at least 50% of the hashrate had upgraded prior to the flag day.
de_de: Das funktionierte gut; Miner übernahmen schnell die Soft Fork und das gesamte Netzwerk installierte innerhalb einer vernünftigen Zeit das Upgrade. Es geschah kein Split, weil mindestens 50% der Hashrate vor dem Signaltag den Upgrade installiert hatte.

source: Using incremented block version number signaling—BIP34, 66, and 65
de_de: Signalisierung durch erhöhte Block Versionsnummern–BIP34, 66 und 65

source: I haven’t talked about it much before, but the block header comes with a version (<<fig1117>>). This version is encoded in the first 4 bytes before the previous block hash.
de_de: Ich habe nicht viel darüber gesprochen, aber der Block Header hat eine eigene Versionsnummer (<<fig1117>>). Diese Version wird in den ersten 4 Byte vor dem eigentlichen Block Hash codiert.

source: The block header contains a block version. The first blocks used version 1.
de_de: Der Block Header enthält eine Blockversion. Die ersten Blocks benutzten Version 1.

source: The version is the only thing missing from our previous block headers. This is the actual 80-byte Bitcoin block header:
de_de: Die Version ist das einzige, was bei unseren früheren Block Headern fehlt. Dies ist der eigentliche 80 Byte Bitcoin Block Header.

source: 4 bytes version 32 bytes previous block id 32 bytes merkle root 4 bytes timestamp 4 bytes target 4 bytes nonce
de_de: 4 Bytes Version 32 Bytes Vorgänger Block ID 32 Bytes Merkle Root 4 Bytes Timestamp 4 Bytes Target 4 Bytes Nonce

source: Total 80 bytes
de_de: Gesamt 80 Bytes

source: The block version can be used to signal support for certain new features.
de_de: Die Blockversion kann verwendet werden, um Unterstützung für gewisse neue Features zu signalisieren.

source: This BIP, “Block v2, Height in coinbase,” describes both how to store the height in the coinbase and how to deploy the change using version numbers.
de_de: Dieser BIP, “Block v2, Height in coinbase,” beschreibt sowohl, wie die Block Height in der Coinbase gespeichert wird, als auch, wie die Änderung mittels Versionsnummern ausgerollt werden soll.

source: The first soft fork deployment using block-version signaling was done in 2013. This soft fork added a rule that all new blocks must contain the block’s height in their coinbase transaction (<<fig1118>>).
de_de: Das erste Soft Fork Deployment mittels Blockversions-Signalisierung geschah 2013. Diese Soft Fork fügte eine Regeln hinzu, dass alle neuen Blocks die Block Height in ihrer Coinbase Transaktion enthalten müssen (<<fig1118>>).

source: BIP34 requires that all blocks contain the block height in the coinbase.
de_de: BIP34 verlangt, dass alle Blocks die Block Height in der Coinbase enthalten.

source: The _activation_ of the soft fork was performed in steps using block-version signaling to avoid a blockchain split:
de_de: Die _Aktivierung_ der Soft Forks geschah schrittweise durch Signalisierung mittels Blockversionsnummern, um einen Split der Blockchain zu verhindern:

source: New miners increase the block version from 1 to 2 (<<fig1119>>). Note that this happens gradually as more and more nodes switch to Bitcoin New over time.
de_de: NEU Miner erhöhen die Blockversion von 1 auf 2 (<<fig1119>>). Beachte, dass dies graduell passiert, weil im Laufe der Zeit zunehmend mehr Nodes auf Bitcoin NEU umschwenken.

source: Miners that run the soft fork signal support for it by increasing their block version.
de_de: Minder, die die Soft Fork betreiben, signalisieren Unterstützung für diese, indem sie die Blockversion erhöhen.

source: Wait until 750 of the last 1,000 blocks have a version of at least 2. When this threshold is reached, the New miners probably have about 75% of the hashrate.
de_de: Warte, bis mindestens 750 der letzten 1.000 Blocks eine Versionsnummer von mindestens 2 haben. Wenn diese Schwelle erreicht ist, haben die NEU Miner wahrscheinlich ungefähr 75% der Hashrate.

source: Start rejecting newly produced version 2 blocks that don’t contain the height in the coinbase. These blocks are falsely signaling for BIP34.
de_de: Beginne neuproduzierte Version 2 Blocks abzulehnen, die nicht die Height in der Coinbase tragen. Diese Blocks signalisieren falsch bezüglich BIP34.

source: Wait until 950 of the last 1,000 blocks have version ≥2. When this happens, the New miners have about 95% of the hashrate.
de_de: Warte, bis 950 der letzten 1.000 Blocks eine Version ≥2 haben. Wenn das passiert, haben die NEU Miner ungefähr 95% der Hashrate.

source: Start rejecting all new blocks with version 1. All miners producing version 1 blocks will be losers because 95% of the hashrate rejects those blocks. The hope is that miners that still haven’t upgraded will do so quickly to avoid losing too much money on mining worthless blocks.
de_de: Beginne, alle neuen Blocks mit Version 1 abzulehnen. Alle Miner, die Version 1 Blocks produzieren, werden verlieren, weil 95% der Hashrate diese Blocks ablehnt. Die Hoffnung ist, dass Miner, die immer noch nicht den Upgrade durchgeführt haben, das nun schnell nachholen, um nicht noch mehr Geld durch das Minen wertloser Blocks zu verlieren.

source: During step 1, nothing has changed. Only Bitcoin Old rules are in effect. But when 750 of the last 1,000 blocks have version 2, we enter the next step. Here, nodes running the soft fork start ensuring that every new block of version 2 has the height in the coinbase. If not, the block is dropped. One reason is that nodes might be deliberately or accidentally using block version 2 for other purposes than this soft fork. The 75% rule removes false positives before evaluating the 95% rule.
de_de: Im Laufe von Schritt 1 hat sich nichts geändert. Es gelten nur die Bitcoin ALT Regeln. Aber wenn 750 der letzten 1.000 Blocks Version 2 haben, betreten wir die nächste Stufe. Hier sorgen die Nodes, auf denen die Soft Fork Software läuft, dafür, dass alle Version 2 Blocks die Block Height in der Coinbase haben. Ansonsten wird der Block fallengelassen. Ein Grund dafür ist, dass Nodes vielleicht absichtlich oder versehentlich aus anderen Gründen als für diese Fork Blockversion 2 signalisieren. Die 75% Regel entfernt solche Fehltreffer, bevor sie die 95% Regel auswertet.

source: From this point, some Old miner _could_ cause a chain split by creating a block of version 2 that violates the “height in coinbase” rule (<<fig1120>>).
de_de: Ab diesem Punkt _könnten_ einige ALT Miner eine Chain Split erzeugen, indem sie einen Block mit Version 2 erzeugen, der die “Height in Coinbase” Regel verletzt (<<fig1120>>).

source: The Old nodes could cause a chain split, but it probably won’t last for long.
de_de: Die ALT Nodes könnten für einen Chain Split sorgen, der aber wohl nicht lange anhalten würde.

source: The Old miners would build on top of that block, whereas the New miners would build on top of the previous block. But the New miners _probably_—depending on the amount of “false” version 2 signaling—have more hashrate and will outperform the Old miners and wipe out the Bitcoin Old branch.
de_de: Die ALT Miner würden auf Basis dieses Blocks weiterbauen, während die NEU Miner auf dem vorigen Block aufbauen würden. Aber die NEU Miner haben _wahrscheinlich_–abhängig von der Menge an falscher Signalisierung für Version 2–mehr Hashrate und werden die ALT Miner abhängen und den Bitcoin ALT Zweig auslöschen.

source: When a greater portion of the blocks—95% of the last 1,000—signals support with version 2 blocks, we enter the last step, step 5. From this point forward, all blocks with versions < 2 will be dropped.
de_de: Wenn ein grösserer Anteil der Blocks–95% der letzten 1.000–mit Version 2 Blocks Unterstützung signalisiert, gehen wird den letzten Schritt, Schritt 5. Von diesem Punkt an werden alle Blocks mit Version < 2 fallengelassen.

source: Why did we go through these stages? It isn’t entirely clear why the 75% rule was used, but it does remove false positives, as described. The deployment might have worked fine with the 95% rule only. We won’t explore the rationale behind the 75% rule—just accept that it was used for this deployment and a few others. <<tab1102>> lists soft forks that were introduced using this mechanism.
de_de: Warum sind wir durch diese Phasen gegangen? Es ist nicht völlig klar, weshalb die 75% Regel benutzt wurde, aber es entfernt _False Positives_, also Fehltreffer, wie beschrieben. Das Deployment hätte auch nur mit der 95% Regel funktionieren können. Wir werden den Gedankengang hinter der 75% Regel nicht ergründen–akzeptieren wir, dass es für dieses und ein paar andere Deployments benutzt wurde. <<tab1102>> listet Soft Forks auf, die mit diesem Mechanismus eingeführt wurden.

source: Features deployed an using incremented block version
de_de: Per hochgezählter Blockversion ausgerollte Features

source: | BIP | Name | Date | Block version | BIP34 | Block v2, Height in Coinbase | March 2013 | 2 | BIP66 | Strict DER Encoding | July 2015 | 3 | BIP65 | OP_CHECKLOCKTIMEVERIFY | December 2015 | 4
de_de: | BIP | Name | Datum | Block Version | BIP34 | Block v2, Height in Coinbase | März 2013 | 2 | BIP66 | Striktes DER Encoding | Juli 2015 | 3 | BIP65 | OP_CHECKLOCKTIMEVERIFY | Dezember 2015 | 4

source: The upgrade mechanism just described is called a _miner-activated_ soft fork. The miners start enforcing the new rules, and all or most full nodes will follow because the New blocks are accepted by both Old and New full nodes.
de_de: Dieser Upgrademechanismus heisst _Miner-aktivierte_ Soft Fork. Die Miner beginnen mit der Durchsetzung der neuen Regeln, und alle oder die meisten Full Nodes werden dem folgen, weil die NEU Blocks von sowohl NEU als auch ALT Nodes akzeptiert werden.

source: Using block version bits signaling—BIP9
de_de: Block-Versionsbits-Signalisierung–BIP9

source: This BIP specifies a standard for how to use the block header’s version field to perform multiple simultaneous deployments.
de_de: Dieser BIP spezifiziert einen Standard dafür, wie das Versions Feld im Block Header verwendet wird, um mehrere gleichzeitige Deployments vorzunehmen.

source: Bitcoin’s developers collected a lot of experience from previous soft forks. A few problems needed to be addressed:
de_de: Die Bitcoin Entwickler haben in früheren Soft Forks eine Menge Erfahrung gesammelt. Ein paar Probleme müssen adressiert werden:

source: You can only deploy one soft fork at a time.
de_de: Man kann nur eine Soft Fork auf einmal ausrollen.

source: Used block versions can’t be reused for new purposes.
de_de: Benutzte Blockversionen können nicht für andere Zwecke erneut verwendet werden.

source: The most annoying problem is that you can’t roll out multiple soft forks at once. This is because previous deployment mechanisms, such as the one used for BIP34, checked whether a block version was greater than or equal to a certain number, for example, 2.
de_de: Das lästigste Problem ist, dass man nicht mehrere Soft Forks auf einmal ausrollen kann. Das liegt daran, dass frühere Deployment Mechanismen, wie das für BIP34 verwendete, geprüft haben, ob eine Blockversion grösser oder gleich einer bestimmten Zahl war, zum Beispiel 2.

source: Suppose you wanted to deploy both BIP34 and BIP66 simultaneously. BIP34 would use block version 2, and BIP66 would use block version 3. This would mean you couldn’t selectively signal support for only BIP66; you’d also have to signal support for BIP34 because your block’s version 3 is greater than or equal to 2.
de_de: Angenommen, du möchtest sowohl BIP34 als auch BIP66 gleichzeitig ausrollen. BIP34 würde Blockversion 2 benutzen und BIP66 Blockversion 3. Das würde bedeuten, dass man nicht selektiv Unterstützung nur für BIP66 signalisieren könnte; man müsste auch Unterstützung für BIP34 signalisieren, weil die Blockversion 3 grösser oder gleich 2 ist.

source: The developers came up with a bitcoin improvement proposal, BIP9, that describes a process for how to deploy several soft forks simultaneously.
de_de: Die Entwickler liessen sich ein Bitcoin Improvement Proposal, BIP9, einfallen, das einen Prozess beschreibt, wie man mehrere Soft Forks gleichzeitig ausrollen kann.

source: This process also uses the block version, but in a different way. The developers decided to change the way block version bytes are interpreted. Block versions that have the top 3 bits set to exactly `001` are treated differently.
de_de: Der Prozess benutzt ebenfalls die Blockversion, aber auf eine andere Weise. Die Entwickler entschieden, die Interpretation der Blockversions-Bytes zu verändern. Blockversionen, die die obersten 3 Bit genau auf `001` gesetzt haben, werden anders behandelt.

source: First, all such block versions are greater than 4 because the smallest such block version is `20000000`, which is a lot bigger than `00000004`. So, blocks using BIP9 will always support the already-deployed BIP34, 66, and 65. Good.
de_de: Zunächst sind alle solchen Blockversionen grösser als 4, weil die kleinste solche Blockversion `20000000` ist, also erheblich grösser als `00000004`. Also werden Blocks, die BIP9 benutzen, immer die bereits ausgerollten BIP34, 66 und 65 unterstützen. Gut.

source: Next, the 29 bits to the right of the leftmost `001` bits can be used to signal support for at most 29 simultaneous soft forks. Each of the 29 rightmost version bits can be used to independently deploy a single feature or group of features (<<fig1121>>). If a bit is set to `1`, then the miner that produced the block supports the feature represented by that bit number.
de_de: Als nächstes können die 29 Bits rechts von den ganz links stehenden `001` Bits benutzt werden, um Unterstützung für höchstens 29 gleichzeitige Soft Forks zu signalisieren. Jedes der 29 rechten Bits kann verwendet werden, um unabhängig ein einzelnes Feature oder eine Gruppe von Features auszurollen (<<fig1121>>). Wenn ein Bit auf `1` steht, dann unterstützt der Miner, der den Block produziert hat, das Feature, das von diesem Bit repräsentiert wird.

source: The block version is treated differently. Each of the right 29 bits can signal for different proposals.
de_de: Die Blockversion wird anders behandelt. Jedes der 29 Bits kann Support für verschiedene Vorschläge signalisieren.

source: Several parameters need to be defined for each deployable feature:
de_de: Mehrere Parameter müssen für jedes ausrollbare Feature definiert werden:

source: _Name_—A short but descriptive name for the feature
de_de: _Name_—Ein kurzer aber beschreibender Name für das Feature

source: _Bit_—The number of the bit to use for signaling
de_de: _Bit_—Die Nummer der Bits, die für das Signalisieren benutzt wird

source: _Start time_—What time to start monitoring for miner support
de_de: _Startzeit_—Wann die Überwachung der Miner Unterstützung beginnen soll

source: _Timeout_—A time when the deployment will be considered failed
de_de: _Timeout_—Die Zeit, zu der das Deployment als gescheitert betrachtet werden soll

source: The deployment goes through a number of _states_ (see <<fig1122>>). The state is updated _after each retarget period_.
de_de: Das Deployment durchläuft eine Anzahl _Zustände_ (siehe <<fig1122>>). Der Status wird _nach jeder Retarget Period_ aktualisiert.

source: `DEFINED`—The starting state. It means a retarget hasn’t yet happened after the start time.
de_de: `DEFINED`—Der Anfangszustand. Das bedeutet, seit der Startzeit ist noch kein Retarget geschehen.

source: `STARTED`—Wait until at least 1,916 (95%) blocks in the last retarget period signal support.
de_de: `STARTED`—Warte, bis mindestens 1.916 (95%) Blocks in der letzten Retarget Periode Unterstützung signalisieren.

source: `LOCKED_IN`—A grace period to give the remaining nonsignaling miners a chance to upgrade. If they don’t, their blocks might be rejected.
de_de: `LOCKED_IN`—Eine Karenzzeit, um den verbleibenden nicht signalisierenden Minern eine Chance zum Upgrade zu geben. Tun sie das nicht, werden ihre Blocks abgelehnt.

source: Comparing times
de_de: Zeitvergleich

source: When comparing block times to the start time and timeout, we always use median time past, as described in <<timestamp-rules>>.
de_de: Wenn Blockzeiten mit den Start und Endzeiten verglichen werden benutzen wir immer die Median Time Past, wie in <<timestamp-rules>> beschrieben.

source: `ACTIVE`—The new rules are in effect.
de_de: `ACTIVE`—Die neuen Regeln sind aktiv.

source: `FAILED`—The timeout occurred before the deployment got `LOCKED_IN`. If conditions happen simultaneously, timeout has precedence over other conditions, such as the 95% rule.
de_de: `FAILED`—Der Timeout ist abgelaufen, bevor der Ausrollvorgang den Zustand `LOCKED_IN` erreicht hatte. Bei gleichzeitigem Eintreten mehrerer Bedingungen hat der Timeout Vorrang vor anderen Bedingungen wie der 95% Regel.

source: State transitions happen every 2,016 blocks.
de_de: Zustandsübergänge geschehen alle 2.016 Blocks.

source: When the deployment is `ACTIVE` or `FAILED`, the bit used to signal support should be reset to `0` so that it can then be reused for other deployments.
de_de: Wenn der Ausrollvorgang `ACTIVE` oder `FAILED` ist, wird das Bit, das Support signalisiert, auf `0` zurückgesetzt werden, damit es für spätere Ausrollvorgänge wiederverwendet werden kann.

source: Using BIP9 to deploy relative lock time
de_de: Benutzen von BIP9 zum Ausrollen relativer Lock Time

source: BIPs 68, 112, and 113
de_de: BIPs 68, 112 und 113

source: This “feature” is actually a group of BIPs that collectively make the relative lock time work.
de_de: Dieses “Feature” ist eigentlich eine Gruppe von BIPs, die zusammen die relative Lock Time ans Laufen bringen.

source: Let’s look at an example of how a deployment using version bits can play out. We’ll look at how relative lock time was deployed. The developers of this new feature defined the following BIP9 parameters:
de_de: Schauen wir uns ein Beispiel dafür an, wie ein Deployment mittels Versionsbits ablaufen kann. Wir betrachten, wie relative Lock Time ausgerollt wurde. Die Entwickler dieses neuen Features hatten die folgenden BIP9 Parameter definiert:

source: name: csv bit: 0 start time: 2016-05-01 00:00:00 timeout: 2017-05-01 00:00:00
de_de: Name: csv Bit: 0 Startzeit: 2016-05-01 00:00:00 Timeout: 2017-05-01 00:00:00

source: The timeout was one year after the start time, which gave the miners about one year to upgrade to the soft fork implementing this feature.
de_de: Der Timeout lag ein Jahr hinter der Startzeit, was den Minern etwa ein Jahr Zeit gab, auf die Soft Fork umzustellen, die das Feature implementiert.

source: <<fig1123>> shows the state transitions that occurred.
de_de: <<fig1123>> zeigt die Zustandsübergänge, die geschahen.

source: BIP9 deployment of `csv`. It went well.
de_de: BIP9 Deployment von `csv`. Es lief glatt.

source: This deployment went quickly and smoothly. It took only three retarget periods for 95% of the miners to upgrade to the new software.
de_de: Dieses Deployment lief schnell und glatt durch. Es brauchte nur drei Retarget Perioden, bis 95% der Miner auf die neue Software umgestellt hatten.

source: Unfortunately, all deployments aren’t as smooth.
de_de: Unglücklicherweise gingen nicht alle Deployments so glatt.

source: Using BIP9 to deploy segwit
de_de: Benutzung von BIP9 zum Deployment von SegWit

source: Segwit, described in <<ch10>>, also used BIP9 for its deployment, but things didn’t work out as anticipated. It started out the same way `csv` deployment did. The parameters selected for this deployment were as follows:
de_de: SegWit, beschrieben in <<ch10>>, verwendete auch BIP9 für sein Deployment, aber die Dinge liefen nicht wie vorgesehen. Es begann zunächst genau wie mit dem `csv` Deployment. Die Parameter für dieses Deployment waren:

source: name: segwit bit: 1 start time: 2016-11-15 00:00:00 timeout: 2017-11-15 00:00:00
de_de: Name: segwit Bit: 1 Startzeit: 2016-11-15 00:00:00 Timeout: 2017-11-15 00:00:00
