Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: The wallet has now attached enough hashes (3, 4, and 5) to the merkle tree to fill in the blanks upward toward the partial merkle tree root. First, the hash of step 2 is calculated from 3 and 4; then the root is calculated from 2 and 5.
de_de: Das Wallet hat jetzt genügend Hashes (3, 4 und 5) an den Merkle Tree gehängt, um die Leerstellen auf dem Weg nach oben im partiellen Merkle Tree auszufüllen. Zuerst wird den Hash von Schritt 2 aus 3 und 4 berechnet, und dann der Root aus 2 und 5.

source: Compare the calculated merkle root with the merkle root in the block header—the actual merkle root—and verify that they’re the same. Also, check that the hash of Tx~2~ is among the list of hashes received from the full node (<<fig0629>>).
de_de: Vergleiche den berechneten Merkle Root mit dem Merkle Root im Block Header–dem tatsächlichen Merkle Root–und überprüfe, dass beide identisch sind. Prüfe auch, dass der Hash von Tx~2~ in der Liste von Hashes ist, die vom Full Node empfangen wurden (<<fig0629>>).

source: The wallet checks that the merkle roots match and that Tx~2~ is included in the list of hashes. If so, Tx~2~ is proven to belong to the block.
de_de: Das Wallet checkt, dass die Merkle Roots passen und dass Tx~2~ in der Liste der Hashes enthalten ist. Wenn ja, ist bewiesen, dass Tx~2~ sich tatsächlich in dem Block befindet.

source: If the transaction turns out to match one of the hashes in the partial merkle tree, and if the partial merkle tree root matches the merkle root in the block header, the full node has proven that Tx~2~ is part of the block.
de_de: Wenn die Transaktion zu einem der Hashes im partiellen Merkle Tree passt, und der partielle Merkle Tree Root zum Merkle Root im Block Header passt, dass hat der Full Node bewiesen, dass Tx~2~ Teil des Blocks ist.

source: But the full node wanted to send two transactions from this block. How would the merkle proof look with two transactions? Do you send multiple merkle proofs? No—we’ll leave this as an exercise at the end of this chapter.
de_de: Aber der Full Node wollte zwei Transaktionen aus diesem Block schicken. Wie würde der Merkle Proof mit zwei Transaktionen aussehen? Schickt man mehrere Merkle Proofs? Nein–wir lassen das als Übung am Ende des Kapitels.

source: Handling thousands of transactions in a block
de_de: Mit tausenden von Transaktionen in einem Block umgehen

source: The block in the previous example contained only three transactions. You didn’t save much space sending the header, the partial merkle tree, and Tx~2~. You could just as well send all three txids instead of the partial merkle tree—that would be much simpler. But the gains with merkle proofs become more apparent when the number of transactions in a block increases.
de_de: Der Block im vorigen Beispiel hatte nur drei Transaktionen, Man hat nicht viel Platz gespart, indem man den Header, den partiellen Merkle Tree und Tx~2~ geschickt hat. Man hätte genausogut alle drei txids schicken können anstatt den partiellen Merkle Tree–das wäre viel einfacher. Aber der Vorteil von Merkle Proofs werden erkennbar, wenn die Anzahl Transaktionen im Block steigt.

source: Suppose the full node just verified a block containing 12 transactions. It has determined, by testing all transactions against the wallet’s bloom filter, that two of the transactions are potentially interesting to the wallet. <<fig0630>> shows how this would look.
de_de: Angenommen, der Full Node hat gerade einen Block mit 12 Transaktionen verifiziert. Durch Testen aller Transaktionen gegen den Bloom Filter des Wallets hat er festgestellt, dass zwei der Transaktionen potentiell interessant für das Wallet sind. <<fig0630>> zeigt, wie das aussehen würde.

source: Constructing a partial merkle tree from 12 transactions and two interesting transactions
de_de: Konstruktion eines partiellen Merkle Tree aus 12 Transaktionen und zwei interessanten Transaktionen

source: The full node has to send only the block header, the number 12, 14 flags, and seven hashes. This sums to about 240 bytes, far less data than sending the block header and all 12 txids (about 464 bytes).
de_de: Der Full Node braucht nur den Block Header, die Zahl 12, 14 Flags und sieben Hashes zu übermitteln. Das summiert sich zu etwa 240 Bytes, viel weniger Daten als den Block Header und alle 12 txids (etwa 464 bytes).

source: Let’s check some rough numbers to see how the merkle proof compares in size to the full block and the simplistic approach of sending all txids as the number of transactions grows (<<tab0601>>).
de_de: Checken wir mal ein paar grobe Zahlen, um zu sehen, wie der Merkle Proof grössenmässig dasteht im Vergleich zur Grösse des vollen Blocks und dem vereinfachten Ansatz, alle txids zu schicken, bei wachsender Anzahl Transaktionen (<<tab0601>>).

source: Size of merkle proofs compared to the block size and simple proof for different block sizes
de_de: Grösse des Merkle Proofs verglichen mit der Blockgrösse und dem vereinfachten Beweis für verschiedene Blockgrössen

source: | Number of transactions in block | Block size (bytes) | Size of simple proof (bytes) | Size of merkle proof (bytes) | Length of list of hashes | 1 | 330 | 112 | 112 | 1 | 10 | 2,580 | 400 | 240 | 5 | 100 | 25,080 | 3,280 | 336 | 8 | 1,000 | 250,080 | 32,080 | 432 | 11 | 10,000 | 2,500,080 | 320,080 | 560 | 15 | 100,000 | 25,000,080| 3,200,080 | 656 | 18
de_de: | Anzahl Transaktionen im Block | Blockgrösse (Bytes) | Grösse Einfachbeweis (Bytes) | Grösse Merkle Proof (Bytes) | Länge der Hashliste | 1 | 330 | 112 | 112 | 1 | 10 | 2,580 | 400 | 240 | 5 | 100 | 25,080 | 3,280 | 336 | 8 | 1,000 | 250,080 | 32,080 | 432 | 11 | 10,000 | 2,500,080 | 320,080 | 560 | 15 | 100,000 | 25,000,080| 3,200,080 | 656 | 18

source: Bitcoin’s block header is always 80 bytes. The cookie token block headers are slightly bigger because of the signature. In the next chapter, you’ll fix the block header to match Bitcoin’s more closely; and in <<ch11>>, we’ll talk about the version, which is also in the block header.
de_de: Bitcoins Block Header ist immer 80 Bytes lang. Die Cookie Token Block Header sind wegen der Signatur ein wenig grösser. Im nächsten Kapitel ändern wir den Block Header, um dem von Bitcoin ähnlicher zu werden, und in <<ch11>> sprechen wir über die Version, die ebenfalls im Block Header steht.

source: <<tab0601>> assumes that all transactions are 250 bytes and that you only want to prove a single transaction. The block size is calculated as the 80-byte block header plus the number of transactions times 250. The simple proof is calculated as the 80-byte block header plus the number of transactions times 32. The merkle proof is calculated as the 80-byte block header plus the length of the list of hashes times 32. Ignore the flags and number of transactions, because they’re negligible.
de_de: <<tab0601>> geht von einer einheitlichen Grösse aller Transaktionen von 250 Bytes aus, und dass man nur eine Transaktion beweisen möchte. Die Blockgrösse wird berechnet als der 80 Byte Block Header plus die Anzahl Transaktionen mal 250. Der einfache Beweis wird berechnet als der 80 Byte Block Header plus die Anzahl Transaktionen mal 32. Der Merkle Proof ergibt sich zu 80 Bytes Block Header plus die Länge der Hashliste mal 32. Ignoriere die Flags und Anzahl Transaktionen, weil diese vernachlässigbar sind.

source: The merkle proofs don’t grow as fast as the simple proofs, because merkle proofs grow _logarithmically_ with the number of transactions, whereas simple proofs grow _linearly_ with the number of transactions. When the block _doubles_ in size, the merkle proof size roughly increases _by a constant term_ of 32 bytes, whereas the simple proof doubles in size.
de_de: Die Merkle Proofs wachsen nicht so schnell wie die vereinfachten Beweise, weil Merkle Proofs_logarithmisch_ mit der Anzahl Transaktionen wachsen, einfache Beweise hingegen _linear_. Wenn sich der Block in der Grösse _verdoppelt_, vergrössert sich der Merkle Proof ungefähr um einen konstanten Term von 32 Byte, wogegen sich der einfache Beweis in der Grösse verdoppelt.

source: Security of lightweight wallets
de_de: Sicherheit von Lightweight Wallets

source: Lightweight wallets seem like a nice touch for the cookie token system. They certainly are, but users should be aware of what they’re missing out on compared to full nodes.
de_de: Lightweight Wallets scheinen ganz nett zu sein für das Cookie Token System. Das sind sie auch, aber die Benutzer sollten sich darüber klar sein, worauf sie im Gegensatz zu einem Full Node verzichten.

source: Full nodes verify the blockchain’s complete history and know for sure that the money a transaction spends exists and that the signatures are valid.
de_de: Full Node verifizieren die komplette Geschichte der Blockchain und wissen positiv, dass das Geld, das eine Transaktion ausgibt, existiert, und dass die Signaturen gültig sind.

source: A lightweight wallet knows the entire chain of block headers. It will verify that Lisa has correctly signed each block header. When the wallet receives a transaction and a merkle proof, it can check that the transaction is contained in the block and that Lisa signed that block. But it can’t verify a lot of other things. For example:
de_de: Ein Lightweight Wallet kennt die gesamte Kette von Block Headern. Es kann verifizieren, dass Lisa jeden Block Header korrekt signiert hat. Wenn das Wallet eine Transaktion und einen Merkle Proof bekommt, kann es prüfen, ob die Transaktion in dem Block enthalten ist und ob der Block von Lisa signiert wurde. Aber es gibt eine Menge Dinge, die es nicht kann. Zu Beispiel:

source: That the script programs in the transaction all return “OK,” which usually means verifying the signatures of all inputs
de_de: Dass die Script Programme in der Transaktion alle `OK` als Resultat haben, was normalerweise die Verifikation aller Signaturen aller Inputs bedeutet.

source: That the spent outputs aren’t already spent
de_de: Dass die ausgegebenen Outputs nicht bereits vorher ausgegeben wurden

source: That it receives all relevant transactions
de_de: Dass es alle relevanten Transaktionen erhält

source: The lightweight wallet also doesn’t know what rules the full node is following. The full node might have adopted a rule that pays double the reward to Lisa. A typical full node would consider any block that pays too much to Lisa as invalid because that isn’t a rule it signed up for, and would drop the block.
de_de: Das Lightweight Wallet weiss auch nicht, welchen Regeln der Full Node folgt. Der Full Node könnte eine Regel übernommen haben, die die doppelte Belohnung an Lisa ausschüttet. Ein typischer Full Node würde jeden Block, der Lisa zu viel bezahlt, als ungültig betrachten, weil das keine der Regeln ist, mit denen er einverstanden ist, und den Block verwerfen.

source: The lightweight wallet needs to trust the full node to verify those things on its behalf and that the full node is following the rules the wallet expects it to follow.
de_de: Das Lightweight Wallet muss darauf vertrauen, dass der Full Node an seiner Stelle verifiziert und dass der Full Node den Regeln folgt, die das Wallet von ihm erwartet.

source: The full node can hide relevant transactions to the wallet. This means the wallet won’t be notified about some incoming or outgoing transactions.
de_de: Der Full Node kann relevante Information vor dem Wallet geheimhalten. Das bedeutet, das Wallet bekommt über bestimmte eingehende oder ausgehende Transaktionen nicht bescheid.

source: A lightweight wallet gives verification responsibility to the full node it’s connected to. Suppose Lisa produces an invalid block—for example, a block that contains a transaction that spends an output that doesn’t exist. When the full node receives this block, it should verify the block and drop it because it’s invalid. But there might be occasions when the full node, deliberately or accidentally, doesn’t detect the error. Perhaps the cafe is in cahoots with Lisa to fool John—who knows? The cafe and Lisa can, at least temporarily, make John believe he’s received money that he didn’t receive.
de_de: Ein Lightweight Wallet übergibt die Verantwortung für die Verifikation dem Full Node, mit dem es verbunden ist. Nimm an, Lisa produziert einen ungültigen Block–zum Beispiel einen Block mit einer Transaktion, die einen Output ausgibt, der nicht existiert. Wenn der Full Node diesen Block erhält, sollte er den Block prüfen und verwerfen, weil er ungültig ist. Aber es könnte Gelegenheiten geben, bei denen der Full Node, gewollt oder ungewollt, den Fehler nicht feststellt. Vielleicht macht das Café mit Lisa gemeinsame Sache, um John hereinzulegen–wer weiss? Das Café und Lisa können, zumindest vorübergehend, John glauben lassen, er hätte Geld bekommen das er in Wirklichkeit nicht bekommen hat.

source: John can take at least two measures to reduce the risk of being fooled by a full node:
de_de: John kann wenigstens zwei Massnahmen durchführen, um das Risiko, von einem Full Node hinter's Licht geführt zu werden, zu verringern:

source: Connect to multiple full nodes simultaneously
de_de: Sich mit mehreren Full Nodes gleichzeitig verbinden

source: Most lightweight wallets in Bitcoin do this automatically. All full nodes that John’s wallet is connected to must take active part in the conspiracy in order to fool John (<<fig0631>>).
de_de: Die meisten Lightweight Wallet in Bitcoin tun dies automatisch. Alle Full Node, mit denen Johns Wallet verbunden ist, müssten zu einer Verschwörung gehören, um John zu übertölpeln (<<fig0631>>).

source: John’s wallet is connected to multiple full nodes. Hopefully, they don’t all collude to fool John.
de_de: Johns Wallet ist mit mehreren Full Nodes verbunden. Hoffentlich kollaborieren sie nicht alle, um John zu täuschen.

source: Many Bitcoin wallets support connecting to a trusted node. Ask your wallet software’s development team if you’re unsure.
de_de: Viele Bitcoin Wallets unterstützen Verbindungen zu einem Trusted Node. Frag dein Wallet Software Entwicklerteam, wenn du nicht sicher bist.

source: Connect to a trusted node
de_de: Verbindung zu einem Trusted Node

source: A _trusted node_ is a full node that John runs himself on a computer he controls (<<fig0632>>). This way, John can use a lightweight wallet on his mobile phone to save data traffic while still being sure he receives correct information from his full node.
de_de: Ein _Trusted Node_ ist ein Full Node, den John selbst auf einem Computer laufen lässt, den er kontrolliert (<<fig0632>>). Auf diese Weise kann John ein Lightweight Wallet auf seinem Mobiltelefon benutzen, um Daten zu sparen, während er gleichzeitig sicher ist, dass er von seinem Full Node korrekte Informationen erhält.

source: John has set up a trusted node that his lightweight wallet connects to.
de_de: John hat einen Trusted Node aufgesetzt, mit dem sein Lightweight Wallet sich verbindet.

source: The last option is useful if John is concerned some full nodes might adopt rule changes he doesn’t agree with. The only way to be absolutely sure you follow the rules _you want_ is to run your own full node.
de_de: Diese letzte Option ist nützlich, wenn John besorgt ist, dass manche Nodes vielleicht Regeländerungen zustimmen würden, gegen die er etwas hätte. Der einzige Weg, absolut sicher zu sein, dass du den Regeln folgst, die _du_ willst, ist, deinen eigenen Node laufen zu lassen.

source: This chapter has described the blockchain and how it enables full nodes to prove if Lisa has tried to delete or change transactions. The blockchain is a sequence of blocks that are connected through cryptographic hashes.
de_de: Dieses Kapitel hat die Blockchain beschrieben, und wie sie es Full Nodes ermöglicht, zu beweisen, wenn Lisa Transaktionen ändert oder löscht. Die Blockchain ist eine Abfolge von Blocks, die durch kryptografische Hashes miteinander verbunden sind.

source: The merkle root in the block header is the combined hash of all contained transactions. This hash is created by hashing the transactions in a merkle tree structure. Hashes are concatenated pairwise, and the result is hashed to get one level closer to the root.
de_de: Der Merkle Root im Block Header ist der kombinierte Hash aller enthaltenen Transaktionen. Dieser Hash wird durch das Hashen der Transaktionen in einer Merkle Tree Struktur erzeugt. Hashes werden paarweise concateniert, und das Ergebnis wird gehasht, um eine Ebene näher an Root zu kommen.

source: A full node can prove to a lightweight wallet that a transaction is in a block by sending a merkle proof to the wallet. The merkle proof consists of the block header and a partial merkle tree. The merkle proof grows logarithmically with the number of transactions in the block.
de_de: Ein Full Node kann einem Lightweight Wallet beweisen, dass eine bestimmte Transaktion in einem Block ist, indem er einen Merkle Proof an das Wallet schickt. Der Merkle Proof besteht aus dem Block Header und einem partiellen Merkle Tree. Der Merkle Proof wächst logarithmisch mit der Anzahl Transaktionen im Block.

source: For privacy reasons, wallets don’t want just the transactions they’re actually interested in. To obfuscate what addresses belong to it, the wallet uses bloom filters to subscribe to more transactions than those that are actually interesting. It creates a bloom filter and sends it to the full node.
de_de: Aus Gründen der Privacy wollen Wallets nicht einfach die Transaktionen, welche für sie relevant sind. Um zu vernebeln, welche Adressen zu ihnen gehören, benutzt das Wallet Bloom Filter, um sich für mehr Transaktionen anzumelden als die, für die es sich eigentlich interessiert. Es erzeugt einen Bloom Filter und schickt ihn an den Full Node.

source: The full node tests various stuff from the transactions—for example, PKHs in outputs—using the three hash functions. If any such item hashes to indexes all containing `1`, then the node will send the transaction. If not, it won’t send the transaction.
de_de: Der Full Node prüft verschiedene Dinge in den Transaktionen–zum Beispiel PKHs in Outputs–mit Hilfe von drei Hashfunktionen. Wenn eines der Objekte auf Indizes hasht, die auf `1` stehen, schickt der Node die Transaktion. Wenn nicht, schickt der Node die Transaktion nicht.

source: This chapter has solved the issue with deleted or changed transactions. Lisa can’t change the contents of the blockchain without being proven a fraud.
de_de: Diese Kapitel hat das Problem mit gelöschten oder veränderten Transaktionen gelöst. Lisa kann den Inhalt der Blockchain nicht mehr ändern, ohne dass man ihr den Betrug nachweisen kann.

source: Lisa can still censor transactions. She can refuse to confirm transactions being sent to her. She has ultimate power over what goes into the blockchain and what doesn’t. In <<ch07>>, we’ll make it much harder for a single actor like Lisa to make such decisions.
de_de: Lisa kann immer noch Transaktionen zensieren. Sie kann sich weigern, Transaktionen zu bestätigen, die ihr geschickt werden. Sie hat die ultimative Macht über das, was in die Blockchain Eingang findet und was nicht. In <<ch07>> machen wir es für einen einzelnen Akteur wie Lisa viel schwerer, solche Entscheidungen durchzusetzen.

source: We’ve introduced the blockchain, which replaces the spreadsheet on Lisa’s computer (<<tab0602>>). This chapter also introduced a new concept specifically for the cookie token system: the shared folder. This folder will be replaced by a peer-to-peer network of full nodes in <<ch08>>.
de_de: Wir haben die Blockchain eingeführt, die das Spreadsheet auf Lisas Computer ersetzt (<<tab0602>>). Dieses Kapitel hat auch ein neues Konzept speziell für das Cookie Token System eingeführt: den Share. Dieser geteilte Ordner wird in <<ch08>> durch ein Peer-to-Peer Netzwerk von Full Node ersetzt.

source: The spreadsheet is replaced by the blockchain. We also introduced the shared folder, which acts as a placeholder for the Bitcoin network.
de_de: Das Spreadsheet ist durch die Blockchain ersetzt worden. Wir haben auch den geteilten Ordner, oder Share, eingeführt, der als Platzhalter für das Bitcoin Netzwerk dient.

source: | Cookie tokens | Bitcoin | Covered in | 1 cookie token | 1 bitcoin | <<ch02>> | *[.line-through]#The spreadsheet#* | *[.line-through]#The blockchain#* | *[.line-through]#<<ch06>>#* | Lisa | A miner | <<ch07>> | *Block signature* | *Proof of work* | *<<ch07>>* | *The shared folder* | *The Bitcoin network* | *<<ch08>>*
de_de: | Cookie Tokens | Bitcoin | Behandelt in | 1 Cookie Token | 1 bitcoin | <<ch02>> | [.line-through]#*Das Spreadsheet# | [.line-through]#*Die Blockchain# | [.line-through]#*<<ch06>>*# | Lisa | Ein Miner | *<<ch07>>* | *Block Signatur* | *Proof of Work* | *<<ch07>>* | *Der geteilte Ordner* | *Das Bitcoin Netzwerk* | *<<ch08>>*

source: This blockchain is close to how Bitcoin’s blockchain works but with an important difference: Lisa signs the blocks using digital signatures, whereas in Bitcoin, they’re signed using proof of work.
de_de: Die Blockchain ist jetzt fast schon so wie bei Bitcoin, aber mit einem wichtigen Unterschied: Lisa signiert die Blocks mit digitalen Signaturen, wogegen sie in Bitcoin mit Proof of Work signiert werden.

source: It’s time again to release a new version of the cookie token system. Just look at the fancy new features in <<tab0603>>!
de_de: Es ist mal wieder Zeit, eine neue Version des Cookie Token Systems freizugeben. Schaut euch die tollen neuen Features in <<tab0603>> an!

source: Release notes, cookie tokens 6.0
de_de: Release Notes, Cookie Token 6.0

source: 3+|image:{commonimagedir}/new.png[role="gbnew"]6.0
de_de: 3+|image:{commonimagedir}/new.svg[role="gbnew"]6.0

source: | Prevent Lisa from deleting transactions | Signed blocks in a blockchain | Fully validating nodes | Download and verify the entire blockchain. | Lightweight wallet saves data traffic | Bloom filters and merkle proofs
de_de: | Hindert Lisa am Löschen von Transaktionen | Signierte Blöcke in einer Blockchain | Voll validierende Nodes | Lädt und verifiziert die gesamte Blockchain | Lightweight Wallet spart Daten | Bloom Filter und Merkle Proofs

source: How does a block in the blockchain refer to the previous block?
de_de: Wie zeigt ein Block in der Blockchain auf den Vorgängerblock?

source: What information does the merkle root commit to?
de_de: Auf welche Information legt sich der Merkle Root fest (“committet” er sich)?

source: What information does Lisa’s block signature commit to?
de_de: Zu welcher Information committet sich Lisas Block Signatur?

source: How are new cookie tokens (or bitcoins) created?
de_de: Wie werden Cookie Tokens (oder Bitcoin) erzeugt?

source: What transactions would match a bloom filter containing only 1s (`1`)?
de_de: Welche Transaktionen würden einen Bloom Filter passieren, er nur aus 1en (`1`) besteht?

source: What stuff from a transaction does the full node test when determining whether to send a transaction to the lightweight wallet? Skip this exercise if you didn’t read the challenging parts on bloom filters.
de_de: Welches Zeug in einer Transaktion prüft der Full Node, wenn er bestimmt, ob er eine Transaktion an ein Lightweight Wallet schicken soll? Überspringe diese Übung, wenn du nicht die schwierige Passage über Bloom Filter gelesen hast.

source: The hash functions used to create the bloom filter aren’t _cryptographic_ hash functions. Why not?
de_de: Die Hashfunktionen, mit denen die Bloom Filter erstellt werden, sind keine _kryptografischen_ Hashfunktionen. Weshalb nicht?

source: Draw the structure of a merkle tree of a block with five transactions.
de_de: Zeichne die Struktur eines Merkle Trees aus einem Block mit fünf Transaktionen.
