Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: To create an encrypted wallet, you need to create a _new_ wallet using the command `encryptwallet`:
de_de: Um ein verschlüsseltes Wallet zu generieren, musst du ein _neues_ Wallet mit dem Kommando `encryptwallet` erzeugen:

source: This command creates a new encrypted wallet. The `-stdin` option is used to read the password argument from standard input, which in this case means you type the password in your terminal window after starting the command. End your input by pressing Enter and Ctrl-D. The reason for using `-stdin` is that you don’t want the password to be written in the command itself, because most shell interpreters, such as bash, keep a history of commands in a file. The `-stdin` option ensures that the password doesn’t end up in any such history files.
de_de: Dieses Kommando erzeugt ein neues verschlüsseltes Wallet. Die `-stdin` Option wird benutzt, um das Passwort-Argument vom Standard Input zu lesen, was in diesem Falle heisst, du tippst das Passwort in dein Terminal, nachdem du das Kommando abgeschickt hast. Beende die Eingabe durch Drücken von Enter und Ctrl-D. Der Grund für die Benutzung von `-stdin` ist, dass du das Passwort nicht direkt in das Kommando schreiben möchtest, weil die meisten Shell Interpreter, wie bash, die Historie der Kommandos in einer Datei speichern. Die ´-stdin` Option stellt sicher, dass das Passwort nicht in solchen History-Files auftaucht.

source: It’s important to create a new encrypted wallet instead of just encrypting the existing wallet, because the old wallet might already have been compromised on your hard drive. As noted by the output, `bitcoind` has stopped. Bitcoin Core can’t currently switch to a new wallet file while running.
de_de: Es ist wichtig, ein neues verschlüsseltes Wallet zu erzeugen, statt einfach das bestehende Wallet zu verschlüsseln, da das alte Wallet möglicherweise schon auf deiner Festplatte kompromittiert wurde. Wie im Output erwähnt, wurde `bitcoind` gestoppt. Bitcoin Core kann derzeit nicht im laufenden Betrieb das Wallet wechseln.

source: Let’s start `bitcoind` again and look at the wallet. You’ll see something similar to this:
de_de: Starten wir `bitcoind` erneut und schauen uns das Wallet an. Du wirst etwasAähnliches wie hier sehen:

source: Your old, unencrypted wallet.dat has been overwritten by the new, encrypted wallet.dat. For safety, however, your old seed is kept in the new encrypted wallet, in case you had actual funds in the old wallet or accidentally receive funds to that old wallet in the future. The `unlocked_until` value of `0` means your private keys are encrypted with the password you entered when you encrypted your wallet. From now on, you need to decrypt your private keys to access them. You’ll do that when you send bitcoin later.
de_de: Dein altes, unverschlüsseltes wallet.dat ist von dem neuen, verschlüsselten wallet.das überschrieben worden. Aber zur Sicherheit wurde dein alter Seed in dem neuen, verschlüsselten Wallet abgelegt, falls du tatsächlich Geld in dem alten Wallet hattest oder in Zukunft versehentlich Geld auf dieses alte Wallet geschickt bekommst. Der `unlocked_until` Wert von `0` bedeutet, deine private Keys sind mit dem Passwort verschlüsselt, das du beim Verschlüsseln des Wallets eingegeben hattest. Von jetzt an musst du deine private Keys entschlüsseln, wenn du sie benutzen willst. Du wirst das später tun, wenn du bitcoin schickst.

source: Backing up the wallet
de_de: Backup des Wallets

source: You’ve created an encrypted wallet, and before you start using it, you need to back it up. In <<ch04>>, we talked about mnemonic sentences, as defined in BIP39, which made backing up hierarchical deterministic (HD) wallet seeds simple. But this feature is _not_ implemented in Bitcoin Core, for a few reasons—mainly, that the mnemonic sentence lacks information about the following:
de_de: Du hast ein leeres Wallet generiert, und bevor du es anfängst zu benutzen, solltest du davon ein Backup machen. In <<ch04>> haben wir über mnemonische Sätze, wie definiert in BIP39, gesprochen, die das Anfertigen von Backups für hierarchische deterministische (HD) Wallet Seeds einfach machen. Aber dieses Feature ist _nicht_ in Bitcoin Core implementiert, aus ein paar Gründen–hauptsächlich dem, dass dem mnemonischen Satz Informationen fehlen über das folgende:

source: The version of the seed format.
de_de: Die Version des Seed Formats

source: The _birthday_, which is when the seed was created. Without a birthday, you have to scan the entire blockchain to find your old transactions. With a birthday, you only have to scan the blockchain from the birthday onward.
de_de: Der _Geburtstag_, was der Zeitpunkt ist, zu dem der Seed generiert wurde. Ohne einen Geburtstag musst du die gesamte Blockchain scannen, um deine alten Transaktionen zu finden. Mit einem Geburtstag musst du die Blockchain erst ab dem Geburtstag durchsuchen.

source: The derivation paths to use for restoration. This is somewhat remedied by using standard derivation paths, but not all wallets implement the standard.
de_de: Die Ableitungspfade, die zur Wiederherstellung benutzt werden sollen. Das kann zu einem gewissem Grade dadurch behoben werden, dass man die Standard Ableitungspfade benutzt, aber nicht alle Wallets implementieren den Standard.

source: Other arbitrary metadata, such as labels on addresses.
de_de: Sonstige beliebige Metadaten, wie Labels auf Adressen.

source: To back up your Bitcoin Core wallet, you need to make a copy of the wallet.dat file. Be careful not to copy the file using your operating system’s copy facilities while `bitcoind` or `bitcoin-qt` is running. If you do this, your backup might be in an inconsistent state because `bitcoind` might be writing data to it while you copy. To make sure you get a consistent copy of the file while Bitcoin Core is running, run the following command:
de_de: Um ein Backup von deinem Bitcoin Core Wallet zu machen, musst du eine Kopie der wallet.dat Datei machen. Pass auf, dass du die Datei nicht mit den Kopierprogrammen deines Betriebssystems sicherst, während `bitcoind` oder `bitcoin-qt` laufen. Wenn du das tust, könnte dein Backup in einem inkonsistenten Zustand sein, weil `bitcoind` vielleicht gerade Daten hineinschreibt, während du kopierst. Um sicherzustellen, dass du eine konsistente Kopie der Datei bekommst, während Bitcoin Core läuft, benutze das folgende Kommando:

source: This will instruct `bitcoind` to save a copy of the wallet file to walletbackup.dat in your home directory (you can change the name and path of the file to anything you like). The backup file will be an exact copy of the original wallet.dat file. Move the walletbackup.dat file to a safe place—for example, a USB memory stick in a bank safe-deposit box or on a computer at your brother’s apartment.
de_de: Dies instruiert `bitcoind`, eine Kopie der wallet.dat Datei in walletbackup.dat in deinem Heimatverzeichnis zu sichern (man kann den Namen und Pfad nach Belieben ändern). Die Backup Datei wird eine exakte Kopie der Original wallet.dat Datei sein. Lege die walletbackup.dat Datei an einer sichern Stelle ab–zum Beispiel auf einem USB Stick in einem Bankschliessfach oder auf einem Computer im Appartement deines Bruders.

source: Receiving money
de_de: Geld erhalten

source: You’ve created an encrypted, backed-up wallet. Great! Let’s put some bitcoins into it. To do this, you need a Bitcoin address to receive the bitcoins to, so let’s get one:
de_de: Du hast ein verschlüsseltes, gesichertes Wallet. Grossartig! Tun wir etwas bitcoin hinein. Um dies zu tun, brauchst du eine Bitcoin Adresse, an der du die Bitcoin bekommen willst, also holen wir uns eine:

source: This command creates a bech32 p2wpkh address for you. If you prefer another type of address, you can change `bech32` to `legacy` to get a p2pkh address or to `p2sh-segwit` to get a p2wpkh nested in p2sh address. Head back to the <<recap-of-payment-types>> to refresh your memory on the different payment and address types.
de_de: Das Kommando erzeugt eine bech32 p2wpkh Adresse für dich. Wenn dir eine andere Adressart lieber ist, kannst du `bech32` in ` legacy` ändern für eine p2pkh Adresse oder in `p2sh-segwit` um eine p2wpkh eingebettet ist p2sh Adresse zu bekommen. Schlag in <<recap-of-payment-types>> nach, um deine Erinnerung an die verschiedenen Zahlungs- und Adresstypen aufzufrischen.

source: Now, let’s send bitcoin to that address. Be careful not to send money to the address printed in this book (although I’ll happily accept it), but rather to an address you generate yourself with your own full node wallet.
de_de: Jetzt schicken wir bitcoin an diese Adresse. Pass auf, dass du kein Geld an die in diesem Buch abgedruckte Adresse schickst (obwohl ich das natürlich fröhlich nehmen würde), sondern stattdessen an die Adresse, die du selbst mit deinem eigenen Full Node Wallet generiert hast.

source: This raises the question of how to get bitcoins to send to your wallet. You can get bitcoins in several ways:
de_de: Das wirft die Frage auf, wie du bitcoins bekommst, die du an dein Wallet senden kannst. Du kannst bitcoins auf verschiedenen Wegen bekommen:

source: On the web
de_de: Im Web

source: Visit <<web-getting-started>> to find out more about how to get bitcoins where you live.
de_de: Gehe auf <<web-getting-started>>, um mehr darüber herauszufinden, wie man bitcoins dort bekommen kann, wo du wohnst.

source: Buy bitcoins on an exchange.
de_de: Kaufe bitcoins auf einer Echange.

source: Ask friends who have bitcoins if they can give or sell you some.
de_de: Frage Freunde, die bitcoins haben, ob sie dir welche geben oder verkaufen können.

source: Earn bitcoins as payment for your labor.
de_de: Verdiene bitcoins als Bezahlung für deine Arbeit.

source: I’ll leave it up to you how you obtain bitcoins and assume that you somehow will get bitcoins into the address you created previously.
de_de: Ich überlasse es dir, wo du bitcoins herbekommst, und nehme an, dass du irgendwie bitcoins an die Adresse bekommen wirst, die du vorhin erzeugt hast.

source: I made a payment to my new address and then checked my wallet:
de_de: Ich habe eine Zahlung an meine neue Adresse geleistet und dann mein Wallet gecheckt:

source: This shows a pending incoming payment of 5 mBTC (0.005 BTC). I now have to wait until it’s confirmed in the blockchain. Meanwhile, you can dig into the transaction by running the `listtransactions` command. Here are my results:
de_de: Dies zeigt einen ausstehenden Zahlungseingang von 5 mBTC (0,005 BTC). Ich muss jetzt warten, bis es in der Blockchain bestätigt ist. In der Zwischenzeit kannst du dich in die Transaktion vertiefen, indem du das `listtransactions` Kommando ausführst. Hier sind meine Ergebnisse:

source: This transaction has 0 confirmations and pays 0.005 BTC. You can also see that this transaction’s txid is `ebfd0d14…ba45c195`.
de_de: Diese Transaktion hat 0 Confirmations und zahlt 0,005 BTC. Du kannst auch sehen, dass die txid dieser Transaktion `ebfd0d14…ba45c195` ist.

source: Let’s take a closer look at the transaction using the command `getrawtransaction`:
de_de: Schauen wir uns die Transaktion näher an, und zwar mit dem Kommando `getrawtransaction`:

source: This command prints the entire transaction in a human-readable (well, at least developer-readable) form. Let’s start from the top and go through the most relevant parts of this transaction. The `txid` is the transaction id. The `hash` is the double SHA256 hash of the whole transaction, including the witness. For non-segwit transactions, `hash` is equal to `txid`.
de_de: Dieses Kommando gibt die gesamte Transaktion in menschenlesbarer (naja, zumindest in Entwickler-lesbarer) Form aus. Fangen wir oben an und gehen durch die offensichtlich relevantesten Teile der Transaktion durch. Die `txid` ist die Transaktions-ID. Der `hash` ist der Doppel-SHA256 Hash der gesamten Transaktion, einschliesslich des Witness. Für non-SegWit Transaktionen ist `hash` dasselbe wie `txid`.

source: The `size` of the transaction is 223 bytes, and `vsize` (the virtual size) is also 223 vbytes; `vsize` is the transaction’s number of weight units (`892`) divided by 4, so the virtual size of a non-segwit transaction (which this is, because it only spends non-segwit outputs) is equal to its actual `size`.
de_de: Die `size` der Transaktion ist 223 Bytes, und `vsize` (die virtuelle Grösse) ist ebenfalls 223 vBytes; `vsize` ist die Anzahl der Weight Units (`892`) dieser Transaktion, dividiert durch 4, sodass die virtuelle Grösse einer non-SegWit Transaktion (was diese hier ist, weil sie nur non-SegWit Outputs ausgibt) so gross ist wie ihre tatsächliche `size`.

source: The locktime of this transaction is set to `549655`, which was the height of the strongest chain at the time of the transaction’s creation. Thus the transaction can’t be mined until block height 549656. This reduces the attractiveness of an attack in which a miner deliberately tries to reorg the blockchain and include the transaction into a block height that’s already been mined.
de_de: Die Lock Time dieser Transaktion steht auf `549655`, was die Height der stärksten Chain war zu dem Zeitpunkt, als die Transaktion generiert wurde. Daher kann die Transaktion nicht bestätigt werden vor Block Height 549656. Das verringert die Attraktivität einer Attacke, in der ein Miner vorsätzlich versucht, die Blockchain zu reorganisieren und die Transaktion in eine Block Height zu integrieren, die schon mined wurde.

source: Next comes the list of inputs. This transaction has a single input that spends output at index `0` (`vout`) of the transaction with `txid` `8a4023db…909ab22f`. The input spends a p2pkh output.
de_de: Als nächstes kommt die Liste der Inputs. Diese Transaktion hat einen einzelnen Input, der einen Output an Index `0` (`vout`) von der Transaktion mit der `txid` `8a4023db…909ab22f` ausgibt. Der Input gibt einen p2pkh Output.

source: The input’s sequence number is `4294967293`, which is `fffffffd` in hex code. This means the lock time is enabled (≤`fffffffe`) and the transaction is replaceable (≤`fffffffd`) according to BIP125. The meaning of the sequence number was summarized in <<tab0901>>.
de_de: Die Sequenznummer des Inputs lautet `4294967293`, was `fffffffd` in Hex Code ist. Das bedeutet Lock Time ist enabled (≤`fffffffe`) und die Transaktion ist ersetzbar (≤`fffffffd`) gemäss BIP125. Die Bedeutung der Sequenznummer wurde in <<tab0901>> zusammengefasst.

source: After the list of inputs comes the list of transaction outputs. This transaction has a list of two outputs. The first pays 0.00313955 BTC to a p2pkh address you haven’t seen before. This is _probably_ a change output. The second output sends 0.005 BTC to the p2wpkh address created earlier.
de_de: Hinter der Liste der Inputs kommt die Liste der Transaktions Outputs. Diese Transaktion hat eine Liste von zwei Outputs. Der erste zahlt 0,00313955 BTC an eine p2pkh Adresse, die du noch nicht gesehen hast. Das ist _vermutlich_ ein Change Output. Der zweite Output schickt 0,005 BTC an die p2wpkh Adresse, die wir vorhin erzeugt hatten.

source: Let’s see if the transaction is confirmed yet. You can check, for example, with `getbalance`. In my case, if it shows `0.00500000`, then the transaction has confirmed:
de_de: Schauen wir mal, ob die Transaktion inzwischen bestätigt wurde. Du kannst das zum Beispiel mit `getbalance` checken. In meinem Fall, wenn es `0.00500000` zeigt, dann heisst das, die Transaktion wurde bestätigt.

source: Cool, the money is confirmed! Let’s move on.
de_de: Cool, das Geld ist confirmed! Machen wir weiter.

source: Sending money
de_de: Versenden von Geld

source: You’ve received some bitcoins. Now, you want to send bitcoins to someone else. To send bitcoins, you can use the `sendtoaddress` command. You need to make a few decisions first:
de_de: Du hast ein einige bitcoins erhalten. Jetzt möchtest du die bitcoins an jemand anderen schicken. Um bitcoins zu schicken, kannst du das `sendtoaddress` Kommando benutzen. Du musst aber erst ein paar Entscheidungen treffen:

source: Address to send to
de_de: Zieladresse

source: How much money to send: 0.001 BTC
de_de: Zu sendender Betrag: 0,001 BTC

source: How urgent the transaction is: not urgent (you’ll be happy if it confirms within 20 blocks)
de_de: Wie dringend die Transaktion ist: nicht dringend (du bist schon froh, wenn sie innerhalb von 20 Blocks bestätigt wird)

source: I’ll send the bitcoins to address `bc1qu456…5t7uulqm`, but you should get another address to send to. If you have no other wallet, you can create a new address in Bitcoin Core to send to just for experimental purposes. I’ve obfuscated my address below so that you don’t send to my address by mistake.
de_de: Ich sende die bitcoins an Adresse `bc1qu456…5t7uulqm`, aber du solltest dir eine andere Adresse zum schicken aussuchen. Wenn du kein anderes Wallet hast, kannst du auch in Bitcoin Core eine neue Adresse generieren, an die du zum Experimentieren schicken kannst. Ich habe meine Adresse unten unkenntlich gemacht, damit du nicht versehentlich an meine Adresse schickst.

source: Oh, dear! An error. As indicated by the error message, the private keys are encrypted in the wallet.dat file. Bitcoin Core needs the private keys to sign the transaction. To make the private keys accessible, you need to decrypt them. You do this using the `walletpassphrase` command with the `-stdin` option to prevent the passphrase from being stored by your command-line interpreter, such as bash:
de_de: Oh, nein! Ein Fehler. Wie in der Fehlermessage angegeben, liegen die private Keys in der verschlüsselten wallet.dat Datei. Bitcoin Core braucht aber die private Keys, um die Transaktion zu signieren. Um die private Keys nun zugreifbar zu machen, musst du sie entschlüsseln. Das tust du mit dem `walletpassphrase` Kommando mit der `-stdin` Option, um zu verhindern, dass der Passphrase von deinem Kommandointerpreter, wie bash, gespeichert wird.

source: The last argument, `300`, is the number of seconds you should keep the wallet unlocked. After 300 seconds, the wallet will be automatically locked again in case you forget to lock it manually. Let’s retry the `sendtoaddress` command:
de_de: Das letzte Argument, `300`, ist die Anzahl Sekunden, die das Wallet entschlüsselt bleiben soll. Nach 300 Sekunden wird das Wallet automatisch wieder verschlüsselt, für den Fall dass du vergisst, es manuell wieder zu verschlüsseln. Probieren wir das `sendtoaddress` Kommando:

source: The command output a txid for the newly created transaction. This means it went well. You can relock the wallet using the `walletlock` command:
de_de: Das Kommando hat eine txid für die neu erzeugte Transaktion ausgegeben. Das bedeutet, es ist gut gegangen. Du kannst das Wallet mit dem `walletlock` Kommando wieder verschlüsseln:

source: The wallet is now locked. I’ll list my transactions again:
de_de: Das Wallet ist jetzt verschlüsselt. Ich werde meine Transaktionen nochmal auflisten:

source: The new transaction is the last one of the two. It isn’t yet confirmed, as indicated by `"confirmations": 0`. The fee paid was 141 satoshis. Let’s look into this transaction in detail:
de_de: Die neue Transaktion ist die letzte der beiden. Sie ist noch nicht bestätigt, was durch `"confirmations": 0` angezeigt wird. Die bezahlte Fee betrug 141 satoshis. Schauen wir uns die Transaktion noch einmal im Detail an:

source: The first thing to note is that `txid` and `hash` differ. That’s because this is a segwit transaction. As you may recall from <<ch10>>, the witness isn’t included in the txid—that’s how you avoid transaction malleability—but the `hash` in the output includes it. Note that `size` and `vsize` differ, too, which is expected from a segwit transaction. The fee was 141 satoshis, as shown by the `listtransactions` command, and the `vsize` was 141 vbytes. The fee rate was thus selected by Bitcoin Core to be 1 sat/vbyte.
de_de: Als erstes fällt auf, dass `txid` und `hash` sich unterscheiden. Das liegt daran, dass dies eine SegWit Transaktion ist. Wie du dich von <<ch10>> erinnern wirst, ist der Witness nicht in der txid enthalten–so vermeidest du Transaction Malleability–aber der `hash` im Output enthält ihn. Beachte, dass `size` und `vsize` sich ebenfalls unterscheiden, was von einer SegWit Transaktion erwartet werden kann. Die Fee war 141 satoshis, wie durch das `listtransactions` Kommando ausgegeben, und die `vsize` war 141 vbytes. Als Fee Rate wurde von Bitcoin Core also 1 sat/vByte gewählt.

source: The transaction has a single input that spends output `1` of transaction `ebfd0d14…ba45c195`. You should recognize this output from the section where I paid 0.005 BTC to my Bitcoin Core wallet. Because that output was a p2wpkh output, the signature script (`scriptSig`) is empty, and the `txinwitness` contains the signature and pubkey.
de_de: Die Transaktion hat einen einzelnen Input, der Output `1` der Transaktion `ebfd0d14…ba45c195` verbraucht. Du solltest diesen Output aus dem Abschnitt kennen, in dem ich 0,005 BTC an mein Bitcoin Core Wallet geschickt habe. Weil dieser Output ein p2wpkh Output war, ist das Signatur Script (`scriptSig`) leer und der `txinwitness` enthält die Signatur und den public Key.

source: The sequence number of the input is 4294967294, which equals `fffffffe`. This means the transaction has lock time enabled but isn’t replaceable using BIP125 (opt-in replace-by-fee).
de_de: Die Sequenznummer des Inputs ist 4294967294, was gleich `fffffffe` ist. Das bedeutet, die Transaktion hat Lock Time enabled, ist aber nicht ersetzbar mit BIP125 (opt-in Replace-by-Fee).

source: I have two outputs. The first is the change of 0.00399859 BTC back to an address I own. The other is the actual payment of 0.001 BTC. Let’s check the balance again:
de_de: Ich habe zwei Outputs. Der erste ist der Change Output von 0,00399859 BTC zurück an eine Adresse, die mir gehört. Der andere ist die eigentliche Zahlung von 0,001 BTC. Checken wir das Saldo erneut:

source: Yep, there it is. I didn’t have to wait for confirmation to see the new balance, because `getbalance` always includes my own _outgoing_ unconfirmed transactions. I’ve spent my only UTXO (of 0.005 BTC) and created a new UTXO of 0.00399859 to myself:
de_de: Ja, da ist es. Ich musste nicht auf die Bestätigung warten, um den neuen Saldo zu sehen, da "getbalance" immer meine eigenen _ausgehenden_ nicht bestätigten Transaktionen enthält. Ich habe meine einzige UTXO (von 0,005 BTC) ausgegeben und mir eine neue UTXO von 0,00399859 an mich selbst erzeugt:

source: It sums up perfectly.
de_de: Die Summe stimmt exakt.

source: I’ve shown a few commands you can use to wing your Bitcoin Core node, but there’s a lot more to it. Explore `./bitcoin-cli help` to find out more.
de_de: Ich habe einige Kommandos gezeigt, die du benutzen kannst, um mit deinem Bitcoin Core Node loszulegen, aber es gibt noch viel mehr. Guck dir die Ausgabe von `./bitcoin-cli help` an, um mehr herauszufinden.

source: Answers to exercises
de_de: Antworten zu den Übungen

source: Chapter 2
de_de: Kapitel 2

source: A cryptographic hash function.
de_de: Eine kryptografische Hashfunktion.

source: `061a` is `6*256 + (16 + 10) = 1,536 + 26 = 1,562` in decimal form. The binary form of `06` is `0000 0110`, and the binary form of `1a` is `0001 1010`, so the full binary representation is `0000 0110 0001 1010`.
de_de: `061a` ist `6*256 + (16 + 10) = 1,536 + 26 = 1,562` in dezimaler Form. Die binäre Form von `06` ist `0000 0110` und die binäre Form von `1a` ist `0001 1010`, sodass die volle binäre Repräsentation `0000 0110 0001 1010` ist.

source: No. If it was possible, the function wouldn’t be second-pre-image-resistant.
de_de: Nein. Wenn das möglich wäre, wäre die Funktion nicht second-Pre-Image-resistent.
