Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: We can increase the maximum block size somewhat by counting witness bytes with a discount.
de_de: Wir können die maximale Blockgrösse twas vergrössern, indem wir die Witness Bytes mit einem Rabatt zählen.

source: A new address format helps wallets distinguish between legacy payments and segwit payments.
de_de: Ein neues Adressformat hilft Wallets dabei, zwischen herkömmlichen und SegWit Zahlungen zu unterscheiden.

source: Segwit can be “embedded” in old-style p2sh addresses to let old wallets send money to segwit wallets.
de_de: SegWit kann in herkömmliche p2sh Adressen “eingebettet” werden, damit alte Wallets Geld an SegWit Wallets schicken können.

source: Understanding hard forks and soft forks
de_de: Verstehen von Hard Forks und Soft Forks

source: Upgrading Bitcoin safely
de_de: Bitcoin sicher upgraden

source: Understanding that users make the rules
de_de: Verstehen, dass die Benutzer die Regeln machen

source: To understand this chapter, you should be comfortable with concepts like the blockchain (<<ch06>>), proof of work (<<ch07>>), and the peer-to-peer network (<<ch08>>). If you had difficulties with those chapters, I suggest you revisit them before continuing with this chapter. Of course, you can also just try to read on anyway.
de_de: Um dieses Kpaitel zu verstehen, solltest du dich mit Konzepten wie Blockchain (<<ch06>>), Proof of Work (<<ch07>>), und dem Peer-to-Peer Netzwerk (<<ch08>>) auskennen. Wenn du mit diesen Kapiteln Schwierigkeiten hattest, schlage ich vor, du liest sie noch mal durch, bevor du mit diesem Kapitel hier weitermachst. Natürlich kannst du auch einfach versuchen, weiterzulesen.

source: Bitcoin’s consensus rules can change in two ways: via either a soft fork or via a hard fork. These two types of changes are fundamentally different. In <<bitcoin-forks>>, you’ll learn about the differences between hard and soft forks and about what happens when different nodes run different consensus rules. You’ll need to understand this before learning how to safely upgrade Bitcoin’s consensus rules..
de_de: Bitcoins Konsensregeln können sich auf zwei Arten ändern: entweder per Soft Fork oder per Hard Fork. Diese zwei Typen von Änderung sind grundverschieden. In <<bitcoin-forks>> wirst du die Unterschiede zwischen Hard Forks und Soft Forks kennenlernen und was geschieht, wenn verschiedene Nodes unterschiedliche Konsensregeln verwenden. Du musst das verstehen, bevor du lernen kannst, wie man sicher Bitcoins Konsensregeln upgraden kann.

source: Rolling out a consensus rule change over the Bitcoin network can be difficult. Each Bitcoin node is sovereign, and no one dictates what software people should run—users decide for themselves. This makes it hard to roll out, or _deploy_, consensus rule changes without having broad user and miner support. The _deployment mechanisms_ have evolved over time, and we’ll go through this evolution and explore the current state of deployment mechanisms.
de_de: Eine Änderung der Konsensregeln über das ganze Bitcoin Netzwerk auszurollen, kann schwierig sein. Jeder Bitcoin Node ist selbständig, und niemand kann vorschreiben, was für Software die Leute laufen lassen sollen–jeder Benutzer entscheidet für sich selbst. Das macht es schwierig, Änderungen an Konsensregeln auszurollen, zu _deployen_, ohne breiten Support der Benutzer und der Miner zu haben. Die _Deployment Mechanismen_ haben sich im Laufe der Zeit entwickelt und wir gehen durch diese Entwicklung durch und untersuchen den aktuellen Stand der Deployment Mechanismen.

source: As of this writing, most (noncritical) updates to Bitcoin’s consensus rules have been made via _miner-activated soft forks_, in which miners signal support and eventually start enforcing the new rules. But this approach presents some issues—for example, a big miner can veto an upgrade despite broad user adoption. People are looking to solve this with _user-activated soft forks_. This means power is where power belongs: with the people using Bitcoin, the _economic majority_. It’s the economic majority that ultimately and collectively decides the consensus rules, and this insight is put into practice with user-activated soft forks.
de_de: Zum Zeitpunkt des Schreibens dieser Zeilen sind die meisten (unkritischen) Updates an Bitcoins Konsensregeln durch _Miner-aktivierte Soft Forks_ ausgerollt worden, bei denen Miner Unterstützung für neue Regeln signalisieren und irgendwann auch anfangen, die neuen Regeln durchzusetzen. Aber dieser Ansatz bietet einige Probleme–zum Beispiel kann ein grosser Miner trotz weitgehender Benutzerakzeptanz ein Veto gegen einen Upgrade einlegen. Man versucht, dies durch Benutzer-aktivierte Soft Forks, also _User Activated Soft Forks_, UASF, zu lösen. Das bedeutet, die Macht ist dort, wo sie hingehört: bei den Benutzern von Bitcoin, der _wirtschaftlichen Mehrheit_. Es ist die wirtschaftliche Mehrheit, die schlussendlich und kollektiv über die Konsensregeln entscheidet, und diese Einsicht wurde mit Benutzer-aktivierten Soft Forks in die Praxis umgesetzt.

source: _Open source_ software is software that you’re free to download, use, inspect, change, and redistribute as you please. A lot of the software you use on a daily basis is probably open source. Maybe you use the Google Chrome web browser or an Android mobile phone. These are examples of software built on open source projects.
de_de: _Open Source_ Software ist Software, die jeder nach Belieben herunterladen, benutzen, untersuchen, ändern und weiter verteilen kann. Eine Menge der Software, die du täglich benutzt, ist wahrscheinlich Open Source. Vielleicht benutzt du den Google Chrome Web Browser oder ein Android Mobiltelefon. Das sind Beispiele für Software, die auf Basis von Open Source Projekten entstanden ist.

source: Open source projects can be _forked_. If you make a copy of the source code for Linux, make some changes to it, and distribute your new version of the Linux source code, you have created a _fork_ of the project.
de_de: Open Source Projekte können abgespalten, oder _forked_, werden. Wenn du eine Kopie des Source Codes von Linux machst, ein paar Änderungen vornimmst, und es als deine Version vom Linux Source Code vertreibst, hast du eine _Fork_ des Projekts erzeugt.

source: Bitcoin is an open source project that can be forked just like any other open source project, such as Linux. But in this book, _fork_ will mean something different.
de_de: Bitcoin ist ein Open Source Projekt, das genau wie jedes andere Open Source Projekt, wie etwa Linux, geforkt werden kann. Aber in diesem Buch bedeutet _Fork_ etwas anders.

source: Differing definitions
de_de: Abweichende Definitionen

source: People define the term _fork_ in different ways. In this book, I use the definition that I find best, which is “a change in the consensus rules.”
de_de: Man definiert den Begriff _Fork_ auf verschiedene Weisen. In diesem Buch benutze ich die Definition, die mir a, meisten zusagt, und die lautet, eine “Änderung der Konsensregeln.”

source: In the Bitcoin context, the term _fork_ means a change in the consensus rules. The consensus rules define what a valid blockchain is. When some set of nodes uses the same consensus rules, consensus emerges among them about what the current unspent transaction output (UTXO) set—“who owns what”—is. In short, a fork changes the definition of a valid blockchain.
de_de: Im Bitcoin Kontext bezeichnet der Begriff _Fork_ eine Änderung der Konsensregeln. Die Konsensregeln definieren, was eine gültige Blockchain ist. Wenn eine Gruppe Nodes dieselben Konsensregeln benutzt, entsteht unter ihnen ein Konsens darüber, was der aktuelle Satz unverbrauchter Transaktions Outputs (UTXO Set)–“wem gehört was”–ist. Kurz, eine Fork ändert die Definition einer gültigen Blockchain.

source: For example, the rule that limits the block weight to 4,000,000 WU is a consensus rule. Changing that limit would be a fork. But a relay policy that prevents transactions with tiny fees from being relayed isn’t part of the consensus rules. Changing that policy isn’t a fork.
de_de: Zum Beispiel ist die Regel, die das Blockgewicht auf 4.000.000 WU begrenzt, eine Konsensregel. Dieses Limit zu ändern, wäre eine Fork. Aber eine Relay Policy, die Transaktionen mit einzigen Gebühren am weitergeleitet werden hindert, ist nicht Teil der Konsensregeln. Diese Policy zu ändern ist keine Fork.

source: You can change the consensus rules in Bitcoin Core, in a copied version of Bitcoin Core, or in any alternative Bitcoin full-node software program. If someone runs your modified program, that person is running a fork.
de_de: Du kannst die Konsensregeln in Bitcoin Core ändern, in einer kopierten Version von Bitcoin Core, oder in irgendeiner alternativen Bitcoin Full Node Software. Wenn jemand dein modifiziertes Programm laufen lässt, betreibt diese Person eine Fork.

source: We generally categorize forks in Bitcoin as follows (<<fig1101>>):
de_de: Wir kategorisieren Forks in Bitcoin allgemein wie folgt (<<fig1101>>):

source: A hard fork relaxes the consensus rules. Some blocks that was considered invalid by Old nodes, will be considered valid by New nodes. Doubling the maximum allowed block weight would be a hard fork.
de_de: Eine Hard Fork lockert die Konsensregeln. Einige Blocks, die von ALT Nodes als ungültig eingestuft werden, werden von NEU Nodes für gültig betrachtet. Verdoppeln des maximalen Blockgewichts wäre eine Hard Fork.

source: A soft fork tightens the consensus rules. All blocks that New nodes consider valid will also be considered valid by Old nodes, but some blocks considered valid by Old nodes will be considered _invalid_ by New nodes. Reducing the maximum allowed block weight would be a soft fork.
de_de: Eine Soft Fork strafft die Konsensregeln. Alle Blocks, die NEU Nodes als gültig betrachten, werden auch von ALT Nodes als gültig angesehen, aber einige Blocks, die ALT Nodes für gültig halten, werden von NEU Nodes für ungültig erklärt. Eine Verringerung des maximalen Blockgewichts wäre eine Soft Fork.

source: Soft forks tighten the consensus rules, whereas hard forks widen them—for example, decreasing the maximum block weight or increasing it, respectively.
de_de: Soft Forks engen die Konsensregeln ein, wogegen Hard Forks sie erweitern–zum Beispiel Verkleinern respektive Vergrössern des maximalen Blockgewichts.

source: Changes that don’t change the consensus rules, such as modifying the color of the graphical user interface or adding a new feature to the peer-to-peer networking protocol, aren’t Bitcoin forks. But they could be considered forks of a software project in the traditional sense. From now on, I’ll use the term _fork_ only to mean a change of consensus rules.
de_de: Änderungen, die nicht die Konsensregeln ändern, wie das Ändern der Farben in der grafischen Benutzerschnittstelle, oder das Hinzufügen neuer Features zum Peer-to-Peer Netzwerkprotokoll, sind keine Bitcoin Forks. Sie könnten aber als Forks eines Software Projekts im herkömmlichen Sinne betrachtet werden. Von hier an werde ich den Begriff _Fork_ nur im Sinne von Änderungen der Konsensregeln benutzen.

source: As an analogy for soft and hard forks, imagine a popular vegetarian restaurant where lots of vegetarians go to eat. This restaurant has only one dish on its menu. Think of the restaurant as a miner, the guests as full nodes, and the meals served as blocks. The restaurant produces meals that guests eat—the miner produces blocks that full nodes accept.
de_de: Als Analogie zu Soft und Hard Forks stell dir ein beliebtes vegetarisches Restaurant von, wo viele Vegetarier zum Essen hingehen. Dieses Restaurant hat nur ein einziges Menü auf der Speisekarte. Stell dir das Restaurant als einen Miner vor, die Gäste als Full Nodes und die servierten Portionen als Blocks. Das Restaurant produziert Mahlzeiten, die die Gäste verspeisen–die Miner produzieren Blocks, die Full Nodes akzeptieren diese.

source: Imagine that the restaurant changes its dish, as <<tab1101>> shows.
de_de: Stell dir vor, das Restaurant ändert seine Karte so wie in <<tab1101>> illustriert.

source: The restaurant can make a hard fork by adding meat to its dish or a soft fork by restricting the food to vegan.
de_de: Das Restaurant kann eine Hard Fork erzeugen, indem es Fleisch auf die Speisekarte schreibt, oder eine Soft Fork, indem es seine Speisen auf den veganen Bereich einschränkt.

source: | Vegetarian restaurant serves … | Will guests accept it? | Fork type | Why | Vegetarian food | Yes | None | Vegetarians eat vegetarian food. | Nonvegetarian food | no | Hard fork | The rules are _relaxed_. Vegetarians can’t eat here any more. | Vegan food | Yes | Soft fork | The rules are _tightened_. Vegetarian rules still apply.
de_de: | Vegetarisches Restaurant serviert … | Akzeptieren die Gäste das? | Fork Typ | Weshalb | Vegetarisches Essen | Ja | Keiner | Vegetarier essen vegetarisches Essen. | Nichtvegetarisches Essen | Nein | Hard Fork | Die Regeln wurden _gelockert_. Vegetarier können hier nicht mehr essen. | Veganes Essen | Ja | Soft Fork | Die Regeln wurden _gestrafft_. Vegetarierregeln gelten weiter.

source: If you create a fork, soft or hard, you risk having a chain split if anyone runs your forked computer program. Some nodes will follow the strongest chain that’s valid according to the old rules, and some nodes—those running your software—will follow the strongest chain that’s valid according to your new rules. The result might be a split in the blockchain.
de_de: Wenn du eine Fork erzeugst, egal ob Soft oder Hard, riskierst du einen Chain Split, wenn irgendwer dein geforktes Programm betreibt. Einige Nodes werden der stärksten Chain folgen, die gemäss der alten Regeln gültig ist, und einige Nodes–die mit deiner Software–folgen der stärksten Chain, die gemäss der neuen Regeln gültig ist. Das Resultat kann ein Split in der Blockchain sein.

source: We’ll work through a few examples to illustrate what happens in different scenarios. We’ll start with the simplest case: a change that doesn’t affect the consensus rules. The name _Bitcoin Old_ will refer to the previous version of the program, and _Bitcoin New_ will refer to the changed version of the program. A node running Bitcoin Old is called an _Old node_, and a _New node_ is a node running Bitcoin New. We’ll denote data—for example, a block—created by a New node as _a New block_. Similarly, a transaction created by an Old node will be denoted as an _Old transaction_.
de_de: Wir gehen ein paar Beispiele durch, um zu illustrieren, was in den verschiedenen Szenarien passiert. Wir fangen mit dem einfachsten Fall an: eine Änderung, die die Konsensregeln nicht betrifft. Der Name _Bitcoin ALT_ bezieht sich auf die bisherige Version des Programms und _Bitcoin NEU_ auf die geänderte Version des Programms. Ein Node mit Bitcoin ALT wird _ALT Node_ und ein Node mit Bitcoin NEU wird _NEU Node_ genannt. Wir bezeichnen Daten–zum Beispiel einen Block–, die von einem NEU Node erzeugt wurden, als _ein NEU Block_. Analog dazu heisst eine Transaktion, die von einem ALT Node erzeugt wurde, eine _ALT Transaktion_.

source: Nonconsensus rule changes
de_de: Nicht-Konsensregel Änderungen

source: Suppose you want to add a new “feature” to Bitcoin Core’s networking code. You want to add a new network message type called `kill` that one Bitcoin node can send to another Bitcoin node. This message’s recipient node will immediately shut itself down. Only New nodes will know how to deal with an incoming `kill` message. Old nodes will ignore the—for them—unknown message (<<fig1102>>).
de_de: Angenommen du willst ein neues “Feature” zu Bitcoin Cores Netzwerkcode hinzufügen. Du willst eine Netzwerkmessage einführen namens `kill`, die ein Bitcoin Node einem anderen Bitcoin Node schicken kann. Der Empfängernode dieser Nachricht wird sich augenblicklich selbst herunterfahren. Nur NEU Nodes werden wissen, wie man mit einer einkommenden `kill` Message umgeht. ALT Nodes werden die–für sie–unbekannte Message ignorieren (<<fig1102>>).

source: Your new message will be accepted by New nodes and ignored by Old nodes.
de_de: Deine neue Message wird von NEU Nodes akzeptiert und von ALT Nodes ignoriert.

source: Most people consider your change a huge security risk. They don’t want their nodes shut down by a random stranger on the internet. You’ll have a hard time convincing them to use Bitcoin New. You can’t force this software on anyone; people will have to actively want it and install it for Bitcoin New to get network-wide adoption.
de_de: Die meisten Leute betrachten deine Änderung als riesiges Sicherheitsrisiko. Sie wollen nicht, dass sich ihr Node wegen irgendeinem unbekannten Fremden im Internet abschaltet. Du wirst es schwer haben Leute zu überzeugen, Bitcoin NEU zu benutzen. Du kannst niemanden zwingen; die Leute müssen es aktiv wollen und installieren, damit Bitcoin NEU netzwerkweit angenommen wird.

source: Stupid changes like the `kill` message won’t make it in the world of open source.
de_de: Dumme Änderungen wie die `kill` Nachricht schaffen es nicht in der Welt von Open Source.

source: Making something useful instead
de_de: Mach stattdessen etwas Nützliches

source: This was implemented in Bitcoin Core in 2016 and greatly improved the block-propagation time in the Bitcoin network. BIP152, “Compact Block Relay,” describes this in detail. I describe only a simplified version here.
de_de: Dies wurde 2016 in Bitcoin Core implementiert und verbesserte die Blockpropagationszeit im Bitcoin Netzwerk erheblich. BIP152, “Compact Block Relay,” beschreibt es im Detail. Ich beschreibe hier nur eine vereinfachte Version.

source: Suppose you invent something useful instead: _compact blocks_. Compact blocks let a peer send a block to another peer, but without sending the full block. Instead, this technique uses the fact that the recipient node has already received most of the transactions in the block. Remember that a transaction first travels the network during transaction propagation, then travels the network again during block propagation once the transaction is confirmed.
de_de: Angenommen, du willst stattdessen etwas Nützliches machen: kompakte Blocks oder _Compact Blocks_. Compact Blocks lassen einen Peer einen Block zu einem anderen Peer schicken, aber ohne den vollen Block zu schicken. Stattdessen baut diese Technik auf der Tatsache auf, dass der Empfängernode die meisten der Transaktionen im Block bereits empfangen hat. Vergiss nicht, dass eine Transaktion zuerst während der Transaktionspropagation das Netzwerk durchwandert und dann nochmal während der Blockpropagation, nachdem die Transaktion bestätigt worden ist.

source: When Rashid sends a block to Qi (<<fig1103>>), wouldn’t it be great if the block didn’t have to contain the transactions Qi already has? Bandwidth requirements would drop dramatically.
de_de: Wenn Rashid einen Block an Qi schickt (<<fig1103>>), wäre es da nicht toll, wenn der Block nicht die Transaktionen enthalten müsste, die Qi bereits hat? Der Bandbreitenverbrauch würde dramatisch sinken.

source: Qi gets a transaction twice: first during transaction propagation, and then during block propagation.
de_de: Qi bekommt eine Transaktion zweimal: zuerst während der Transaktionspropagation und dann während der Blockpropagation.

source: Rashid can instead send just the block header and a list of txids (<<fig1104>>). Qi can then reconstruct the block from the transactions she already has in memory and the message from Rashid. In case Qi doesn’t have one of the transactions, she’ll request them from Rashid.
de_de: Rashid kann stattdessen nur den Block Header und eine Liste von txids schicken (<<fig1104>>). Qi kann dann den Block anhand der Transaktionen, die sie bereits im Speicher hat, und der Message von Rashid, rekonstruieren. Falls Qi eine der Transaktionen nicht hat, kann sie sie von Rashid anfordern.

source: Compact blocks in action. Rashid sends just the necessary data to Qi.
de_de: Compact Blocks in Aktion. Rashid schickt nur die nötigsten Daten an Qi.

source: The protocol starts with Rashid sending Qi a `cmpctblock` message. Qi will use this message to re-create the block using the transactions she already has in memory. If she succeeds, she’s done and can start verifying the block. If she’s missing some transactions, she’ll request them from Rashid using a `getblocktxn` message containing a list of those transactions’ indexes. Rashid will then reply with a `blocktxn` message containing the missing transactions.
de_de: Das Protokoll beginnt damit, dass Rashid an Qi eine `cmpctblock` Nachricht schickt. Qi benutzt diese Nachricht, um den Block mittels der Transaktionen, die sie schon im Speicher hat, zu rekonstruieren. Ist sie erfolgreich, so ist sie fertig und kann damit beginnen, den Block zu verifizieren. Wenn ihr Transaktionen fehlen, so wird sie diese von Rashid mit einer `getblocktxn` Message anfordern, die eine Liste von Indizes dieser Transaktionen enthält. Rashid wird dann mit einer `blocktxn` Message antworten, die die fehlenden Transaktionen enthält.

source: Note that this is a simplified version of how it actually works. The main differences are as follows:
de_de: Beachte, dass dies eine vereinfachte Version davon ist, wie es tatsächlich funktioniert. Die Hauptunterschiede sind folgende:

source: The `cmpctblock` message can also include some complete transactions—for example, the block’s coinbase transaction.
de_de: Die `cmpctblock` Message kann auch einige vollständige Transaktionen enthalten–zum Beispiel die Coinbase Transaktion des Blocks.

source: Compact blocks can work in two different modes:
de_de: Compact Blocks funktionieren in zwei verschiedenen Modi:

source: In high-bandwidth mode, `cmpctblock` messages are sent unsolicited instead of first using an `inv` or `headers`.
de_de: Im hochbandbreiten-Modus werden `cmpctblock` Nachrichten unaufgefordert gesendet, ohne zuerst eine `inv` oder `headers` Nachricht zu schicken.

source: In low-bandwidth mode, the `cmpctblock` is sent only on request after an `inv` or `headers` has been received.
de_de: Im niedrigbandbreiten-Modus wird die `cmpctblock` Message nur nach Bedarf geschickt, nachdem eine `inv` oder `headers` Nachricht empfangen wurde.

source: The list of txids sent in the `cmpctblock` messages aren’t full txids, but shortened versions to save data traffic. They’re still long enough to almost always uniquely identify the actual transactions used.
de_de: Die Liste von txids in den `cmpctblock` Messages sind keine volle txids, sondern abgekürzte Versionen, um Datenvolumen zu sparen. Sie sind immer noch lang genug, um fast immer eindeutig die eigentliche Transaktion zu identifizieren.

source: This is a really useful change that many people find valuable. You release your software, and people start using it. Not everybody has to upgrade to this version. If only one of your peers uses it, you’ll benefit by running it yourself because the bandwidth requirements between you and that one peer will decrease. As more and more nodes start adopting compact blocks, your total bandwidth requirement will drop even more.
de_de: Das ist eine wirklich nützliche Änderung, die viele Leute wertvoll finden. Du gibst deine Software frei und Leute fangen an, sie zu benutzen. Nicht jeder muss auf die neue Version upgraden. Wenn nur ein Peer sie benutzt, dann profitierst du davon, wenn du sie auch laufen lässt, weil die Bandbreitenanforderungen zwischen dir und dem Peer sich verringern. Während mehr und mehr Nodes anfangen, die Compact Blocks zu benutzen, sinkt deine gesamte Bandbreitenanforderung noch mehr.
