Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: bitcoin-qt is the program to run if you want a GUI for your node. This is mainly useful if you use the built-in wallet.
de_de: Das Programm bitcoin-qt benutzt man, wenn man ein GUI für den Node braucht. Das ist nützlich, wenn man das eingebaute Wallet benutzt.

source: bitcoin-tx is a small utility program to create and modify Bitcoin transactions.
de_de: Das Programm bitcoin-tx ist ein kleines Hilfsprogramm zum Erzeugen und Modifizieren von Bitcoin Transaktionen.

source: test_bitcoin lets you test run a test suite.
de_de: Und es gibt noch test_bitcoin, was eine Test-Suite für Bitcoin ist.

source: In this tutorial, you’ll run bitcoind, which stands for “Bitcoin daemon.” In UNIX systems such as Linux, the word _daemon_ is used for computer programs that run in the background.
de_de: In diesem Tutorial benutzen wir bitcoind, was für “Bitcoin daemon” steht. In UNIX Systemen wie Linux bezeichnet das Wort _daemon_ Computerprogramme, die im Hintergrund laufen.

source: Let’s start the Bitcoin Core daemon in the background and see what happens:
de_de: Starten wir den Bitcoin Core Daemon im Hintergrund und schauen, was passiert:

source: This starts your node. It will automatically begin connecting to peers and downloading the blockchain for you.
de_de: Das startet den Node. Er wird automatisch anfangen, sich mit Peers zu verbinden und die Blockchain für dich herunterzuladen.

source: This process will take time. Depending on your internet connection, processor, and disk, it can vary from several days down to a few hours.
de_de: Dieser Prozess braucht Zeit. In Abhängigkeit von deiner Internetverbindung, Prozessor und Massenspeicher kann es von mehreren Tagen bis hinab zu wenigen Stunden dauern.

source: You can use the bitcoin-cli program to query the running node about the download progress, as in the following:
de_de: Du kannst das bitcoin-cli Programm benutzen, um den laufenden Node bezüglich des Download Prozesses abzufragen, wie hier:

source: This command shows a lot of information about the blockchain. Note that blocks have been downloaded and verified up to height 207546. Bitcoin Core will download block headers prior to the full blocks to verify proof of work. This node has downloaded headers up to height 549398, which are all the headers there are at this time. Another interesting thing is the `initialblockdownload` field, which will remain `true` until the initial block download is finished.
de_de: Das Kommando zeigt eine Menge Information über die Blockchain an. Merke, dass die Blocks bis zu einer Blockhöhe von 207546 heruntergeladen und verifiziert worden sind. Bitcoin Core wird vor dem Laden der vollen Blocks immer erst die Block Header herunterladen, um den Proof of Work zu verifizieren. Dieser Node hat Header bis 549398 heruntergeladen, was alle derzeit verfügbaren Header sind. Eine weitere interessante Sache ist das `initialblockdownload` Feld, das bis zum Ende des Initial Block Download auf `true` bleibt.

source: Keep this daemon running. You’ll get back to it in appendix A, where I’ll give you a small tutorial on how to use bitcoin-cli to examine the blockchain and use your built-in wallet.
de_de: Lasse diesen Daemon weiterlaufen. Wir kommen in Anhang A darauf zurück, wo ich ein kleines Tutorial darüber gebe, wie man bitcoin-cli zum Untersuchen der Blockchain verwendet und wie man das eingebaute Wallet benutzt.

source: If you want to stop the node, issue the following command:
de_de: Wenn du den Node stoppen willst, setze folgendes Komando ab:

source: You can start the node again whenever you like, and the node will begin where it left off.
de_de: Du kannst den Node wieder starten, wann immer es dir beliebt, und der Node macht dort weiter, wo er vorher aufgehört hatte.

source: We’ve replaced the last central point of authority, the shared folder, with a peer-to-peer network. In a peer-to-peer network, the full nodes communicate directly with each other. Each node is connected to several (potentially hundreds of) other nodes. This makes it extremely hard to prevent blocks and transactions from propagating the network.
de_de: Wir haben den letzten zentralen Punkt der Autorität, den Shared Folder, durch ein Peer-to-Peer Netzwerk ersetzt. In einem Peer-to-Peer Netzwerk kommunizieren die Full Nodes direkt miteinander. Jeder Node ist mit mehreren (möglicherweise hunderten) anderen Nodes verbunden. Dies macht es extrem schwierig, Blocks und Transaktionen an der Verbreitung durch das Netzwerk zu hindern.

source: This chapter had two main parts:
de_de: Dieses Kapitel hatte zwei Hauptteile:

source: How transactions and blocks flow through the network
de_de: Wie Transaktionen und Blocks durch das Netzwerk fliessen

source: How new nodes join the network
de_de: Wie neue Nodes dem Netzwerk beitreten

source: Part 1—Following a transaction
de_de: Part 1–Verfolgen einer Transaktion

source: In the first part of the chapter, we followed a transaction through the system. It started with John buying a cookie. His transaction was propagated across the peer-to-peer network and to the cafe’s wallet.
de_de: Im ersten Teil des Kapitels sind wir einer Transaktion durch das System gefolgt. Es begann mit John, der einen Keks kaufen wollte. Seine Transaktion wurde über das Peer-to-Peer Netzwerk verbreitet und kam am Wallet des Cafés an.

source: The cafe will almost immediately see that a transaction is incoming, but it’s not yet confirmed. The next stage is to mine the block. Rashid is the lucky miner who finds the next block containing John’s transaction.
de_de: Das Café sieht zwar fast sofort, dass eine Transaktion auf dem Weg ist, aber diese ist noch nicht bestätigt. Die nächste Stufe ist, den Block zu minen. Rashid ist der glückliche Miner, der den nächsten Block findet, in dem Johns Transaktion enthalten ist.

source: Rashid sends out the block to his peers, who will relay it to their peers and so on until the block has reached the entire network. Part of this propagation includes sending the block to lightweight wallets. These lightweight wallets will request `merkleblock` messages from the full node so they don’t have to download the full block.
de_de: Rashid schickt den Block an seine Peers, die sie an deren Peers relayen und so weiter, bis der Block das gesamte Netzwerk erreicht hat. Teil dieser Verbreitung beinhaltet das Senden der Transaktion an Lightweight Wallets. Diese Lightweight Wallets fordern `merkleblock` Messages vom Full Node an, damit sie nicht den ganzen Block herunterladen müssen.

source: Part 2—Joining the network
de_de: Teil 2–Beitritt zum Netzwerk

source: Starting a new node involves fours steps:
de_de: Der Start eines Nodes involviert vier Schritte:

source: Download and verify, for example, the Bitcoin Core software. Then start it.
de_de: Laden und Verifizieren einer Full Node Software, zum Beispiel Bitcoin Core. Anschliessender Start dieser Software.

source: Connect to other nodes.
de_de: Verbindung zu anderen Nodes.

source: Download historic blocks.
de_de: Download historischer Blocks

source: Enter normal operation.
de_de: Übergang in den Regelbetrieb.

source: The table of concept mappings between the cookie token system and Bitcoin has become tiny (<<tab0802>>).
de_de: Die Tabelle der Konzept-Mappings zwischen dem Cookie Token System und Bitcoin ist winzig geworden (<<tab0802>>).

source: The shared folder has been ditched in favor of a peer-to-peer network.
de_de: Der Shared Folder ist zugunsten des Peer-to-Peer Netzwerks verworfen worden.

source: | Cookie tokens | Bitcoin | Covered in | 1 cookie token | 1 bitcoin | <<ch02>>
de_de: | Cookie Tokens | Bitcoin | Behandelt in | 1 Cookie Token | 1 bitcoin | <<ch02>>

source: Given that there are no longer any technical differences between the cookie token system and the Bitcoin system, we’ll drop the cookie tokens and work only with Bitcoin from now on.
de_de: Angesichts fehlender technischer Unterschiede zwischen dem Cookie Token System und dem Bitcoin System lassen wir das Cookie Token System jetzt fallen und arbeiten ab sofort nur noch mit Bitcoin.

source: This will be the final release of the cookie token system. Another, much more widely used system, Bitcoin, has taken the world by storm, and we’ve decided to ditch the cookie token project. Enjoy the last version (<<tab0803>>).
de_de: Dieses wird das Finale Release des Cookie Token Systems sein. Ein anderes, viel weiter verbreitetes System, nämlich Bitcoin, hat die Welt im Sturm erobert und wir haben uns entschieden, das Cookie Token Projekt einzustampfen. Viel Spass mit der letzten Version (<<tab0803>>).

source: 2+|image:{commonimagedir}/new.png[role="gbnew"]8.0
de_de: 2+|image:{commonimagedir}/new.svg[role="gbnew"]8.0

source: | Censorship-resistant; for real this time | Shared folder replaced by a peer-to-peer network | Transaction broadcasting | Transactions broadcast to miners and others using the peer-to-peer network
de_de: | Zensurresistent; diesmal wirklich | Shared Folder durch Peer-to-Peer Netzwerk ersetzt | Transaktions Broadcasting | Transaktionen werden an Miner und andere Netzwerkteilnehmer über das Peer-to-Peer Netzwerk versendet

source: Why is the shared folder a bad idea?
de_de: Warum ist der Shared Folder keine gute Idee?

source: What does it mean to relay a transaction or a block?
de_de: Was bedeutet es, einen Block zu relayen?

source: What are `inv` messages used for?
de_de: Wozu werden `inv` Messages verwendet?

source: How does the full node decide what transactions to send to lightweight wallets?
de_de: Wie entscheidet der Full Node, welche Transaktionen er an Lightweight Wallets schicken soll?

source: How does a node notify a lightweight wallet about an incoming pending transaction?
de_de: Wie benachrichtigt ein Node ein Lightweight Wallet über eine eingehende, noch offene Transaktion?

source: Blocks aren’t sent in full to lightweight wallets. What part of the block is always sent to the wallet?
de_de: Blocks werden nicht komplett an Lightweight Wallets geschickt. Welcher Teil des Blocks wird aber immer an das Wallet geschickt?

source: Why does the cafe send a very big bloom filter to its trusted node?
de_de: Warum schickt das Café einen sehr grossen Bloom Filter an seinen Trusted Node?

source: What would a security-conscious person do after downloading Bitcoin Core but before starting the software?
de_de: Was würde eine sicherheitsbewusste Person nach dem Herunterladen und vor dem Starten von Bitcoin Core tun?

source: What types of sources for peer addresses are available to a newly started node?
de_de: Welche Arten von Quellen für Peer Adressen stehen einem frisch gestarteten Node zur Verfügung?

source: How would a full node know if any newly created blocks are available for download when it’s finished syncing?
de_de: Woher weiss ein Full Node, ob neu erzeugte Blocks zum Download bereitstehen, wenn er mit der Synchronisation fertig ist?

source: The Bitcoin peer-to-peer network consists of the following nodes:
de_de: Das Bitcoin Peer-to-Peer Netzwerk besteht aus den folgenden Nodes:

source: Which node owners do you need to threaten to prevent Lisa from getting any blocks but those she creates herself?
de_de: Welche Node Besitzer musst du bedrohen, um Lisa daran zu hindern, irgendwelche Blocks zu bekommen, ausser denjenigen, die sie selbst erzeugt hat?

source: Suppose Qi just received two transactions with transaction IDs TXID~1~ and TXID~2~. She now wants to inform Rashid about these new transactions. She doesn’t know if Rashid already knows about them. What does she do?
de_de: Angenommen, Qi hat gerade zwei Transaktionen mit den Transaktions IDs TXID~1~ und TXID~2~ erhalten. Sie möchte jetzt Rashid über diese neuen Transaktionen informieren. Sie weiss nicht, on Rashid bereits von den Transaktionen weiss. Was tut sie?

source: Suppose you’re running a full node and experience a power outage for 18 minutes. When power comes back, you start your node again. During those 18 minutes, two blocks, B~1~ and B~2~, have been created. Your latest block is B~0~. What will your node do after reconnecting to the network? For simplicity, assume that no new blocks are found during synchronization, and that you have only one peer. Use this table of message types to fill out the following template:
de_de: Angenommen, du betreibst einen Full Node, und für 18 Minuten fällt der Strom aus. Wenn der Stromausfall vorbei ist, startest du deinen Node wieder. Während dieser 18 Minuten sind zwei Blocks, B~1~ und B~2~, erzeugt worden. Dein letzter Block ist B~0~. Was tut dein Node nach erneuter Verbindung zum Netzwerk? Der Einfachheit halber nehmen wir an, dass keine neuen Blocks während der Synchronisation gefunden werden, und dass du nur einen Peer hast. Benutze diese Tabelle der Message Typen, um das folgende Formular auszufüllen:

source: | Type | Data | Purpose | `block` | Full block | Sends a block to a peer | `getheaders` | Block ID | Asks a peer for subsequent block headers after the given block ID | `getdata` | txids or block IDs | Requests data from a peer | `headers` | List of headers | Sends a list of headers to a peer
de_de: | Typ | Daten | Zweck | `block` | Voller Block | Schickt einen Block an einen Peer | `getheaders` | Block ID | Fordert darauffolgende Block Header nach der gegebenen Block ID von einem Peer an | `getdata` | txids oder Block IDs | Fordert Daten von einem Peer an | `headers` | Liste von Headern | Schickt eine Liste von Headern an einen Peer

source: The peer-to-peer network makes blocks censorship-resistant.
de_de: Das Peer-to-Peer Netzwerk macht Blocks zensurresistent.

source: A node connects to multiple peers to reduce their vulnerability for information hiding.
de_de: Ein Node verbindet sich mit mehreren Peers, um deren Anfälligkeit für das Verbergen von Information zu verringern.

source: The Bitcoin network protocol is the “language” nodes speak to communicate.
de_de: Das Bitcoin Netzwerkprotokoll ist die “Sprache”, in der sich Nodes miteinander unterhalten.

source: Transactions are broadcast on the Bitcoin peer-to-peer network to reach both miners and the recipient of the money early.
de_de: Transaktionen werden auf dem Bitcoin Peer-to-Peer Netzwerk per Broadcast verbreitet, um sowohl Miner als auch die Empfänger von Zahlungen schnell zu erreichen.

source: New nodes synchronize with the Bitcoin network to get up to date with the other nodes. This takes hours or days.
de_de: Neue Nodes synchronisieren sich mit dem Bitcoin Netzwerk, um mit den anderen Nodes auf die gleiche Ebene zu kommen. Dies dauert Stunden bis Tage.

source: Nodes don’t need to stay online 24/7. They can drop out and come back and sync up the latest stuff.
de_de: Nodes brauchen nicht 24/7 online zu bleiben. Sie können ausfallen und wieder hochkommen und sich wieder auf den neuesten Stand synchronisieren.

source: Signature verification can be skipped for older blocks to speed up initial synchronization. This is useful if you know a specific block is valid.
de_de: Signaturverifikation kann für ältere Blocks zur Beschleunigung der initialen Synchronisation übersprungen werden. Das ist nützlich, wenn man definitiv weiss, dass ein bestimmter Block gültig ist.

source: Transactions revisited
de_de: Nochmal zurück zu Transaktionen

source: Time-locking bitcoins
de_de: Bitcoins mit Zeitschloss

source: Swapping coins between blockchains
de_de: Tauschgeschäfte zwischen Blockchains

source: Attaching arbitrary data to transactions
de_de: Anhängen beliebiger Daten an Transaktionen

source: Bumping the fee of a pending transaction
de_de: Erhöhen der Fee für eine ausstehende Transaktion

source: We’re now past the core chapters of the book, in which you learned the Bitcoin basics. In this chapter, we’ll dig deeper into the functionality transactions can offer.
de_de: Wir haben jetzt die Kernkapitel des Buches hinter uns, in denen du die Grundlagen von Bitcoin gelernt hast. In diesem Kapitel scheuen wir tiefer in die Funktionalitäten hinein, die Transaktionen anbieten können.

source: We’ll start by exploring time locks. A _time lock_ is a way to make a transaction invalid until some point in time. This means the transaction can’t be confirmed before that time constraint is met. Also, an output of a transaction can be programmed to prevent it from being spent until a time constraint is fulfilled. This is useful for digital contracts, such as atomic swaps, covered later in this chapter.
de_de: Wir beginnen mit der Betrachtung von Zeitschlössern, oder _Time Locks_. Ein Time Lock ist eine Methode, eine Transaktion bis zu einem bestimmten Zeitpunkt ungültig zu machen. Das bedeutet, die Transaktion kann nicht bestätigt werden, bevor die zeitliche Bedingung erfüllt ist. Ausserdem kann ein Output einer Transaktion so programmiert werden, dass er nicht ausgegeben werden kann, bevor eine zeitliche Bedingung erfüllt ist. Das ist für digitale Verträge nützlich, wie atomare Tauschgeschäfte, die später im Kapitel behandelt werden.

source: It’s sometimes useful to store a small amount of data in a transaction in the blockchain. For example, a car manufacturer might want to track ownership of a car by putting its chassis number into a Bitcoin transaction, effectively creating a token on the Bitcoin blockchain. The current owner can then transfer ownership of the car by sending that token to the new owner.
de_de: Manchmal ist es nützlich, eine paar Daten in der Blockchain zu speichern. Zum Beispiel könnte ein Automobilhersteller die Besitzverhältnisse eines Autos dadurch verfolgen, dass er die Fahrgestellnummer in eine Bitcoin Transaktion packt und damit effektiv ein Token auf der Bitcoin Blockchain erzeugt. Der aktuelle Besitzer kann dann das Eigentum am Auto übertragen, indem er das Token an den neuen Besitzer sendet.

source: As mentioned in <<altcoins>>, several alternative cryptocurrencies are available. Sometimes, you might want to trade, for example, namecoins for bitcoins. The most obvious way to do this is to use an exchange to sell bitcoins and buy namecoins. But there are other, more decentralized ways to do it. _Atomic swaps_ let you swap bitcoins directly with someone holding namecoins without a trusted third party, like an exchange.
de_de: Wie in <<altcoins>> erwähnt, gibt es mehrere alternative Kryptowährungen. Manchmal möchte man, zum Beispiel, namecoins gegen bitcoins tauschen. Das Naheliegende wäre, auf einer Exchange bitcoins zu verkaufen und namecoins zu kaufen. Aber es gibt andere, dezentralisiertere Methoden, das zu tun. Atomare Tauschgeschäfte, oder _Atomic Swaps_ lassen dich bitcoins direkt mit jemandem tauschen, der namecoins hat, ohne dass eine vertrauenswürdige Drittpartei wie eine Exchange benötigt wird.

source: If you pay a too-small transaction fee, miners might refuse to confirm the transaction within a reasonable time. In this situation, it can be helpful to replace the transaction with another one that pays a little more in fees. This is known as _fee-bumping_.
de_de: Wenn du eine zu geringe Transaction Fee bezahlst, könnten die Miner sich weigern, die Transaktion innerhalb einer akzeptablen Zeit zu bestätigen. In dieser Situation kann es hilfreich sein, die Transaktion durch eine eine andere zu ersetzen, die eine etwas höhere Gebühr zahlt. Dies wird als Gebührenerhöhung oder _Fee-Bumping_ bezeichnet.

source: Finally, we’ll explore some intricate details of signatures. You can create signatures in different ways depending on your use case. You can tune what the signature should commit to: in other words, change how the signing algorithm hashes the transaction.
de_de: Schliesslich untersuchen wir einige komplizierte Details von Signaturen. Man kann Signaturen je nach Anwendungsfall auf verschiedene Weisen erzeugen. Man kann justieren, woran sich die Signatur bindet: mit anderen Worten, wie der Signaturalgorithmus die Transaktion hasht.

source: Time-locked transactions
de_de: Time-Locked Transaktionen

source: When you create and sign a transaction, it’s valid and ready for inclusion in any future block. You can broadcast it immediately and have it mined. This is the normal case.
de_de: Wenn du eine Transaktion erzeugst und signierst, ist sie gültig und bereit für die Einbindung in einen künftigen Block. Du kannst sie sofort broadcasten und minen lassen. Dies ist der Normalfall.

source: But in some cases, you may want to sign a transaction with a guarantee that it won’t be mined until after at least, say, one year has passed.
de_de: Aber in manchen Fällen willst du vielleicht eine Transaktion signieren mit einer Garantie, dass sie frühestens nächstes Jahr oder, sagen wir, nach Ablauf eines Jahres, in einem Block landen kann.

source: Suppose you have 100 bitcoins, and you want your daughter to inherit the money to her address @~D~, but only after you die. You can create a transaction that’s time-locked (<<fig0901>>).
de_de: Angenommen du hast 100 bitcoins, und du willst, dass deine Tochter das Geld auf ihrer Adresse @~D~ erbt, aber erst nachdem du tot bist. Du kannst dafür eine Transaktion erzeugen, die ein Zeitschloss trägt. Man bezeichnet eine solche Transaktion als _zeitverriegelt_ oder _time-locked_ (<<fig0901>>).

source: No fee?
de_de: Keine Gebühr?

source: For the sake of simplicity, most examples in this chapter don’t pay any fees.
de_de: Der Einfachheit halber zahlen die meisten Beispiele in diesem Kapitel keine Gebühren.

source: A payment to your daughter that will become valid on 30 April 2019
de_de: Eine Zahlung an deine Tochter, die am 30. April 2019 gültig wird

source: Sequence numbers
de_de: Folgenummern

source: Sequence numbers are always included in inputs, but I haven’t shown them because they didn’t matter to the transactions used so far.
de_de: Folgenummern sind immer in Inputs enthalten, aber ich habe sie nicht gezeigt, weil sie für die bis jetzt behandelten Transaktionen keine Bedeutung hatten.

source: What makes this transaction special are the inputs’ sequence numbers and the transaction lock time. I briefly mentioned sequence numbers in <<ch05>>. They’re used to enable the lock time: if any input has a sequence number less than `ffffffff`—for example, `fffffffe`—the lock time set on the transaction will be effective. If all sequence numbers are `ffffffff`, the lock time won’t have any effect.
de_de: Was diese Transaktion besonders macht sind die Folgenummern, Sequenznummern oder _Sequence Numbers_, in den Inputs, und die Transaktions Lock Time. Ich hatte die Folgenummern bereits in <<ch05>> kurz erwähnt. Sie werden benutzt, um die Lock Time zu entsperren, sie zu enablen: besitzt irgendein Input eine Sequenznummer kleiner als `ffffffff`—zum Beispiel `fffffffe`–dann ist die auf der Transaktion gesetzte Lock Time wirksam. Wenn alle Sequenznummern `ffffffff` sind, besitzt die Lock Time keine Wirkung.
