Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: The general idea is that John must reveal the secret, S, to claim his coins. Fadime can then use S to claim her coins.
de_de: Die allgemeine Idee ist die, dass John das Geheimnis, S, preisgeben muss, um seine Coins zu bekommen. Fadime kann dann S benutzen, um den Anspruch auf ihre Coins geltend zu machen.

source: Arbitrary data can be stored in `OP_RETURN` outputs without placing a burden on nodes’ UTXO sets. You can use this to create tokens. For example, the ownership of a car can be tracked and verified on the Bitcoin blockchain.
de_de: In `OP_RETURN` Outputs können beliebige Daten gespeichert werden, ohne die UTXO Sets der Nodes zu belasten. Das kann zur Erzeugung von Tokens benutzt werden. Zum Beispiel könnten die Eigentumsrechte an einem Auto auf der Bitcoin Blockchain geführt und verifiziert werden.

source: A transaction can sometimes get stuck in a pending state because no miners want to include it in their blocks. This usually happens because you’ve paid a too-small fee. To prepare for this situation, you can mark the transaction as replaceable by setting the sequence number of at least one input to a value lower than `fffffffe`. If that transaction gets stuck, you can bump the the fee by broadcasting a replacement transaction that pays a higher fee.
de_de: Manchmal kann eine Transaktion im Zustand pending steckenbleiben, weil kein Miner sie in einen Block hineinnehmen will. Das geschieht üblicherweise, weil du eine zu geringe Gebühr zahlst. Um dieser Situation vorzubeugen, kannst du die Transaktion als ersetzbar markieren, indem du die Sequenznummer von mindestens einem Input auf einen Wert kleiner als `fffffffe` setzt. Wenn diese Transaktion steckenbleibt, kannst du die Gebühr nachträglich dadurch erhöhen, dass du eine Ersatztransaktion sendest, die eine höhere Gebühr bezahlt.

source: Inputs’ sequence numbers are used for various purposes. We’ve discussed many different uses for sequence numbers in this chapter, and it’s hard to keep track of them. <<tab0901>> summarizes the meaning of different sequence number values.
de_de: Die Sequenznummern von Inputs werden für verschiedene Zwecke verwendet. Wir haben viele verschiedene Verwendungen für Sequenznummern in diesem Kapitel kennengelernt und es ist schwer, den Überblick zu behalten. <<tab0901>> fasst die Bedeutung der Werte verschiedener Sequenznummern zusammen.

source: Sequence numbers are used to enable or disable various features. [.big]#✔#=enabled, [.big]#✘#=disabled. *Tx version 2 required.
de_de: Sequenznummern werden zum An- und Abschalten diverser Features benutzt. [.big]#✔#=angeschaltet, [.big]#✘#=abgeschaltet. *Tx Version 2 benötigt.

source: <| Sequence value <| Lock time, any input <| Replace-by-fee (BIP125), any input <| Relative lock time on input (BIP68)* | `00000000`-`7fffffff` | [.big]#✔# | [.big]#✔# | [.big]#✔# | `80000000`-`fffffffd` | [.big]#✔# | [.big]#✔# | [.big]#✘# | `fffffffe` | [.big]#✔# | [.big]#✘# | [.big]#✘# | `ffffffff` | [.big]#✘# | [.big]#✘# | [.big]#✘#
de_de: <| Sequenznummernwert <| Lock Time, jeder Input <| Replace-by-fee (BIP125), jeder Input <| Relative Lock Time auf Input (BIP68)* | `00000000`-`7fffffff` | [.big]#✔# | [.big]#✔# | [.big]#✔# | `80000000`-`fffffffd` | [.big]#✔# | [.big]#✔# | [.big]#✘# | `fffffffe` | [.big]#✔# | [.big]#✘# | [.big]#✘# | `ffffffff` | [.big]#✘# | [.big]#✘# | [.big]#✘#

source: What’s required from a transaction’s inputs to enable absolute lock time?
de_de: Was wird vom Input einer Transaktion verlangt, um absolute Lock Time anzuschalten?

source: Suppose a transaction is time-locked (absolute) to 25 December 2019 00:00:00. How does a miner check whether the transaction is OK to put in a block?
de_de: Angenommen, eine Transaktion ist absolut time-locked (absolute time lock) bis zum 25. Dezember 2019 00:00:00. Wie überprüft ein Miner, ob es OK ist, die Transaktion in einen Block einzubauen?

source: Where is the relative lock time of an input located?
de_de: Wo liegt die relative Lock Time in einem Input?

source: Suppose Adam and Eve want to swap coins with each other using an atomic swap. How many transactions would be created on each blockchain upon completion?
de_de: Angenommen, Adam und Eva wollen über einen Atomic Swap Coins miteinander austauschen. Wie viele Transaktionen würden bis zum Abschluss auf jeder Blockchain erzeugt?

source: Why is it bad for the UTXO set to store arbitrary data such as “HELLO WORLD” as fake PKHs in outputs as opposed to storing them in `OP_RETURN` outputs?
de_de: Warum ist es schlecht für das UTXO Set, willkürliche Daten wie “HELLO WORLD” als gefälschte PKHs in Outputs zu speichern anstatt in `OP_RETURN` Outputs?

source: Why would you want to replace a broadcast transaction that isn’t confirmed yet?
de_de: Warum würdest du eine gesendete Transaktion ersetzen wollen, die noch nicht bestätigt wurde?

source: Explain the differences between absolute lock time and relative lock time.
de_de: Erkläre die Unterschiede zwischen absolute Lock Time und relative Lock Time.

source: (This exercise is hard; feel free to skip it.) Suppose you want to bet 1 BTC that it’s going to snow in London on Christmas Eve, and Ruth bets 1 BTC that it’s not. You appoint a person, Beth, whom you both trust to solve any conflicts that might occur. You and Ruth collaborate to create and broadcast a transaction that spends 1 BTC each to an output of 2 BTC with the following redeem script. (The redeem script _can_ be made smaller, but to make it simpler to read, I used a slightly bigger version.) Explain how the redeem script works on a conceptual level.
de_de: (Diese Übung ist schwer. Du kannst sie gerne überspringen.) Nimm an, du willst 1 BTC darauf wetten, dass es in London am Weihnachtsabend schneit, und Ruth wettet 1 BTC, dass es das nicht tut. Ihr bestimmt eine Person, Beth, der ihr beide damit vertraut, einen eventuell auftretenden Konflikt zu lösen. Du und Ruth kollaborieren bei der Erzeugung und dem Senden einer Transaktion, die jeweils 1 BTC ausgibt und an einen Output von 2 BTC schickt, mit dem folgenden Redeem Script. (Das Redeem Script _kann_ kleiner gemacht werden, aber um es leichter lesbar zu machen, habe ich eine etwas grössere Version benutzt.) Erkläre auf konzeptioneller Ebene, wie das Redeem Script funktioniert.

source: If a p2sh output pays to the hash of a redeem script that consists solely of an `OP_RETURN` with 32 random bytes, would full nodes be able to know that the output is unspendable?
de_de: Wenn ein p2sh Output an den Hash eines Redeem Scripts zahlt, das ausschliesslich aus einem `OP_RETURN` mit 32 zufälligen Bytes besteht, könnten Full Nodes dann wissen, dass der Output unspendable, also unverwendbar ist?

source: Explain how the first-seen policy works. Also, are nodes obliged to follow the policy?
de_de: Erläutere, wie die first-seen Policy funktioniert. Und sind Nodes verpflichtet, der Policy zu folgen?

source: Opt-in RBF offers a method for transaction replacement. Is there any fundamental security difference between a transaction with opt-in RBF enabled and a transaction that doesn’t opt in? Explain your reasoning.
de_de: Opt-in RBF bietet eine Methode zum Ersetzen von Transaktionen. Gibt es irgendeinen fundamentalen Unterschied bezüglich der Sicherheit von Transaktionen, die opt-in RBF angeschaltet haben und solchen, die es abgeschaltet haben? Erläutere deine Argumentation.

source: Transactions can be locked with respect to time or block height depending on your application needs. The locks can be either absolute or relative.
de_de: Transaktionen können ja nach Bedarf der Anwendung in Bezug auf Zeit oder Block Height gesperrt werden. Die Sperren können entweder absolut oder relativ sein.

source: A transaction output can require the spending transaction to be time-locked. This is useful in many digital contracts.
de_de: Ein Transaktions Output kann verlangen, dass die sie ausgebende Transaktion eine Zeitsperre besitzt. Das ist in vielen digitalen Verträgen nützlich.

source: Atomic swaps are a useful way to exchange cryptocurrencies between two parties that don’t trust each other.
de_de: Atomic Swaps sind ein nützlicher Weg, Kryptowährungen zwischen zwei Parteien auszutauschen, die sich gegenseitig nicht trauen.

source: Arbitrary data—for example, a car ownership token—can be stored in `OP_RETURN` outputs without burdening the UTXO set.
de_de: Beliebige Daten–zum Beispiel das Eigentums-Token für ein Auto–können in `OP_RETURN` Outputs gespeichert werden, ohne das UTXO Set zu belasten.

source: A transaction can be marked replaceable. This lets you replace the transaction in case it doesn’t confirm within a reasonable time.
de_de: Eine Transaktion kann als ersetzbar markiert werden. Das lässt dich die Transaktion ersetzen, falls sie nicht innerhalb einer vernünftigen Zeitspanne bestätigt wird.

source: Signatures can commit to different parts of the transaction using six combinations of `SIGHASH` types. This can be handy in certain digital contracts.
de_de: Signaturen können sich mit sechs verschiedenen `SIGHASH` Typen an verschiedene Teile der Transaktion binden. Das kann in bestimmten digitalen Verträgen praktisch sein.

source: Understanding Bitcoin’s problems
de_de: Bitcoins Probleme begreifen

source: Moving signatures out of transactions
de_de: Entfernung von Signaturen aus Transaktionen

source: Bitcoin is far from perfect. It has several shortcomings that we should address. The first section of this chapter will explain some of these shortcomings. Among the most critical are _transaction malleability_ and inefficiencies in signature verification. We’ve already mentioned transaction malleability in <<time-locked-transactions>>—someone might change a transaction in subtle, but valid, ways while it’s being broadcast, which will cause its txid to change.
de_de: Bitcoin ist bei weitem nicht perfekt. Es hat einige Schwächen, die wir angehen sollten. Der erste Abschnitt dieses Kapitels wird einige dieser Defizite erklären. Unter den kritischsten sind Transaktions-Umformbarkeit oder _transaction malleability_ und Ineffizienzen in der Verifikation von Signaturen. Wir haben _transaction malleability_ bereits in <<time-locked-transactions>> erwähnt–jemand könnte eine Transaktion auf eine subtile, aber gültige, Weise verändern, während diese gesendet wird, was zu einer Änderung der txid führen würde.

source: A solution to these problems was presented at a 2015 conference on Bitcoin scaling. This solution is known as _segregated witness_ (segwit), which is a weird name for moving signature data out of transactions. I’ll describe this solution in detail: it includes changes in pretty much all parts of Bitcoin, including Bitcoin addresses, transaction format, block format, local storage, and network protocol.
de_de: Eine Lösung für dieses Problem wurde 2015 bei einer Konferenz über die Skalierung von Bitcoin präsentiert. Die Lösung wird _segregated witness_ (SegWit) genannt, was ein merkwürdiger Name dafür ist, dass man Signaturdaten aus den Transaktionen herausnimmt. Ich werde die Lösung im Detail beschreiben: es beinhaltet Änderungen in so ziemlich allen Teilen von Bitcoin, einschliesslich Bitcoin Adressen, Transaktionsformat, Blockformat, lokalem Speicher und Netzwerkprotokoll.

source: Because segwit was a pretty big change in Bitcoin, it wasn’t trivial to deploy without disrupting the network. It was carefully designed so old software would continue working and accepting segwit transactions and blocks, although without verifying certain parts of them.
de_de: Weil SegWit eine ziemlich grosse Änderung an Bitcoin war, war es nicht einfach auszurollen, ohne das Netzwerk zu erschüttern. Es wurde sorgfältig so gestaltet, dass alte Software weiterhin funktionieren und SegWit Transaktionen und Blocks akzeptieren würde, auch wenn sie einige Teile davon nicht verifizieren würde.

source: Problems solved by segwit
de_de: Durch SegWit gelöste Probleme

source: In this section, we’ll discuss the problems that segwit will solve.
de_de: In diesem Abschnitt besprechen wir die Probleme, die SegWit löst.

source: To explain transaction malleability, let’s go back to the example in <<ch09>> in which you gave a time-locked transaction to your daughter. When almost a year has passed since you created your time-locked transaction, you need to invalidate that transaction and create a new time-locked transaction, as <<fig1001>> shows.
de_de: Um Transaktions-Umformbarkeit zu erklären, gehen wir zurück zu dem Beispiel in <<ch09>>, in dem du deiner Tochter eine time-locked Transaktion gegeben hast. Wenn knapp ein Jahr vergangen ist, seitdem du deine time-locked Transaktion erzeugt hast, musst du die Transaktion ungültig machen und eine neue time-locked Transaktion generieren, wie in <<fig1001>> dargestellt.

source: You spend one of the outputs that the previous time-locked transaction spends and create a new time-locked transaction that you give to your daughter.
de_de: Du gibst einen der Outputs aus, den die vorige zeitgesperrte Transaktion ausgibt, und erzeugst eine neue zeitgesperrte Transaktion, die du deiner Tochter gibst.

source: It’s important to give the new time-locked transaction, Tx~3~, to your daughter before broadcasting Tx~2~, which invalidates the previous time-locked transaction, Tx~1~. Otherwise, if you do it the other way around and get hit by a bus between the two steps, your daughter won’t be able to claim the money.
de_de: Es ist wichtig, deiner Tochter die neue zeitgesperrte Transaktion Tx~3~ zu geben, bevor du Tx~2~ sendest, die die vorhergehende zeitgesperrte Transaktion Tx~1~ ungültig macht. Ansonsten kann deine Tochter, wenn du es andersherum machst und zwischen den beiden Schritten von einem Bus überfahren wirst, ihren Anspruch auf das Geld nicht anmelden.

source: Suppose you do this correctly and first give Tx~3~ to your daughter and then broadcast Tx~2~. Tx~3~ spends the output of Tx~2~, which means Tx~3~ contains the txid of Tx~2~ in one of its inputs. Let’s see what might happen when you broadcast Tx~2~ (<<fig1002>>).
de_de: Angenommen du machst das korrekt und gibst zunächst Tx~3~ deiner Tochter und sendest dann Tx~2~. Tx~3~ gibt den Output von Tx~2~ aus, was bedeutet, Tx~3~ enthält die txid von Tx~2~ in einer ihrer Inputs. Schauen wir mal, was passiert, wenn du Tx~2~ sendest (<<fig1002>>).

source: Your transaction is being modified by Qi on its way through the network.
de_de: Deine Transaktion wird auf ihrem Weg durch das Netzwerk von Qi abgeändert.

source: The word _malleate_ means to form—for example, metal with a hammer. This term is used in cryptography to mean changing a signature without making it invalid or changing an encrypted message without making it totally garbled.
de_de: Das Wort _malleate_ bedeutet umformen–zum Beispiel Metall mit einem Hammer. Dieser Term wird in der Kryptografie benutzt, wenn eine Signatur geändert wird, ohne ungültig zu werden, oder eine verschlüsselte Nachricht geändert wird, ohne völlig unleserlich zu werden.

source: Qi wants to mess things up. When she receives your transaction Tx~2~, she modifies it in a certain way into Tx~2M~, so Tx~2M~ is still valid and has the same effect as the original transaction, Tx~2~. (You’ll see shortly some different ways she can do this.) The result is that two different transactions now flow through the network that spend the same outputs and send the money to the same recipients with the same amounts—but they have _different txids_.
de_de: Qi will Ärger machen. Wenn sie deine Transaktion Tx~2~ bekommt, ändert sie sie auf eine bestimmte Weise zu Tx~2M~ ab, sodass Tx~2M~ zwar immer noch gültig ist und denselben Effekt hat wie die originale Transaktion Tx~2~. (Du siehst gleich ein paar verschiedene Wege, wie sie das erreichen kann.) Das Ergebnis ist, dass jetzt zwei verschiedene Transaktionen durch das Netzwerk laufen, die dieselben Outputs ausgeben und dasselbe Geld in derselben Höhe an die selben Empfänger schicken–aber sie haben _unterschiedliche txids_.

source: Because Tx~2~ and Tx~2M~ spend the same outputs, they’re in conflict with each other, and at most one of them will be confirmed. Suppose Tx~2M~ is the winner and gets mined in the next block. What happens to your daughter’s inheritance? See <<fig1003>>.
de_de: Weil Tx~2~ und Tx~2M~ dieselben Outputs ausgeben, stehen sie im Konflikt miteinander, und höchstens einer von beiden wird bestätigt. Nehmen wir an, Tx~2M~ gewinnt und findet Eingang in den nächsten Block. Was passiert mit der Erbschaft deiner Tochter? Siehe <<fig1003>>.

source: The inheritance fails because your daughter’s time-locked transaction is forever invalid due to transaction malleability.
de_de: Die Erbschaft schlägt fehl, weil die zeitgesperrte Transaktion deiner Tochter auf ewig ungültig ist, wegen der Transaktionsumformbarkeit.

source: The _malleated_ transaction, Tx~2M~, is stored in the blockchain. This makes Tx~2~ invalid because it spends the same output as Tx~2M~. The first input of the time-locked transaction, Tx~3~, references Tx~2~ using its txid, so when 30 April 2020 has passed, your daughter won’t be able to claim her inheritance: she’ll be trying to spend an output from an invalid transaction.
de_de: Die _umgeformte_ Transaktion, Tx~2M~, wird in der Blockchain gespeichert. Dadurch wird Tx~2~ ungültig, weil die denselben Output wie Tx~2M~ ausgibt. Der erste Input der zeitgesperrten Transaktion, Tx~3~, referenziert Tx~2~ mittels txid, wenn also der 30. April 2020 vorbei ist, wird deine Tochter nicht in der Lage sein, ihr Erbe anzutreten: Sie würde versuchen, einen Output einer ungültigen Transaktion auszugeben.

source: How can Qi change the txid?
de_de: Wie kann Qi die txid ädern?

source: Qi has several options for changing the transaction without invalidating it. They all involve changing the signature script in one way or another. <<fig1004>> shows three classes of transaction malleability.
de_de: Qi hat mehrere Möglichkeiten, die Transaktion zu ändern, ohne sie ungültig zu machen. Alle haben damit zu tun, dass auf die eine oder andere Art das Signatur Script verändert wird. <<fig1004>> zeigt drei Klassen von Transaktionsumformung.

source: Three classes of transaction malleability
de_de: Drei Klassen von Transaktions-Umformbarkeit

source: BIP66 fixes the first class of malleability issues.
de_de: BIP66 behebt die erste Klasse von Umformbarkeitsproblemen.

source: The first one modifies the signature container format, which changes how the signature is _encoded_ in the signature script. You can encode the signature in a few different ways that are all valid. This issue was fixed in a system upgrade by using BIP66, which requires all signatures to be encoded in a specific way. The fix was activated in block 363724.
de_de: Die erste modifiziert das Signatur Container Format, was verändert, wie die Signatur im Signatur Script _codiert_ wird. Man kann die Signatur auf ein paar verschiedene Weisen codieren, die alle gültig sind. Dieses Problem wurde bei einem Systemupgrade durch BIP66 behoben, was die Codierung von Signaturen in einer ganz bestimmten Art festschreibt. Der Fix wurde in Block 363724 aktiviert.

source: The second way to malleate a transaction is to use cryptographic tricks. I won’t go into details here, but the signature, regardless of the container format, can be modified in a few ways that don’t make it invalid. Only one such trick is known, but we can’t rule out that there are others.
de_de: Die zweite Art, eine Transaktion umzuformen, ist mittels kryptografischer Tricks. Ich gehe hier nicht in die Details, aber die Signatur kann unabhängig von ihrem Containerformat auf ein paar Weisen verändert werden, ohne dass sie ungültig wird. Nur ein solcher Trick ist bekannt, aber wir können nicht ausschliessen, dass es weitere gibt.

source: The last approach is about changing the script program itself. You can do this in several ways. The one in <<fig1004>> first duplicates (`OP_DUP`) the top item on the stack and then immediately removes (`OP_DROP`) the duplicate from the stack; effectively, this change does nothing, and the whole program will run just fine.
de_de: Beim letzten Ansatz geht es darum, das Script Programm selbst zu ändern. Das kann man auf verschiedenen Wegen erledigen. Der in Bild <<fig1004>> dargestellte dupliziert (`OP_DUP`) zunächst das oberste Element auf dem Stack und entfernt (`OP_DROP`) anschliessend das duplizierte Element sofort wieder. Im Ergebnis ändert das nichts, und das ganze Programm läuft einwandfrei ab.

source: The second and third forms of transaction malleability are somewhat limited by _relay policies_. This means nodes will require that the signatures conform to specific rules and that no script operators except data pushes be present in the signature script. Otherwise, the node won’t relay the transaction. But nothing is stopping a miner from mining malleated transactions. Relay policies are implemented to make transaction malleability harder, but they can’t prevent it.
de_de: Die zweite und dritte Form von Transaktionsumformung werden durch die _relay Policies_ ein wenig eingeschränkt. Das bedeutet, Nodes werden verlangen, dass Signaturen bestimmten Regeln unterliegen und dass sich keine Script Operatoren ausser dem Ablegen von Daten im Signatur Script befinden. Andernfalls würde der Node die Transaktion nicht relayen. Aber nichts hält einen Miner davon ab, umgeformte Transaktionen zu minen. Relay Policies wurden implementiert, um Transaktionsumformung zu erschweren, aber sie können sie nicht verhindern.

source: Inefficient signature verification
de_de: Unzureichende Signatur Verifikation

source: When a transaction is signed, the signature algorithm hashes the transaction in a certain way.
de_de: Wenn ein Transaktions Script signiert wird, hasht der Signatur Algorithmus die Transaktion auf eine bestimmte Weise.

source: Remember from <<sign-transaction>> that you clean all signature scripts before signing. But if you did _just_ that, all the transaction’s signatures would use the exact same hash. If the transaction spent two different outputs that pay to the same address, the signature in one of the inputs could be reused in the other input. That property could be exploited by bad actors.
de_de: Erinnere dich an <<sign-transaction>> und wie du alle Signatur Scripts vor dem Signieren bereinigt hast. Wenn du aber nur das tätest, dann würden alle Signaturen genau denselben Hash benutzen. Wenn die Transaktion zwei verschiedene Outputs ausgibt, die an dieselbe Adresse zahlen, könnte die Signatur von einem der Inputs in dem anderen Input wiederverwendet werden. Diese Eigenschaft könnte von einem Bösewicht ausgenutzt werden.

source: Why not use a dummy byte?
de_de: Warum benutzt man kein Dummy Byte?

source: Inserting the pubkey script into the signature script seems unnecessary. It’d be simpler to add a single dummy byte in the signature script to avoid signature reuse. No one really knows why the pubkey script is used for this.
de_de: Das Pubkey Script in das Signatur Script einzufügen scheint überflüssig. Es wäre einfacher, ein einzelnes Dummy Byte in das Signatur Script zu legen, um eine Wiederverwendung der Signatur auszuschliessen. Niemand weiss so richtig, weshalb das Pubkey Script dafür benutzt wird.

source: To avoid this problem, Bitcoin makes each signature commit to a slightly different version of the transaction by copying the spent pubkey script into the signature script of the input that’s currently being signed.
de_de: Um dieses Problem zu vermeiden, lässt Bitcoin jede Signatur sich an eine leicht veränderte Version der Transaktion binden, indem es das ausgegebene Pubkey Script in das Signatur Script des Inputs kopiert, der gerade signiert wird.
