Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: The result is the same: miserable failure. The block ID was `005ce22db5aa…` this time, which is still bigger than the target.
de_de: Das Resultat ist dasselbe: ein jämmerlicher Fehlschlag. Die Block ID war diesmal `005ce22db5aa…`, was immer noch grösser ist als das Target.

source: She repeats this over and over. For example, <<fig0716>> shows her 227,299,125th try. It was close, but close doesn’t help. She has to keep trying (<<fig0717>>). And finally she gets the result shown in <<fig0718>>.
de_de: Sie wiederholt dies immer und immer wieder Zum Beispiel zeigt <<fig0716>> ihren 227.299.125ten Versuch.Es war knapp, aber knapp reicht nicht. Sie muss weiter probieren (<<fig0717>>). Und schliesslich erhält sie das in <<fig0718>> dargestellte Ergebnis.

source: Qi’s try with nonce 227,299,124. Close but no cigar!
de_de: Qis Versuch mit Nonce 227.299.124. Knapp daneben ist auch vorbei!

source: Qi keeps on working.
de_de: Qi arbeitet weiter.

source: The nonce 492781982 is a winner!
de_de: Die Nonce 492781982 ist der Gewinner!

source: The nonce 492781982 results in a block ID `000000003c77…`. She compares this to the target:
de_de: Die Nonce 492781982 resultiert in der Block ID `000000003c77…`. Sie vergleicht dies mit dem Target:

source: Wow—this block ID is less than the target! Qi has performed a great deal of work to find a nonce that results in a block ID less than the target. She’s created a block with a valid proof of work. Great, now she’ll publish the block to the shared folder.
de_de: Wow–diese Block ID ist kleiner als das Target! Qi hat einen Haufen Arbeit geleistet, um eine Nonce zu finden, die in einer Block ID kleiner als das Target resultiert. Sie hat einen Block mit einem gültigen Proof of Work erzeugt. Toll, jetzt wird sie ihren Block im Share veröffentlichen.

source: It’s important to realize that all miners build their own unique blocks. For example, Tom is working on his own block concurrently with Qi (and Lisa), but his set of transactions is different than Qi’s because his coinbase transaction pays the block reward to himself, whereas Qi’s coinbase transaction pays the block reward to Qi. This difference will cause the merkle roots in their respective block headers to differ. If Tom sets Qi’s winning nonce, 492781982, on his own block, he likely won’t meet the target. Other things that probably differ between their blocks could be the timestamp or the selected list of transactions.
de_de: Es ist wichtig, sich darüber klar zu sein, dass Miner ihre eigenen Blocks individuell zusammensetzen. Tom arbeitet zum Beispiel an seinem eigenen Block gleichzeitig mir Qi (und Lisa), aber seine Menge der Transaktionen ist anders als Qis, weil seine Coinbase Transaktion die Blockbelohnung an ihn zahlt, während Qis Coinbase Transaktion die Blockbelohnung Qi zukommen lässt. Dieser Unterschied sorgt dafür, dass der Merkle Root in ihren jeweiligen Block Headern sich unterscheidet. Wenn Tom Qis gewinnende Nonce, 492781982, in seinen eigenen Block einbaut, wird er das Target vermutlich nicht erreichen. Andere Dinge, die sich wahrscheinlich unterscheiden, sind der Zeitstempel und die Liste der ausgewählten Transaktionen.

source: Why is this good?
de_de: Warum ist das so gut?

source: Anyone can pick up the block from the shared folder and verify that the rule is met—the block ID is less than or equal to the agreed-on target. Block verification is now slightly different than before (<<fig0719>>).
de_de: Jeder kann einen Block aus dem Share nehmen und prüfen, dass die Regeln eingehalten wurden–die Block ID ist kleiner oder gleich dem vereinbarten Target. Block Verifizierung ist jetzt ein wenig anders als vorher (<<fig0719>>).

source: Block verification has changed. The verifier no longer needs anything from outside the block.
de_de: Die Blockverifikation hat sich geändert. Der Prüfer braucht nichts mehr ausser dem Block.

source: Blocks are self-contained
de_de: Blocks sind in sich abgeschlossen

source: You don’t need anything from outside the blockchain to verify the block.
de_de: Man braucht nichts von ausserhalb der Blockchain, um den Block zu prüfen.

source: The difference from verifying a digitally signed block is that the full node verifies the block producer has provided a valid proof of work instead of a valid digital signature.
de_de: Der Unterschied zum Verifizieren eines digital signierten Blocks ist, dass der Full Node prüft, ob der Blockproduzent einen gültigen Proof of Work geliefert hat, anstatt einer digitalen Signatur.

source: With proof of work, you don’t need anything other than the block itself to determine if the block is valid. You used to need stuff from outside the blockchain—the miner’s public key from the bulletin board. This is a major leap forward toward decentralization. No central sources for public keys are left that can be manipulated.
de_de: Mit Proof of Work braucht man nichts anderes als den Block selbst, um die Frage seiner Gültigkeit zu klären. Vorher hatte man Zeug von ausserhalb der Blockchain benötigt–den public Key des Miners vom schwarzen Brett. Das ist ein grosser Sprung Richtung Dezentralisierung. Keine zentralen Quellen für public Keys verbleiben, die manipuliert werden können.

source: Comparing with lucky numbers
de_de: Vergleich mit Glückszahlen

source: The blockchain will grow the same way as before, but the drawing of lucky numbers is replaced by hashing the block header (<<fig0720>>). <<tab0701>> compares the two systems.
de_de: Die Blockchain wird weiter so wachsen wie bisher, aber das Ziehen der Gewinnzahlen wird ersetzt durch das Hashen der Block Header (<<fig0720>>). <<tab0701>> vergleicht die beiden Systeme.

source: The blockchain works the same as when lucky numbers were used.
de_de: Die Blockchain arbeitet genauso wie mit den Glückszahlen.

source: 0.02 microseconds is just an example of how long a “try” can take. It varies from miner to miner.
de_de: 0,02 Mikrosekunden sind nur ein Beispiel dafür, wie lange ein “Versuch” dauern kann. Das variiert von Miner zu Miner.

source: Instead of drawing a random number each second, the miners draw a number about every 0.02 microseconds through cryptographic hashing. At the same time, the lucky number limit, or target, is set to the 256-bit number 00000000926e…=926eb9*2^200^ instead of just 555.
de_de: Anstatt jede Sekunde eine Zufallszahl zu ziehen, ziehen die Miner etwa alle 0,02 Mikrosekunden eine Zahl durch einen kryptografischen Hash. Gleichzeitig wird die Grenze für die Glückszahl von 555 auf die 256 Bit Zahl 00000000926e…=926eb9*2^200^ angehoben.

source: Comparing the lucky number system with the proof-of-work system
de_de: Vergleich des Glückszahlensystems mit dem Proof of Work System

source: | Idea | Target | Possible values | Draw every | Average block time | Best chain in a split | Lucky numbers | `555` | 1,000,000 | Second | 10 minutes | Longest chain | Proof of work | 926eb9*2^200^ | `2^256^` | 0.02 microseconds | 10 minutes | Most work chain
de_de: | Verfahren | Target | Mögliche Werte | Ziehe alle | Blockintervall | Beste Chain bei Split | Glückszahlen | `555` | 1,000,000 | Sekunde | 10 Minuten | Grösste Länge | Proof of Work | 926eb9*2^200^ | `2^256^` | 0.02 Mikrosekunden | 10 Minuten | Meiste Arbeit

source: subtle but important difference is that with proof of work, it’s the chain with the _most accumulated proof of work_ that’s considered the best branch to follow. In the lucky numbers case, nodes followed the longest chain. The accumulated proof of work for a blockchain is the sum of the difficulty of each individual block in the chain.
de_de: Subtiler aber wichtiger Unterschied ist, dass bei Proof of Work die Chain mit dem _grössten gesammelten Proof of Work_ als die beste Chain gilt, der man folgen soll. Im Fall der Glückszahlen folgen Nodes der längsten Chain. Der gesammelte Proof of Work für eine Blockchain ist die Summe der Schwierigkeit aller Einzelblocks der Chain.

source: The _difficulty_ of a block is a measurement of how many times harder it is to find a valid proof of work for that block compared to finding it for the genesis block.
de_de: Die Schwierigkeit oder _Difficulty_ eines Blocks wird darin gemessen, wie viel schwieriger es ist, einen gültigen Proof of Work für diesen Block zu finden im Vergleich damit, einen für den Genesis Block zu finden.

source: More exactly, the _difficulty of block B_ is calculated like this:
de_de: Genauer gesagt wird die _Difficulty von Block B_ wie folgt berechnet:

source: \frac{\mathrm{target\ of\ the\ genesis\ block}}{\mathrm{target\ of\ }B}=\frac{(2^{16}-1)*256^{26}}{\mathrm{target\ of\ }B}
de_de: \frac{\mathrm{Target\ des\ Genesis\ Blocks}}{\mathrm{Target\ von\ }B}=\frac{(2^{16}-1)*256^{26}}{\mathrm{Target\ von\ }B}

source: The target of the genesis block is divided by the target of _B_, which makes the difficulty of the genesis block exactly 1.
de_de: Das Target des Genesis Blocks wird durch das Target von _B_ geteilt, was die Difficulty des Genesis Blocks zu genau 1 macht.

source: The gist of this is that the higher the target of a block, the lower the difficulty of that block, and the lower the target, the higher the difficulty. So, we sum all blocks’ difficulties in the blockchain to get the chain’s accumulated proof of work.
de_de: Das Wesentliche daran ist, dass je höher das Target eines Blocks ist, desto niedriger seine Difficulty ist, und je niedriger das Target, desto höher die Difficulty. Also summieren wir die Difficulties aller Blocks auf, und erhalten den gesammelten Proof of Work.

source: Strongest chain
de_de: Stärkste Chain

source: The strongest chain is the chain with the most accumulated proof of work.
de_de: Die stärkste Chain ist diejenige mit dem grössten gesammelten Proof of Work.

source: From now on, I’ll refer to the branch with the most accumulated work as the _strongest branch_ or _strongest chain_. Another commonly used term is _best chain_. The distinction between the longest and the strongest chain will become important in <<strength-length>> when I’ve introduced _difficulty adjustments_.
de_de: Von nun an werde ich den Zweig mit dem grössten gesammelten Proof of Work als den _stärksten Zweig_ oder die _stärkste Chain_ bezeichnen. Ein anderer gebräuchlicher Begriff ist _beste Chain_. Die Unterscheidung zwischen längster und stärkster Chain wird in <<strength-length>> wichtig, wenn ich Anpassungen der Schwierigkeit, oder _Difficulty Adjustments_, vorgestellt haben werde.

source: What if you run out of nonces?
de_de: Was ist, wenn die Nonce nicht reicht?

source: The nonce is a 32-bit number. This is pretty small. If a miner has tried all 4,294,967,296 possible numbers without success, they must do something else to change the block header. Otherwise, they’ll redo the exact same tries they’ve already made. Several options exist for making a change (<<fig0721>>):
de_de: Die Nonce ist eine 32 Bit Zahl. Das ist ziemlich klein. Wenn ein Miner alle 4.294.967.296 möglichen Zahlen erfolglos durchprobiert hat, muss er etwas anderes tun, um den Block Header zu ändern. Ansonsten würde er genau dieselben Versuche nochmal machen, die er schon probiert hat. Es gibt verschiedene Optionen für solche Änderungen (<<fig0721>>):

source: Change the timestamp slightly.
de_de: Kleine Änderung am Zeitstempel.

source: Add, remove, or rearrange transactions.
de_de: Hinzufügen, Löschen, oder Rearrangieren von Transaktionen.

source: Modify the coinbase transaction.
de_de: Ändern der Coinbase Transaktion.

source: The block header can be changed in different ways.
de_de: Der Block Header kann auf verschiedene Arten verändert werden.

source: Changing the timestamp is straightforward—just add a second to the timestamp, and the header will be different. If you use one of the other two options, you’ll have to recalculate the merkle root because the transaction data has changed. When the merkle root is updated, the header changes.
de_de: Den Zeitstempel zu ändern ist recht geradlinig–addiere einfach eine Sekunde auf den Zeitstempel und der Header sieht anders aus. Wenn man eine der anderen Optionen benutzt, wird man den Merkle Root neu berechnen müssen, weil die Transaktionsdaten geändert wurden. Wenn der Merkle Root sich ändert, ändert sich auch der Header.

source: Once you make any of these changes to the block, the header will change so the nonce can be reset to `0`, and the miner can begin hashing again.
de_de: Führt man irgendeine dieser Änderungen am Block durch, so ändert sich der Header, sodass die Nonce wieder bei `0` anfangen und der Miner wieder mit dem Hashen beginnen kann.

source: Miners have to move out
de_de: Miner müssen ausziehen

source: The company thinks the proof-of-work system is nice and all, but it doesn’t want to pay for the electricity needed to perform all this work. Because computers run on electricity, the more calculations a computer makes, the more electricity it needs.
de_de: Die Firma findet das Proof of Work System schön und gut, will aber nicht den Strom bezahlen, der für all diese Arbeit benötigt wird. Weil Computer mit Strom laufen, braucht ein Computer mehr Strom, je mehr Berechnungen er durchführt.

source: The company decides that miners must run their mining software elsewhere, such as in their own homes. This is fair. After all, miners are rewarded with 50 CT for each block they find. The electricity cost for them to produce a block is less than 50 CT. The current market value of 50 CT is five cookies in the cafe, and each cookie token is currently traded at about 20 cents. Each block gives a miner about $10 worth of cookie tokens, which isn’t bad given that they each produce about 48 blocks per day.
de_de: Die Firma entscheidet, dass die Miner ihre Mining Software woanders laufen lassen sollen, zum Beispiel bei ihnen zu Hause. Das ist fair. Schliesslich bekommen die Miner 50 CT für jeden Block, den sie finden. Der Strom, den es sie kostet, einen Block zu produzieren, kostet weniger als das. Der aktuelle Marktpreis von 50 CT sind 5 Kekse im Café, und jedes Cookie Token wird derzeit zu 20 Cent gehandelt. Jeder Block gibt einem Miner etwa $10 an Cookie Tokens, was angesichts der Tatsache, dass sie etwa 48 Blocks pro Tag produzieren, nicht schlecht ist.

source: Let’s look quickly at the _hashrate_ of our three miners. The hashrate is a measurement of how many hashes (tries) they can perform per second:
de_de: Schauen wir uns kurz die _Hashrate_ unserer drei Miner an. Die Hashrate ist eine Masseinheit dafür, wie viele Hashes (Versuche) sie pro Sekunde schaffen:

source: | Miner | Hashrate (million hashes/s) | Expected blocks per day | Lisa | 100 | 48 | Tom | 100 | 48 | Qi | 100 | 48 s| Total s| 300 s| 144
de_de: | Miner | Hashrate (Millionen Hashes/s) | Erwartete Blocks/Tag | Lisa | 100 | 48 | Tom | 100 | 48 | Qi | 100 | 48 s| Summe s| 300 s| 144

source: This system will produce about 144 blocks per day, which is 1 block per 10 minutes on average.
de_de: Das System wird etwa 144 Blocks pro Tag produzieren, was im Durchschnitt etwa 1 Block alle 10 Minuten bedeutet.

source: Adding more hashrate
de_de: Mehr Hashrate kommt dazu

source: An interesting aspect of this system is that _anyone_ can become a miner without asking for permission. They can just set up a computer at home and start building blocks. Blocks are no longer tied to a person but to an amount of computing work:
de_de: Ein interessanter Aspekt dieses Systems ist, dass _jeder_ ein Miner werden kann, ohne um Erlaubnis zu fragen. Jeder kann einfach einen Computer daheim aufstellen und anfangen, Blocks zu bauen. Blocks sind nicht mehr an eine Person gebunden, sondern an eine Menge an Computerleistung:

source: Lisa adds to her hashrate
de_de: Lisa holt sich mehr Hashrate

source: Lisa finds this business of mining at home lucrative. She decides to add another similar computer at her house, which effectively doubles her hashrate.
de_de: Lisa findet das Geschäft, von zu Hause zu minen, lukrativ. Sie beschliesst, einen zweiten, ähnlichen Computer zuhause aufzustellen, was im Effekt ihre Hashrate verdoppelt.

source: Rashid becomes a miner
de_de: Rashid wird Miner

source: Rashid also wants to join the mining business. He sets up a computer at home that competes for new blocks. His computer is slightly faster than the competitors’, so he expects to produce more blocks per day than, for example, Qi.
de_de: Rashid möchte auch beim Minen mitmachen. Er stellt sich zuhause einen Computer auf, der im Wettbewerb um neue Blocks mitmacht. Sein Computer ist etwas schneller als die seiner Konkurrenten, daher erwartet er mehr Blocks pro Tag als, zum Beispiel, Qi.

source: After Lisa’s and Rashid’s added hashrate, the total hashrate in the cookie token system has increased significantly:
de_de: Nach Lisas und Rashids zusätzlichen Hashrate hat sich die gesamte Hashrate im Cookie Token System deutlich erhöht:

source: Total Bitcoin hashrate
de_de: Gesamte Bitcoin Hashrate

source: As of writing, Bitcoin’s total hashrate is about 50 exahash/s. That’s 50 × 10^18^ hash/s.
de_de: Zum Zeitpunkt des Schreibens ist die Hashrate von Bitcoin etwa 50 Exahashes/s. das sind 50 × 10^18^ Hashes/s.

source: | Miner | Hashrate (million hashes/s) | Expected blocks per day | Lisa | 200 | 96 | Tom | 100 | 48 | Qi | 100 | 48 | Rashid | 150 | 72 s| Total s| 550 s| 264
de_de: | Miner | Hashrate (Millionen Hashes/s) | Erwartete Blocks/Tag | Lisa | 200 | 96 | Tom | 100 | 48 | Qi | 100 | 48 | Rashid | 150 | 72 s| Summe s| 550 s| 264

source: Look: we’re producing more blocks per day than we designed for! The goal is 144 blocks per day, and 264 is significantly more than this. The _block rate_ is too high, almost double the desired rate.
de_de: Sieh mal: wir produzieren mehr Blocks pro Tag als geplant! Das Ziel ist 144 Blocks pro Tag, und 264 ist erheblich mehr als das. Die _Block Rate_ ist zu hoch, fast das Doppelte des gewünschten Wertes.

source: Problems with a high block rate
de_de: Probleme bei hoher Blockrate

source: A higher block rate might seem beneficial because the confirmation time of transactions will decrease, but it comes with some problems.
de_de: Eine höhere Blockrate mag vorteilhaft erscheinen, weil mit ihr die Bestätigungszeit für Transaktionen sinkt, birgt aber einige Probleme.

source: Too-fast money creation
de_de: Zu schnelle Geldschöpfung

source: Remember the planned money supply curve from <<ch02>>? The plan was to issue half the money supply, 10.5 million CT, during the first four years; then, during the next four years, issue half of that, 5.25 million CT; and so on, until the issuance rounds down to 0. This whole process would take about 131 years.
de_de: Erinnerst du dich an die Geldschöpfungskurve aus <<ch02>>? Der Plan war, die Hälfte des Geldes, 10,5 Millionen CT, während der ersten vier Jahre herauszugeben; während der nächsten vier Jahre die Hälfte dessen, 5,25 Millionen CT; und so weiter, bis sich die Emissionsmenge auf 0 abrundet. Dieser ganze Prozess würde etwa 131 Jahre dauern.

source: Now, because Lisa beefed up her mining and Rashid added his mining computer, the issuance is too fast. With this high block rate, it will take only half the time until all the cookie tokens are created.
de_de: Jetzt, weil Lisa ihr Mining hochgerüstet und Rashid seinen Mining Computer eingebracht hat, ist die Emission zu schnell. Mit dieser hohen Blockrate wird es nur halb so lange dauern, bis alle Cookie Tokens erzeugt wurden.

source: This means the increase rate in money supply is 264/144 = 1.8 times the desired supply increase rate.
de_de: Das bedeutet, die erhöhte Emissionsrate beträgt 264/144 = 1.8 Mal die gewünschte Emissionsrate.

source: More splits
de_de: Mehr Splits

source: Splits happen naturally every now and then. But when the block rate increases, the risk of natural splits increases. Imagine if 3,000 people started mining in their basements. This would increase the block rate by 1,000 times. Each and every second, several miners would find a valid proof of work and publish a block. There would be splits on almost every block height. This makes transactions in recent blocks less reliable because those blocks can more easily be split off from the main chain.
de_de: Spits kommen ganz natürlich ab und zu vor. Aber wenn die Blockrate steigt, nimmt das Risiko natürlicher Splits zu. Stell dir vor, wenn 3000 Leute daheim im Keller minen würden. Das würde die Blockrate um den Faktor 1000 erhöhen. Jede einzelne Sekunde würden mehrere Miner einen gültigen Proof of Work finden und einen Block veröffentlichen. Es gäbe fast auf jeder Blockhöhe einen Split. Das macht Transaktionen in jüngeren Blocks weniger zuverlässig, weil diese Blocks leichter von der besten Chain abgespalten werden können.

source: This would also be problematic from a security perspective because if two branches have about 50% of the total hashrate on each branch, individual branch security is cut in half. We’ll discuss blockchain security further in <<security>>.
de_de: Es wäre auch aus Sicht der Verlässlichkeit oder _Security_ problematisch, denn wenn zwei Zweige ungefähr 50% der gesamten Hashrate haben, ist die Security jedes Zweiges halbiert. Wir reden in <<security>> mehr über Security.

source: What’s fixed?
de_de: Was wurde behoben?

source: We’ve fixed the hard problem of forcing “honest lucky numbers” in an interesting way. Let’s see what issues from <<probability-of-splits>> remain:
de_de: Wir haben auf eine interessante Weise das schwierige Problem gelöst, “ehrliche Glückszahlen” zu erzwingen . Lasst uns mal schauen, welche Probleme aus <<probability-of-splits>> verbleiben:

source: [x] You can cheat with lucky numbers. You can’t prove you actually drew an honest lucky number.
de_de: [ x] Man kann bei Glückszahlen mogeln. Man kann nicht beweisen, dass man ehrlich durch Glück eine passende Zahl gefunden hat.

source: [x] For every new miner, the system becomes more censorship-resistant but also more vulnerable to private key theft. A stolen block-signing private key will let the thief create blocks by cheating with lucky numbers and collect rewards for themselves.
de_de: [x] Mit jedem neuen Miner wird das System robuster gegen Zensur, aber auch empfindlicher gegen private Key Diebstahl. Mehr Computer mit mehr private Keys bedeutet höhere Wahrscheinlichkeit, dass ein Key gestohlen wird. Ein gestohlener Blocksignier-private Key lässt einen Dieb Blocks erzeugen, bei denen er mit den Glückszahlen betrügt und die Block-Belohnungen einkassiert.

source: [x] For each new miner, the risk that one cheats with lucky numbers increases.
de_de: [x ] Mit jedem neuen Miner steigt das Risiko, dass ein Miner mit getürkten Glückszahlen mogelt.

source: [ ] You can’t just add new miners to the system. You need to lower the lucky-number threshold as more miners are added, to keep the 10 minutes per block average and the money issuance at the desired rate.
de_de: [ ] Man kann nicht einfach neue Miner zum System hinzufügen. Man muss den Schwellwert für die Glückszahlen mit anpassen, wenn mehr Miner dazukommen, damit der Durchschnitt von 10 Minuten pro Block und damit die Geldproduktion bei der gewünschten Rate bleibt.

source: There’s only one problem left in the list. We’ll fix it in the next section.
de_de: Es verbleibt nur noch ein Problem in der Liste. Das werden wir im nächsten Abschnitt ändern.

source: Difficulty adjustments
de_de: Difficulty Anpassungen

source: Now that you’ve added more miners and more hashrate to the system, the block rate has increased. This is because the miners collectively make more tries per second than before, resulting in more blocks being produced per hour.
de_de: Jetzt, da wir mehr Miner und mehr Hashrate zum System hinzugefügt haben, hat sich die Blockrate erhöht. Denn die Miner arbeiten gemeinsam mehr Versuche pro Sekunde ab als vorher, was zur Produktion von mehr Blocks pro Stunde führt.
