Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: All data items in signature scripts (public key and signature × 2 = 4)
de_de: Alle Datenobjekte in Signatur Scripts (public Key und Signatur × 2 = 4)

source: All data items of the outputs (2)
de_de: Alle Datenobjekte in den Outputs (2)

source: The probability that all nine tests are negative is (1 – (5/8)^3^)^9^ ≈ 0.08. So, almost all—92/100—transactions will be sent to the wallet. This shows that having only three 0s of 8 bits in the bloom filter won’t help reduce the data much, but it protects your privacy better.
de_de: Die Wahrscheinlichkeit, dass alle neun Tests negativ sind, ist (1 – (5/8)^3^)^9^ ≈ 0.08. Es werden also fast alle—92/100—Transaktionen an das Wallet gesendet. Das zeigt, dass nur drei 0en in den 8 Bits des Bloom Filter zu haben nicht hilft, die Daten wesentlich zu reduzieren, aber es hilft besser, die Privacy zu schützen.

source: To get fewer false positives, John’s wallet must use a larger bloom filter so the ratio (number of ones/bloom filter size) decreases.
de_de: Um weniger Scheintreffer zu bekommen, muss Johns Wallet einen grösseren Bloom Filter benutzen, damit das Verhältnis (Anzahl Einsen / Grösse des Bloom Filters) sinkt.

source: Let’s define some symbols:
de_de: Definieren wir ein paar Symbole:

source: t = Number of tests performed on a transaction (9) p = Probability of a transaction being deemed uninteresting r = Ratio of the number of 1s/bloom filter size
de_de: t = Anzahl Tests auf einer Transaktion (9) p = Wahrscheinlichkeit, dass eine Transaktion für uninteressant gehalten wird. r = Verhältnis der Anzahl 1en / Grösse des Bloom Filters

source: We can generalize our calculation as follows:
de_de: Wir können unsere Berechnung wie folgt verallgemeinern:

source: Let’s say you only want to get 1/10 of all transactions (given that all transactions are like the previous transaction, with two inputs and two outputs). How big do you have to make the bloom filter?
de_de: Sagen wir, du willst 1/10 aller Transaktionen bekommen (unter der Annahme, dass alle Transaktionen wie die vorige Transaktion aus zwei Inputs und zwei Outputs bestehen). Wie gross musst du den Bloom Filter machen?

source: This calculation means the bloom filter should be about 6/0.23 ≈ 26 bits to get only 1/10 of all transactions. The bloom filter size must be a multiple of 8 bits, so 26 bits isn’t allowed. We can round upward to 32 bits.
de_de: Diese Berechnung liefert, dass der Bloom Filter etwa 6/0.23 ≈ 26 sein sollte, um nur 1/10 aller Transaktionen zu bekommen. Der Bloom Filter muss aber ein Vielfaches von 8 Bit sein, also ist 26 nicht erlaubt. Wir können auf 32 Bit aufrunden.

source: Remember that these are rough calculations based on somewhat false assumptions regarding transaction characteristics. We also aren’t considering that the number of 1s in the example isn’t strictly six but can be anywhere from three to six, given that both John’s addresses could have generated the same set of indexes. But this process should help you get an idea of how big a bloom filter must be.
de_de: Denk daran, dass diese groben Berechnungen ein wenig auf falschen Annahmen beruhen, was die Transaktions-Merkmale betrifft. Wir berücksichtigen auch nicht, das die Anzahl 1en im Beispiel nicht genau sechs ist, sondern alles zwischen drei und sechs sein kann, angesichts der Tatsache, dass Johns Adressen auch den selben Satz an Indizes für beide Adressen hätten generieren können. Aber dieser Vorgang sollte dir helfen, eine Idee davon zu bekommen, wie gross ein Bloom Filter sein muss.

source: Problems with bloom filters
de_de: Probleme mit Bloom Filterm

source: Bloom filters have been broadly used by many lightweight wallets, but they have issues:
de_de: Bloom Filter werden schon lange bei vielen Lightweight Wallets benutzt, aber sie haben Probleme:

source: A node that receives bloom filters from a lightweight client can, with high precision, determine what addresses belong to a wallet. The more bloom filters collected, the higher the accuracy. See <<web-bloom-filter-privacy>> for details.
de_de: Ein Node, der Bloom Filter von einem Lightweight Wallet bekommt, kann ziemlich genau feststellen, welche Adressen zu einem Wallet gehören. Je mehr Bloom Filter er sammelt, dest höher die Genauigkeit. Siehe <<web-bloom-filter-privacy>> für Details.

source: When a full node first receives a bloom filter from a lightweight client, the node needs to scan the entire blockchain for matching transactions. This scanning is processing and disk intensive and can take several minutes, depending on the full node’s hardware. This fact can be used maliciously to attack full nodes so they become unresponsive, in a _denial-of-service_ (DoS) attack.
de_de: Wenn ein Full Node zum ersten Mal einen Bloom Filter von einem Lightweight Wallet bekommt, muss der Node die gesamte Blockchain scannen und nach passenden Transaktionen suchen. Dieser Prozess ist I/O-Intensiv und kann mehrere Minuten dauern, je nachdem, auf was für Hardware der Node läuft. Dies kann bei einer _Denial-of-Service_ (DoS) Attacke bösartig benutzt werden, um Full Node anzugreifen, sodass sie nicht mehr antworten.

source: New Bitcoin Improvement Proposals (BIPs), BIP157 and BIP158, have been proposed that aim to solve these issues, but they haven’t been widely implemented and tested yet. The general idea is to reverse the process so a full node sends a filter to the lightweight wallet for each block. This filter contains information about what addresses the block affects. The lightweight client checks whether its addresses match the filter and, if so, downloads the entire block. The block can be downloaded from any source, not just the full node that sent the filter.
de_de: Neue Bitcoin Improvement Proposals (BIPs), BIP157 und BIP158 sind zur Lösung vorgeschlagen worden, aber noch sind sie weder sehr verbreitet noch gut getestet. Die Idee dabei ist, den Vorgang so umzukehren, dass ein Full Node für jeden Block einen Filter zum Lightweight Wallet schickt. Dieser Filter enthält Informationen darüber, welche Adressen der Block betrifft. Das Lightweight Wallet prüft, ob seine Adressen auf den Filter passen und wenn ja, lädt er den ganzen Block. Der Block kann dabei von überall geladen werden, nicht nur von dem Full Node, der den Filter gesendet hat.

source: For the sake of orientation, <<fig0621>> shows part of what I sketched out in <<wallet-connection>> in <<ch01>>, where Bob’s wallet was notified of Alice’s payment to Bob.
de_de: Zu Orientierung, <<fig0621>> zeigt einen Teil dessen, was ich in <<wallet-connection>> in <<ch01>> skizziert hatte, wo Bobs Wallet nicht über Alices Zahlung an Bob informiert wurde.

source: A Bitcoin wallet is notified of an incoming payment by a full node.
de_de: Ein Bitcoin Wallet wird von einem Full Node über eine eingehende Zahlung informiert.

source: In the example in this chapter, John has sent a bloom filter to the cafe’s full node to receive only information concerning him. The full node has received a block that contains two transactions that are interesting to John, at least according to John’s bloom filter.
de_de: In dem Beispiel in diesem Kapitel hat John einen Bloom Filter an den Full Node des Cafés geschickt, um nur ihn betreffende Informationen zu bekommen. Der Full Node hat einen Block mit zwei Transaktionen erhalten, die John interessieren, zumindest laut Johns Bloom Filter.

source: The next thing that happens is that the new block’s header and the potentially interesting transactions are sent to John’s wallet.
de_de: Als nächstes werden der Header des neuen Blocks und die potenziell interessanten Transaktionen an Johns Wallet gesendet.

source: Now that the full node has determined which transactions to send to the wallet, it needs to send the new block header and all transactions John’s wallet might be interested in.
de_de: Nachdem der vollständige Knoten festgelegt hat, welche Transaktionen an das Wallet gesendet werden sollen, muss er den neuen Blockheader und alle Transaktionen senden, an denen Johns Wallet interessiert sein könnte.

source: The full node feeds the lightweight wallet the block header and potentially relevant transactions.
de_de: Der Full Node füttert dem Lightweight Wallet den Block Header und die potentiell relevanten Transaktionen.

source: The full node has determined that transactions Tx~2~ and Tx~3~ need to be sent to the wallet. If the node sends only the header and the two transactions, then John’s wallet won’t be able to verify that the transactions belong to the block. The merkle root depends on three transactions, Tx~1~, Tx~2~, and Tx~3~, but the wallet only gets Tx~2~ and Tx~3~ from the full node. The wallet can’t re-create the merkle root in the block header. It needs more information to verify that the transactions are included in the block. Remember that you want to save data traffic, so sending all transactions in the block isn’t good enough.
de_de: Der Full Node hat festgestellt, dass die Transaktionen Tx~2~ und Tx~3~ an das Wallet geschickt werden müssen. Wenn der Node nur den Header und die beiden Transaktionen schickt, dann kann Johns Wallet aber nicht prüfen, dass die Transaktionen zu dem Block gehören. Der Merkle Root hängt von drei Transaktionen ab, Tx~1~, Tx~2~ und Tx~3~, aber das Wallet bekommt nur Tx~2~ und Tx~3~ vom Full Node. So kann das Wallet den Merkle Root des Block Headers nicht wieder erstellen. Es braucht mehr Informationen, um zu prüfen, dass die Transaktionen in den Block wirklich eingebettet sind. Denke daran, dass wir sparsam mit dem Datenverkehr sein wollten, also alle Transaktionen im Block zu schicken ist nicht gut genug.

source: Creating the merkle root
de_de: Erzeugen des Merkle Root

source: It’s time to reveal how Lisa created the merkle root. Suppose Lisa is about to create the block header shown in <<fig0622>>. She needs to calculate the combined hash of all transactions, called the merkle root (<<fig0623>>). You calculate the merkle root by creating a hierarchy of cryptographic hashes, a merkle tree.
de_de: Es wird Zeit, aufzuklären, wie Lisa den Merkle Root erzeugt hat. Nimm an, Lisa fängt gerade an, den Block Header in <<fig0622>> zu erzeugen. Sie muss den kombinierten Hash aller Transaktionen berechnen, der als Merkle Root bezeichnet wird (<<fig0623>>). Man berechnet den Merkle Root, indem man eine Hierarchie von kryptografischen Hashes erzeugt, einen Merkle Tree.

source: Lisa creates a merkle root from the transactions in a block.
de_de: Lis erzeugt einen Merkle Root aus den Transaktionen in einem Block.

source: The transactions are ordered the same way they are in the block. If the number of items is odd, the last item is duplicated and added last. This extra item isn’t added to the block; it’s only duplicated temporarily for the merkle tree calculation.
de_de: Die Transaktionen werden so sortiert, wie sie im Block liegen. Wenn die Anzahl Objekte ungerade ist, wird das letzte Objekt dupliziert und am Schluss angehängt. Dieses zusätzliche Objekt wird nicht zum Block hinzugenommen; es wir nur vorübergehend dupliziert zum Zwecke der Merkle Tree Berechnung.

source: Each item (transaction, in this case) is hashed with double SHA256. This results in four hash values of 256 bits each.
de_de: Jedes Objekt (in diesem Falle Transaktionen) wird mit Doppel-SHA256 gehasht. Das resultiert in vier Hashwerten von je 256 Bits.

source: The hash values are pairwise _concatenated_, meaning two hashes are merged by appending the second hash after the first hash. For example, `abc` concatenated with `def` becomes `abcdef`.
de_de: Die Hashwerte werden paarweise _concateniert_, zwei Hashes werden also verbunden, indem man den zweiten Hash an den Ersten hinten anhängt. Zum Beispiel ergibt `abc` concateniert mit `def` als Ergebnis `abcdef`.

source: The four hash values have now become two concatenated values. Because two is an even number, you don’t add an extra item at the end. The two concatenated values are each hashed separately, resulting in two 256-bit hashes.
de_de: Die vier Hashwerte sind jetzt zu zwei concatenierten Werten geworden. Weil zwei eine gerade Zahl ist, müssen wir kein zusätzliches Objekt ans Ende hängen. Die beiden concatenierten Werte werden separat voneinander gehasht, was zu zwei 256 Bit Hashes führt.

source: These two hash values are concatenated into a single 512-bit value. This value is hashed, resulting in the 256-bit merkle root. This merkle root is written into the block header. If any transaction is added, deleted, or changed, the merkle root must be recalculated (<<fig0624>>).
de_de: Diese zwei Hashwerte werden zu einem einzelnen 512 Bit Wert concateniert. Dieser Wert wird gehasht, was den 256 Bit Merkle Root liefert. Der Merkle Root wird in den Block Header geschrieben. Wenn eine Transaktion dazukommt, gelöscht oder geändert wird, muss der Merkle Root neu berechnet werden (<<fig0624>>).

source: A change in the transactions will cause a change in the merkle root, making the signature invalid.
de_de: Eine Änderung in den Transaktionen verursacht eine Änderung im Merkle Root, wodurch die Signatur ungültig wird.

source: This is nice, because when Lisa signs the block header, you know that if someone tampers with the transactions in it, the signature becomes invalid.
de_de: Das ist schön, denn wenn Lisa den Block Header signiert, weisst du, dass die Signatur ungültig wird, wenn jemand an den Transaktionen darin herumpfuscht.

source: Proving that a transaction is in a block
de_de: Beweisen, dass eine Transaktion in einem Block enthalten ist

source: The full node wants to send Tx~2~ and Tx~3~ to John’s wallet because it thinks those transactions might be interesting to John’s wallet. The full node wants to prove to the wallet that both Tx~2~ and Tx~3~ are included in the block. But let’s begin with proving only a single transaction, Tx~2~. We’ll look at a bigger, more complex example later in this chapter.
de_de: Der Full Node möchte die Transaktionen Tx~2~ und Tx~3~ an Johns Wallet schicken, weil er glaubt, dass sie für Johns Wallet interessant sein könnten. Der Full Node möchte beweisen, dass sowohl Tx~2~ als auch Tx~3~ in dem Block enthalten sind. Aber fangen wir mit dem Beweis für eine einzelne Transaktion an, Tx~2~. Wir schauen uns später im Kapitel ein grösseres, komplexeres Beispiel an.

source: How can the full node provide proof to the wallet that Tx~2~ is included in the block? It can provide a _partial merkle tree_ that connects Tx~2~ to the merkle root in the block header. The general idea is to send the bare minimum to the lightweight wallet—just enough to verify that Tx~2~ is in the block. In this example, the node will send the stuff in <<fig0625>> to the lightweight wallet.
de_de: Wie kann der Full Node dem Wallet beweisen, dass Tx~2~ im Block enthalten ist? Es kann einen _partiellen Merkle Tree_ liefern, der Tx~2~ mit dem Merkle Root im Block Header verbindet. Die Idee dabei ist, das absolute Minimum an das Lightweight Wallet zu schicken–gerade genug, um zu verifizieren, dass Tx~2~ wirklich im Block enthalten ist. In diesem Beispiel schickt der Node das Zeug aus <<fig0625>> an das Lightweight Wallet.

source: The bare minimum to prove Tx~2~ is in the block. The full node sends this to the wallet.
de_de: Das absolute Minimum, um zu beweisen, dass Tx~2~ Teil des Blockes ist. Der Full Node schickt es an das Wallet.

source: The lightweight wallet will then use this information to verify that Tx~2~ is in the block by calculating the intermediary hashes toward the root, and verify that the hash of Tx~2~ is among the hashes provided by the full node (<<fig0626>>).
de_de: Das Lightweight Wallet benutzt dann diese Information zur Überprüfung, ob Tx~2~ in dem Block vorkommt, indem es die Zwischen-Hashes in Richtung Root berechnet und verifiziert, dass der Hash von Tx~2~ unter den Hashes ist, die der Full Node geschickt hat (<<fig0626>>).

source: The lightweight wallet verifies that Tx~2~ is in the block by reconstructing the merkle root.
de_de: Das Lightweight Wallet verifiziert, dass Tx~2~ im Block liegt, indem es den Merkle Root rekonstruiert.

source: The hash functions have been removed from the diagram to make it easier to read. The wallet can now be certain Tx~2~ is in the block.
de_de: Die Hashfunktionen sind aus dem Diagramm entfernt worden, damit es leichter zu lesen ist. Das Wallet kann jetzt sicher sein, dass Tx~2~ in dem Block enthalten ist.

source: How it really works
de_de: Wie es wirklich funktioniert

source: The following describes in detail how to create and verify a partial merkle tree. If you want, you can skip this part and jump to <<security-of-lightweight-wallets>>.
de_de: Das folgende beschreibt detailliert, wie man einen partiellen Merkle Tree erzeugt und verifiziert. Wenn du willst, kannst du diesen Abschnitt überspringen und direkt zu <<security-of-lightweight-wallets>> springen.

source: Creating the partial merkle tree
de_de: Erzeugen eines partiellen Merke Trees

source: The partial merkle tree is a pruned version of the full merkle tree, containing only the parts needed to prove Tx~2~ is part of the tree. The full node sends three things to the wallet:
de_de: Der partielle Merkle Tree ist eine gestutzte Version des vollen Merkle Trees, die nur jene Teile enthält, welche zu dem Beweis nötig sind, dass Tx~2~ zu dem Baum gehört. Der Full Node sendet dreierlei an das Wallet:

source: The block header
de_de: Den Block Header

source: The partial merkle tree
de_de: Den partiellen Merkle Tree

source: Let’s construct the partial merkle tree. The full node knows the number of transactions in the block, so it knows the merkle tree’s shape. To construct the partial merkle tree, the full node examines the hashes in the merkle tree, starting at the merkle root and moving downward in the tree, left branch first (<<fig0627>>).
de_de: Konstruieren wir den partiellen Merkle Tree. Der Full Node kennt die Anzahl Transaktionen im Block, also kennt er die Form des Merkle Trees. Um den partiellen Merkle Tree zu konstruieren inspiziert der Full Node die Hashes im Merkle Tree, beginnend am Merkle Root und in einer Abwärtsbewegung den Baum hinab, linker Ast zuerst (<<fig0627>>).

source: The full node constructs a partial merkle tree that connects Tx~2~ to the merkle root in the block header.
de_de: Der Full Node konstruiert einen partiellen Merkle Tree, der Tx~2~ mit dem Merkle Root im Block Header verbindet.

source: The partial merkle tree consists of
de_de: Der partielle Merkle Tree besteht aus

source: A number indicating the total number of transactions in the block
de_de: Einer Zahl, die die Gesamtzahl der Transaktionen im Block angibt

source: A list of flags
de_de: Einer Liste Flags

source: A list of hashes
de_de: Einer Liste Hashes

source: At each step, you do two things with the current hash, as outlined in the following table:
de_de: Bei jedem Schritt macht man zweierlei mit dem aktuellen Hash, wie in der folgenden Tabelle dargestellt:

source: Add the flag to the list of flags. ✘ means there’s nothing interesting in this hash’s branch; ✔ means this branch contains an interesting transaction.
de_de: Füge das Flag zu der Liste von Flags hinzu. ✘ bedeutet, im Zweig dieses Hashes ist nichts Interessantes ; ✔ heisst, dieser Zweig enthält eine interessante Transaktion.

source: If the flag is ✘, or if this hash is an interesting txid, add the hash to the list of hashes.
de_de: Wenn das Flag ✘ ist oder der Hash eine interessante txid ist, füge den Hash der Liste von Hashes hinzu.

source: | Step| Commits to interesting txid? | List of flags | Is flag ✘, or is the hash an interesting txid?| List of hashes | 1 | yes | ✔ | no | - | 2 | yes | ✔✔ | no | - | 3 | no | ✔✔✘ | yes | 3 | 4 | yes | ✔✔✘✔ | yes | 3 4 | 5 | no | ✔✔✘✔✘ | yes | 3 4 5
de_de: | Schritt| Interessante txid? | Liste der Flags | Ist Flag ✘ oder Hash eine interessante txid?| Liste der Hashes | 1 | ja | ✔ | nein | - | 2 | ja | ✔✔ | nein | - | 3 | nein | ✔✔✘ | ja | 3 | 4 | ja | ✔✔✘✔ | ja | 3 4 | 5 | nein | ✔✔✘✔✘ | ja | 3 4 5

source: This ordering of the steps is called _depth first_, meaning you always move downward in the tree as far as you can before moving sideways. But you won’t go down in tree branches that don’t contain any interesting transactions. This is noted in the list of flags as ✘. You stop at ✘ because you don’t want to send unnecessary data to the wallet, hence the term _partial_ merkle tree.
de_de: Dieser Sortierschritt heisst _depth-first_, oder _erst abwärts_, was bedeutet, dass man im Baum erstmal so weit herunter geht wie möglich, bevor man sich seitwärts bewegt. Aber du gehst nicht in Zweige herunter, in denen sich keine interessanten Transaktionen befinden. Das wird in der Liste der Flags als ✘ markiert. Du hörst bei ✘ auf, weil du keine unnötigen Daten an das Wallet schicken willst, daher der Begriff _partieller_ Merkle Tree.

source: Now that the full node has created this partial merkle tree, the node will send the block header and the partial merkle tree to the wallet, and then send the actual transaction Tx~2~. The block header together with the partial merkle tree are often referred to as a _merkle proof_.
de_de: Jetzt, wo der Full Node den partiellen Merkle Tree konstruiert hat, schickt der Node den Block Header und den partiellen Merkle Tree an das Wallet und schickt dann die eigentliche Transaktion Tx~2~. Die Block Header zusammen mit dem partiellen Merkle Tree werden oft als _Merkle Proof_ bezeichnet.

source: Verifying the partial merkle tree
de_de: Verifizieren des partiellen Merkle Tree

source: The wallet has received a block header, a partial merkle tree, and the transaction Tx~2~ from the full node. That’s all the wallet needs to verify that Tx~2~ is indeed included in the block. The goal is to verify that there’s a way to “connect” Tx~2~ to the merkle root in the block header. It starts with verifying the partial merkle tree (<<fig0628>>).
de_de: Das Wallet hat einen Block Header, einen partiellen Merkle Tree und die Transaktion Tx~2~ vom Full Node erhalten. Das ist alles, was das Wallet benötigt, um zu verifizieren, dass Tx~2~ sich tatsächlich im Block befindet. Das Ziel ist, zu verifizieren, dass es einen Weg gibt, Tx~2~ mit dem Merkle Root des Block Headers zu “verbinden”. Es beginnt damit, den partiellen Merkle Tree zu verifizieren (<<fig0628>>).

source: The wallet verifies the partial merkle tree.
de_de: Das Wallet verifiziert den partiellen Merkle Tree.

source: Use the number of transactions (three) received from the full node to build the merkle tree’s structure. The wallet knows how a merkle tree with three transactions looks.
de_de: Benutze die Anzahl Transaktionen (drei), die vom Full Node empfangen wurden, um die Merkle Tree Struktur aufzubauen. Das Wallet weiss, wie ein Merkle Tree mit drei Transaktionen aussieht.

source: Use the list of flags and the list of hashes to attach hashes to the merkle tree in depth-first order, as follows.
de_de: Benutze die Liste der Flags und Hashes, um Hashes an den Merkle Tree zu heften, in depth-first Reihenfolge, wie folgt.

source: | Step| Next flag from list | Remaining list of flags | Is flag ✘, or are you at the lowest level?| Attach hash | List of hashes | 1 | ✔ | ✔✘✔✘ | no | - | 3 4 5 | 2 | ✔ | ✘✔✘ | no | - | 3 4 5 | 3 | ✘ | ✔✘ | yes | 3 | 4 5 | 4 | ✔ | ✘ | yes | 4 | 5 | 5 | ✘ | | yes | 5 |
de_de: | Schritt| Nächtes Flag aus Liste | Rest der Flag-Liste | Ist Flag ✘ oder bist du ganz unten?| Anzufügender Hash| Liste der Hashes | 1 | ✔ | ✔✘✔✘ | nein | - | 3 4 5 | 2 | ✔ | ✘✔✘ | nein | - | 3 4 5 | 3 | ✘ | ✔✘ | ja | 3 | 4 5 | 4 | ✔ | ✘ | ja | 4 | 5 | 5 | ✘ | | ja | 5 |
