Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: The output—the hash—is a 256-bit number; 256 bits equals 32 bytes because 1 byte consists of 8 bits. Thus, to store the number in a file, the file will be 32 bytes big, which is tiny compared to the size of the 1.21 MB cat picture. The particular cryptographic hash function used in this example is called SHA256 (Secure Hash Algorithm with 256-bit output) and is the most commonly used one in Bitcoin.
de_de: Die Ausgabe–der Hash– ist eine 256-Bit zahl; 256 Bits entsprechen 32 Bytes weil 1 Byte aus 8 Bits besteht. Um diese Zahl in einer Datei zu speichern, wäre die Datei also 32 Bytes gross, was im Vergleich zu den 1,21 MB des Katzenbildes winzig ist. Die spezielle kryptografische Hashfunktion in diesem Beispiel heisst SHA256 (Sicherer Hash Algorithmus mit 256 Bit Ausgabe) und ist der in Bitcoin am häufigsten benutzte.

source: The word _hash_ means something that’s chopped into small pieces or mixed up. That’s a good description of what a cryptographic hash function does. It takes the cat picture and performs a mathematical calculation on it. Out comes a big number—the cryptographic hash—that doesn’t look remotely like a cat. You can’t “reconstruct” the cat picture from just the hash—a cryptographic hash function is a _one-way function_. <<fig0207>> shows what happens when you change the cat picture a little and run it through the same cryptographic hash function.
de_de: Das Wort _Hash_ bedeutet eigentlich, dass etwas in kleine Stückchen gehackt oder vermengt wird. Das ist eine gute Beschreibung dessen, was eine kryptografische Hashfunktion tut. Sie nimmt das Katzenbild und vollführt eine mathematische Operation darauf. Heraus kommt eine riesige zahl–der kryptografische Hash–der nicht entfernt wie eine Katze aussieht. Man kann die Katze nicht aus dem Hash “rekonstruieren”–eine kryptografische Hashfunktion ist eine funktionale Einbahnstrasse. <<fig0207>> zeigt, was passiert, wenn man das Katzenbild ein bisschen abändert und es durch dieselbe Hashfunktion laufen lässt.

source: Hashing a modified cat picture. Can you spot the difference? The cryptographic hash function certainly did.
de_de: Hashen eines veränderten Katzenbildes. Siehst du den Unterschied? Die kryptografische Hashfunktion hat ihn jedenfalls gesehen.

source: This hash turns out completely different than the first hash. Let’s compare them:
de_de: Dieser Hash stellt sich als vollkommen anders heraus als der erste Hash. Vergleichen wir sie:

source: Old hash: dee6a5d375827436ee4b47a930160457901dce84ff0fac58bf79ab0edb479561 New hash: d2ca4f53c825730186db9ea585075f96cd6df1bfd4fb7c687a23b912b2b39bf6
de_de: Alter Hash: dee6a5d375827436ee4b47a930160457901dce84ff0fac58bf79ab0edb479561 Neuer Hash: d2ca4f53c825730186db9ea585075f96cd6df1bfd4fb7c687a23b912b2b39bf6

source: See how that tiny change to the cat picture made a huge difference in the hash value? The hash value is completely different, but the length of the hash is always the same regardless of input. The input “Hello” will also result in a 256-bit hash value.
de_de: Siehst du, wie diese winzige Änderung im Katzenbild eine riesige Änderung im Hashwert zur Folge hatte? Der Hashwert ist vollständig anders, aber die Länge des Hashes ist immer gleich, egal wie lang die Eingabedaten sind. Die Eingabe “Hello” erzeugt ebenfalls einen 256-Bit Hashwert.

source: Why are cryptographic hash functions useful?
de_de: Wozu dienen kryptografische Hashfunktionen?

source: Cryptographic hash functions can be used as an integrity check to detect changes in data. Suppose you want to store your favorite cat picture on your laptop’s hard drive, but you suspect the stored picture might become corrupted. This could happen, for example, due to disk errors or hackers. How can you make sure you detect corruption?
de_de: Kryptografische Hashfunktionen können zur Integritätsprüfung verwendet werden, um Änderungen in Daten festzustellen. Angenommen du willst dein Lieblings-Katzenbild auf der Festplatte deines Laptops abspeichern, aber du machst dir Sorgen, dass die Datei beschädigt werden könnte. Das könnte zum Beispiel aufgrund von Festplatten Fehlern oder Hackern geschehen. Wie kannst du sichergehen, dass du eine Beschädigung der Datei feststellen kannst?

source: First, you calculate a cryptographic hash of the cat picture on your hard drive and write it down on a piece of paper (<<fig0208>>).
de_de: Zunächst berechnest du den kryptografischen Hash des Katzenbildes auf deiner Festplatte und schreibst ihn auf ein Blatt Papier (<<fig0208>>).

source: Save a hash of the cat picture on a piece of paper
de_de: Sichere den Hash der Katzenbildes auf einem Blatt Papier

source: Later, when you want to look at the picture, you can check if it’s changed since you wrote the hash on that paper. Calculate the cryptographic hash of the cat picture again, and compare it to the original hash on your paper (<<fig0209>>).
de_de: Später, wenn du das Bild anschauen willst, kannst du überprüfen, ob es sich geändert hat, seitdem du den Hash aufgeschrieben hast. Berechne den kryptografischen Hash des Katzenbildes erneut und vergleiche ihn mit dem, den du auf Papier hast (<<fig0209>>).

source: Check the integrity of the cat picture. You detect a change.
de_de: Überprüfe die Integrität des Katzenbildes. Du stellst eine Abweichung fest.

source: How sure?
de_de: Wie sicher?

source: There’s a tiny chance the cat picture has changed even though the hashes match. But as you’ll see later, that chance is so small, you can ignore it.
de_de: Es gibt zwar eine winzige Chance, dass sich das Bild geändert hat und die Hashes trotzdem übereinstimmen. Du wirst aber später sehen, dass diese Chance so winzig ist, dass du sie getrost ignorieren kannst.

source: If the new hash matches the one on paper, you can be sure the picture hasn’t changed. On the other hand, if the hashes don’t match, the cat picture has definitely changed.
de_de: Wenn der neue Hash mit dem auf dem Papier übereinstimmt, kannst du sicher sein, dass das Bild unverändert ist. Auf der anderen Seite, sollten die Hashes sich unterscheiden, so hat sich das Bild definitiv geändert.

source: Bitcoin uses cryptographic hash functions a lot to verify that data hasn’t changed. For example, every now and then—on average, every 10 minutes—a new hash of the entire payment history is created. If someone tries to change the data, anyone verifying the hash of the modified data will notice.
de_de: Bitcoin verwendet kryptografische Hashfunktionen sehr ausgiebig, um zu überprüfen, dass sich Daten nicht geändert haben. Zum Beispiel wird immer ab und zu–durchschnittlich alle 10 Minuten–ein neuer Hash der gesamten Zahlungsgeschichte erzeugt. Wenn jemand versucht, diese Daten zu ändern, wird dies sofort von jedem, der die Hashes überprüft, bemerkt.

source: How does a cryptographic hash function work?
de_de: Wie funktioniert eine kryptografische Hashfunktion?

source: The real answer is complex, so I won’t go into exact detail. But to help you understand the operation of a cryptographic hash function, we’ll create a very simplistic one. Well, it isn’t really cryptographic, as I’ll explain later. Let’s just call it a hash function for now.
de_de: Die korrekte Antwort ist komplex, also werde ich nicht tief in's Detail gehen. Aber um die Arbeitsweise einer kryptografischen Hashfunktion zu verstehen, werden wir eine sehr einfache schreiben. Nun ja, ehrlich gesagt ist sie nicht wirklich kryptografisch, wie ich später noch erklären werde. Nennen wir sie erstmal einfach eine Hashfunktion.

source: _Modulo_ means to wrap around when a calculation reaches a certain value. For example:
de_de: _Modulo_ bedeutet umbrechen, wenn eine Berechnung einen bestimmten Wert überschreitet. Zum Beispiel::

source: 258 mod 256 is the remainder of the integer division 258/256: 258 = 1 × 256 + 2. The remainder is 2.
de_de: 258 mod 256 ist der Rest der Integerdivision 258/256: 258 = 1 × 256 + 2. Der Rest beträgt 2.

source: Suppose you want to hash a file containing the six bytes `a1 02 12 6b c6 7d`. You want the hash to be a 1-byte number (8 bits). You can construct a hash function using _addition modulo 256_, which means to wrap around to 0 when the result of an addition reaches 256 (<<fig0210>>).
de_de: Angenommen du willst den Hash einer Datei mit den sechs Bytes `a1 02 12 6b c6 7d` berechnen. Du möchtest, dass der Hash eine 1 Byte lange Zahl ist (8 Bits) Du benutzt eine Hashfunktion, die die _Addition modulo 256_ benutzt, was bedeutet, sie bricht beim Wert von 256 um und fängt wieder bei 0 an, sobald das Ergebnis einer Addition den Wert 256 überschreitet (<<fig0210>>).

source: Simplistic hash function using byte-wise addition modulo 256
de_de: Simplistische Hashfunktion mit Byte-für Byte Addition modulo 256

source: The result is the decimal number 99. What does 99 say about the original input `a1 02 12 6b c6 7d`? Not much—99 looks just as random as any other single-byte number.
de_de: Das Ergebnis ist die Dezimalzahl 99. Was sagt 99 über die Eingabedaten `a1 02 12 6b c6 7d` aus? Nicht viel; 99 sieht genauso zufällig aus wie jede andere zufällige Zahl.

source: If you change the input, the hash will change, although a chance exists that the hash will remain 99. After all, this simple hash function has just 256 different possible outputs. With real cryptographic hash functions, like the one we used to hash the cat picture, this chance is unimaginably small. You’ll soon get a glimpse of this probability.
de_de: Wenn du die Eingabedaten änderst, ändert sich auch der Hashwert, obwohl es möglich ist, dass der Hash trotzdem zufällig 99 ergibt. Schliesslich hat diese Hashfunktion nur 256 verschiedene mögliche Ergebnisse. Mit echten kryptografischen Hashfunktionen wie der, die wir für das Katzenbild benutzt hatten, ist diese Wahrscheinlichkeit unvorstellbar klein. Du wirst bald eine Idee von dieser Wahrscheinlichkeit bekommen.

source: Properties of a cryptographic hash function
de_de: Eigenschaften einer kryptografischen Hashfunktion

source: A cryptographic hash function takes any digital input data, called a _pre-image_, and produces a fixed-length output, called a _hash_. In the example with the cat picture on your hard drive, the pre-image is the cat picture of 1.21 MB, and the hash is a 256-bit number. The function will output the exact same hash each time the same pre-image is used. But it will, with extremely high probability, output a totally different hash when even the slightest variation of that pre-image is used. The hash is also commonly referred to as a _digest_.
de_de: Eine kryptografische Hashfunktion nimmt beliebige Eingabedaten, das sogenannte _Pre-Image_, und erzeugt daraus eine Ausgabe von fester Länge, die als _Hash_ bezeichnet wird. In dem Beispiel mit dem Katzenbild auf deiner Festplatte ist das Pre-Image das Katzenbild von 1,21 MB und der Hash ist eine 256 Bit lange Zahl. Die Funktion liefert jedesmal genau denselben Hash für dasselbe Pre-Image. Aber mit allerhöchster Wahrscheinlichkeit wird sie einen vollkommen anderen Wert ergeben, wenn auch nur die winzigste Änderung am Pre-Image stattgefunden hat. Der Hash wird gemeinhin auch als _Digest_, also Kurzfassung, bezeichnet.

source: Let’s look at what properties you can expect from a cryptographic hash function. I’ll illustrate using SHA256 because it’s the one Bitcoin uses most. Several cryptographic hash functions are available, but they all provide the same basic properties:
de_de: Schauen wir uns an, welche Eigenschaften wir von einer kryptografischen Hashfunktion erwarten können. Ich illustriere das anhand der Funktion SHA256, weil diese in Bitcoin am meisten verwendet wird. Mehrere kryptografische Hashfunktionen sind verfügbar, aber sie besitzen alle dieselben grundlegenden Eigenschaften:

source: The same input will always produce the same hash.
de_de: Gleiche Eingabedaten erzeugen den gleichen Hash.

source: Slightly different inputs will produce very different hashes.
de_de: Leicht unterschiedliche Eingabedaten erzeugen sehr unterschiedliche Hashes.

source: The hash is always of the same fixed size. For SHA256, it’s 256 bits.
de_de: Der Hash hat stets eine feste Länge. Bei SHA256 sind dies 256 Bits.

source: Brute-force trial and error is the only known way to find an input that gives a certain hash.
de_de: Die Holzhammermethode Trial-and-Error ist der einzige bekannte Weg, einen Input zu finden, der einen bestimmten Hash erzeugt.

source: A cryptographic hash function, SHA256, in action. The input “Hello!” will give you the same output every time, but the slightly modified input “Hello” will give you totally different output.
de_de: Eine kryptografische Hashfunktion, SHA256, in Aktion. Die Eingabe “Hello!” gibt dir jedesmal denselben Hash, aber der leicht veränderte Input “Hello” ergibt einen völlig anderen Output.

source: <<fig0211>> illustrates the first three properties. The fourth property of a cryptographic hash function is what makes it a _cryptographic_ hash function, and this needs a bit more elaboration. There are some variations to the fourth property, all of which are desirable for cryptographic hash functions (<<fig0212>>):
de_de: <<fig0211>> illustriert die ersten drei Eigenschaften. Die vierte Eigenschaft einer kryptografischen Hashfunktion ist das, was sie _kryptografisch_ macht, und das bedarf einer gewissen Erläuterung. Es gibt einige Varianten der vierten Eigenschaft, von denen alle für kryptografische Hashfunktionen wünschenswert sind (<<fig0212>>):

source: Collision resistance
de_de: Kollisionsresistenz

source: You have only the cryptographic hash function at hand. It’s hard to find two _different_ inputs that _result in the same hash_.
de_de: Du hast nur die vorliegende kryptografische Hashfunktion. Es ist schwer, zwei _verschiedene_ Inputs zu finden, die _denselben Hash ergeben_.

source: Pre-image resistance
de_de: Pre-Image Resistenz

source: You have the hash function and a hash. It’s hard to find _a pre-image of that hash_.
de_de: Du hast die Hash Funktion und den Hash. Es ist schwierig, ein Pre-Image zu dem Hash zu finden.

source: Second-pre-image resistance
de_de: Zweit-Pre-Image-Resistenz

source: You have the hash function and a pre-image (and thus the hash of that pre-image). It’s hard to find _another pre-image with the same hash_.
de_de: Du hast eine Hashfunktion und ein Pre-Image (und damit auch den Hash des Pre-Images). Es ist schwer, ein _weiteres Pre-Image zu diesem Hash_ zu finden.

source: Different desirable properties for cryptographic hash functions. For collision resistance, X can be anything, as long as the two _different_ inputs give the same output X.
de_de: Verschiedene wünschenswerte Eigenschaften kryptografischer Hashfunktionen. Für Kollisionsresistenz kann X beliebig sein, solange wie die beiden _unterschiedlichen_ Inputs denselben Output X ergeben.

source: Illustration of “hard”
de_de: Illustration von “schwierig”

source: The term _hard_ in this context means astronomically hard. It’s silly to even try. We’ll look at second-pre-image resistance as an example of what _hard_ means, but a similar example can be made for any of the three variants.
de_de: Der Term _schwierig_ bedeutet in diesem Zusammenhang astronomisch schwierig. Es wäre albern, es überhaupt zu versuchen. Wir betrachten Zweit-Pre-Image-Resistenz als Beispiel dafür, was _schwierig_ bedeutet, aber ein ähnliches Beispiel kann für jede der drei Varianten aufgestellt werden.

source: Suppose you want to find an input to SHA256 that results in the same hash as “Hello!”:
de_de: Angenommen du willst einen Input für SHA256 finden, der zu demselben Hash führt wie der Input “Hello!”:

source: You can’t change the input “Hello!” just a little so the function “won’t notice.” It _will_ notice and will output a totally different hash. The only way to find an input other than “Hello!” that gives the hash `334d016f...d42c87b7` is to try different inputs one by one and check whether one produces the desired hash.
de_de: Du kannst ja nicht den Input “Hello!” einfach so geringfügig verändern, dass die Hashfunktion das nicht bemerkt. Sie _wird_ es bemerken und der Output wird ein vollständig anderer Hash sein. Der einzige Weg, einen anderen Input als “Hello!” zu finden, der den Hash `334d016f...d42c87b7` erzeugt, ist, verschiedene Inputs durchzuprobieren und immer wieder zu prüfen, ob der richtige Hash dabei herauskommt.

source: Let’s try, using <<tab0203>>.
de_de: Probieren wir es mal mit <<tab0203>>.

source: Finding an input with the same hash as “Hello!” is nearly impossible.
de_de: Einen Input mit demselben Hash wie “Hello!” zu finden, ist nahezu unmöglich.

source: | Input | Hash | Success? | Hello1! | 82642dd9...2e366e64 | Nope | Hello2! | 493cb8b9...83ba14f8 | Nope | Hello3! | 90488e86...64530bae | Nope | ... | ... | Nope, nope, …, nope | Hello9998! | cf0bc6de...e6b0caa4 | Nope | Hello9999! | df82680f...ef9bc235 | Nope | Hello10000! | 466a7662...ce77859c | Nope a| image:{commonimagedir}/cat.svg[{thumb}] | dee6a5d3...db479561 | Nope | My entire music collection | a5bcb2d9...9c143f7a | Nope
de_de: | Input | Hash | Erfolg? | Hello1! | 82642dd9...2e366e64 | Nö | Hello2! | 493cb8b9...83ba14f8 | Nö | Hello3! | 90488e86...64530bae | Nö | ... | ... | Nö, nö, …, nö | Hello9998! | cf0bc6de...e6b0caa4 | Nö | Hello9999! | df82680f...ef9bc235 | Nö | Hello10000! | 466a7662...ce77859c | Nö a| image:{commonimagedir}/cat.svg[{thumb}] | dee6a5d3...db479561 | Nö | Meine gesamte Musiksammlung | a5bcb2d9...9c143f7a | Nö

source: How big is 2^256^?
de_de: Wie gross ist 2^256^?

source: 2^256^ is about 10^77^, which is almost the number of atoms in the universe. Finding a pre-image of a SHA256 hash is like picking an atom in the universe and hoping it’s the correct one.
de_de: 2^256^ ist etwa 10^77^, was etwa der Anzahl Atome im Universum entspricht. Ein Pre-Image zu einem SHA256-Hash zu finden ist, wie ein Atom im Universum auszusuchen und zu hoffen, dass es das richtige ist.

source: As you can see, we aren’t very successful. Think about how much time it would take for a typical desktop computer to find such an input. It can calculate about 60 million hashes per second, and the expected number of tries needed to find a solution is 2^255^. The result is 2^255^ / (60 × 10^6^) s ≈ 10^68^ s ≈ 3 × 10^61^ years, or about 30,000,000,000,&#8203;000,&#8203;000,&#8203;000,&#8203;000,&#8203;000,&#8203;000,&#8203;000,&#8203;000,&#8203;000,&#8203;000,&#8203;000,&#8203;000,&#8203;000,&#8203;000,&#8203;000,&#8203;000,&#8203;000 years.
de_de: Wie du siehst, sind wir nicht sonderlich erfolgreich. Denk mal, wie lange ein Desktop Computer brauchen würde, um einen solchen Input zu finden. Er kann ungefähr 60 Millionen Hashes pro Sekunde berechnen, und die erwartete Anzahl Versuche, um eine Lösung zu finden, beträgt 2^255^. Das Ergebnis ist 2^255^ / (60 × 10^6^) s ≈ 10^68^ s ≈ 3 × 10^61^ Jahre, oder etwa 30,000,000,000,&#8203;000,&#8203;000,&#8203;000,&#8203;000,&#8203;000,&#8203;000,&#8203;000,&#8203;000,&#8203;000,&#8203;000,&#8203;000,&#8203;000,&#8203;000,&#8203;000,&#8203;000,&#8203;000,&#8203;000 Jahre.

source: I think we can stop trying, don’t you? I don’t think buying a faster computer will help, either. Even if we had 1 trillion computers and ran them concurrently, it would take about 3 × 10^49^ years.
de_de: Ich glaube wir können aufhören, es zu versuchen, oder? Ich glaube nicht, dass es helfen würde, einen schnelleren Computer zu kaufen. Selbst wenn wir 1 Billion Computer hätten und sie alle gleichzeitig laufen würden, würde es noch 3 × 10^49^ Jahre dauern.

source: Pre-image resistance, second-pre-image resistance, and collision resistance are extremely important in Bitcoin. Most of its security relies on these properties.
de_de: Pre-Image-Resistenz, Zweit-Pre-Image-Resistenz und Kollisionsresistenz sind in Bitcoin extrem wichtig. Der Grossteil von Bitcoins Sicherheit beruht auf diesen Eigenschaften.

source: Some well-known hash functions
de_de: Einige wohlbekannte Hashfunktionen

source: Double SHA256
de_de: Doppel-SHA256

source: We most often use double SHA256 in Bitcoin:
de_de: Wir benutzen in Bitcoin am häufigsten Doppel-SHA256:

source: <<tab0204>> shows several different cryptographic hash functions. Some aren’t considered cryptographically secure.
de_de: <<tab0204>> zeigt verschiedene kryptografische Hashfunktionen. Einige gelten als nicht kryptografisch sicher.

source: A few cryptographic hash functions. Some old ones have been deemed insecure.
de_de: Ein paar kryptografische Hashfunktionen. Einige der älteren gelten als unsicher.

source: | Name | Bits | Secure so far? | Used in Bitcoin? | SHA256 | 256 | Yes | Yes | SHA512 | 512 | Yes | Yes, in some wallets | RIPEMD160 | 160 | Yes | Yes | SHA-1 | 160 | No. A collision has been found. | No | MD5 | 128 | No. Collisions can be trivially created. The algorithm is also vulnerable to pre-image attacks, but not trivially. |No
de_de: | Name | Bits | Bisher sicher? | In Bitcoin verwendet? | SHA256 | 256 | Ja | Ja | SHA512 | 512 | Ja | Ja, in manchen Wallets | RIPEMD160 | 160 | Ja | Ja | SHA-1 | 160 | Nein. Eine Kollision ist bekannt. | Nein | MD5 | 128 | Nein. Kollisionen können einfach erzeugt werden. Der Algorithmus ist auch empfänglich für Pre-Image-Attacken, allerdings nicht für triviale. |Nein

source: Generally, when a single collision has been found in a cryptographic hash function, most cryptographers will consider the function insecure.
de_de: Ganz allgemein, wenn eine einzige Kollision in einer kryptografischen Hashfunktion entdeckt wurde, werden die meisten Kryptografen diese Funktion als unsicher betrachten.

source: Recap of cryptographic hashes
de_de: Zusammenfassung über kryptografische Hashes

source: A cryptographic hash function is a computer program that takes any data as input and computes a big number—a cryptographic hash—based on that input.
de_de: Eine kryptografische Hashfunktion ist ein Computerprogramm, das beliebige Daten als Input nimmt und eine grosse Zahl berechnet–einen kryptografischen Hash–, der aus dem Input hervorgeht.

source: It’s astronomically hard to find an input that will result in a specific output. This is why we call it a _one-way function_. You have to repeatedly guess different inputs.
de_de: Es ist astronomisch schwierig, einen Input zu finden, der zu einem bestimmten Output führt. Deswegen nennen wir sie _Einbahnfunktionen_. Man muss immer wieder mit unterschiedlichen Inputs probieren.

source: We’ll discuss important topics throughout this book. When you’ve learned about a specific topic, like cryptographic hash functions, you can put a new tool into your toolbox for later use. Your first tool is the cryptographic hash function, which is represented here by a paper shredder; the cryptographic hash is represented by a pile of paper strips.
de_de: Wir diskutieren wichtige Themen im ganzen Buch. Wenn du ein bestimmtes Thema gelernt hast, wie kryptografische Hashfunktionen, dann kannst du dieses Werkzeug für später in deine Werkzeugkiste legen. Dein erstes Werkzeug sind kryptografische Hashfunktionen, die hier durch einen Papierschredder dargestellt werden; der kryptografische Hash wird als ein Haufen Papierstreifen dargestellt.

source: From now on, we’ll use these tool icons to represent cryptographic hash functions and cryptographic hashes, with some exceptions.
de_de: Von nun an werden wir diese Werkzeug-Icons benutzen, um kryptografische Hashfunktionen und kryptografische Hashes darzustellen, mit wenigen Ausnahmen.

source: Exercises
de_de: Übungen

source: Warm up
de_de: Wärm dich auf

source: How many bits is the output of SHA256?
de_de: Aus wie vielen Bits besteht der Output von SHA256?

source: How many bytes is the output of SHA256?
de_de: Aus wie vielen Bytes besteht der Output von SHA256?
