Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: Not only does address reuse degrade the security of your private keys, it also degrades your privacy, as discussed in <<ch03>>. Suppose again that John has other outputs to PKH~1~. If Acme Insurances forces the cafe to reveal that it was John who bought the cookie, Acme would also know that all outputs to PKH~1~ belong to John. This goes for change outputs, too.
de_de: Nicht nur verringert Adressen-Wiederbenutzung die Sicherheit deines private Keys. Es verschlechtert auch deine Privacy, wie in <<ch03>> diskutiert. Nimm nochmal an, dass John weitere Output auf PKH~1~ hat. Wenn die Acme Versicherung das Café zwingt zu sagen, dass es John war, der den Keks gekauft hatte, dann wüsste Acme auch, dass alle Output an PKH~1~ John gehören. Dasselbe gilt für Change Outputs.

source: Luckily, the wallets will automate key creation for you, so you usually don’t have to worry about key reuse. Most Bitcoin wallets on the market today use unique addresses for all incoming payments.
de_de: Glücklicherweise automatisieren die Wallets die Key Generierung für dich, sodass man sich normalerweise keine Sorgen um Key Wiederverwendung machen muss. Die meisten Bitcoin Wallets, die heute auf dem Markt sind, benutzen Einweg-Adressen für alle eingehenden Zahlungen.

source: Account-based and value-based systems
de_de: Kontenbasierte und wertbasierte Systeme

source: Let’s reflect on the changes we’ve made. We’ve moved from an _account-based_ system to a _value-based_ system.
de_de: Reflektieren wir nochmal über die Änderungen, die wir gemacht haben. Wir sind von einem _kontenbasierten_ System zu einem _wertbasierten_ System übergegangen.

source: An account-based system keeps track of how much money each account has. This is the type of system we had before this chapter. Lisa had to calculate the balance of a PKH before deciding whether to allow a payment.
de_de: Ein kontenbasiertes System führt Buch darüber, wie viel Geld auf jedem Konto liegt. Diesen Typ von System hatten wir vor diesem Kapitel. Lisa musste das Saldo einer PKH ausrechnen, bevor sie entschied, ob eine Zahlung durchgeht oder nicht.

source: A value-based system keeps track of “coins” instead. In this chapter, Lisa needs to verify that the specific coins (UTXOs) exist before deciding whether to allow the payment. She doesn’t have to verify the balance of any PKH. Bitcoin is also a value-based system.
de_de: Ein wertbasiertes System verfolgt stattdessen “Coins”. In diesem Kapitel muss Lisa sicherstellen, dass spezielle Coins (UTXOs) existieren, bevor sie entscheidet, eine Zahlung zuzulassen. Sie braucht nicht den Kontostand irgendwelcher PKHs zu ermitteln. Bitcoin ist ebenfalls ein wertbasiertes System.

source: I haven’t been totally honest about what a transaction contains. A transaction’s output doesn’t contain a PKH, but part of a small computer program that _contains_ a PKH. This part of the program is called a _pubkey script_. The input that spends the output contains the other part of this program. This other part, the signature and the public key in John’s transaction, is called a _signature script_ (<<fig0511>>).
de_de: Ich war nicht ganz ehrlich mit dem, was in einer Transaktion enthalten ist. Ein Transaktions-Output enthält keinen PKH, sondern einen Teil eines Computerprogramms, das den PKH _enthält_. Dieser Teil des Programms wird als _Pubkey Script_ bezeichnet. Der Input, der den Output ausgibt, enthält den anderen Teil dieses Programmes. Dieser andere Teil, die Signatur und der public Key in Johns Transaktion, heisst das _Signature Script_ (<<fig0511>>).

source: The signature script is the first part of a program. The pubkey script in the spent output is the second part. If the complete program results in `OK`, then the payment is authorized to spend the output.
de_de: Die Signatur ist der vordere Teil eines Programms. Das Pubkey Script im ausgegebenen Output ist der hintere Teil. Wenn der Ablauf des gesamten Programms `OK` ergibt, dann ist die Zahlung autorisiert und darf den Output verwenden.

source: This tiny program, written in a programming language called Script, contains the instructions to Lisa on how to verify that the spending transaction is authentic. If Lisa performs all the instructions in the program without errors, and the end result is `OK`, then the transaction is authentic.
de_de: Dieses winzige Programm, in einer Programmiersprache namens _Script_ geschrieben, enthält die Befehle für Lisa dazu, wie sie verifizieren kann, dass die ausgebende Transaktion authentisch ist. Wenn Lisa alle Instruktionen in dem Programm fehlerfrei ausführt und das Endergebnis ist `OK`, dann ist die Transaktion authentisch.

source: The ability to write a computer program inside a transaction is useful for various use cases. We’ll cover several use cases of customized programs throughout this book.
de_de: Die Fähigkeit, ein Computerprogramm innerhalb einer Transaktion zu schreiben, ist für verschiedene Anwendungsfälle nützlich. Wir werden diverse Fälle von massgeschneiderten Programmen im Laufe dieses Buches besprechen.

source: Suppose Lisa wants to verify input 0 of John’s transaction. She’ll run this program from top to bottom. A _stack_ is used to keep track of intermediate calculation results. This stack is like a pile of stuff. You can add stuff on top of the stack, and you can take stuff off the top.
de_de: Angenommen, Lisa möchte Input 0 von Johns Transaktion verifizieren. Sie wird dazu das Programm von oben nach unten durchlaufen lassen. Dabei wird ein _Stack_ oder Stapelspeicher benutzt, um die Zwischenergebnisse zu verwalten. Dieser Stack ist wie ein Stapel Zeug. Man kann oben etwas drauflegen oder von oben etwas wegnehmen.

source: Let’s start: look at <<fig0512>>. The first (top) item in the program is a signature, which is just data. When you encounter ordinary data, you’ll put it on the stack. Lisa puts the signature on the previously empty stack. Then she encounters a public key, which is also just data. She puts that on the stack as well. The stack now contains a signature and a public key, with the public key on top.
de_de: Fangen wir an: schaue dir <<fig0512>> an. Das erste (Top) Element in dem Programm ist eine Signatur, was einfach nur Daten sind. Wenn du normalen Daten begegnest, dann tust du sie oben auf den Stack. Lisa legt die Signatur auf den anderweitig leeren Stack. Dann sieht sie einen public Key, was auch nur Daten sind. Sie tut den ebenfalls auf den Stack. Der Stack enthält jetzt eine Signatur und einen public Key, mit dem public Key oben.

source: Adding a signature and a public key to the stack
de_de: Hinzufügen einer Signatur und eines public Key auf den Stack

source: The next item in the program is `OP_DUP` (<<fig0513>>). This isn’t just data—this is an operator. An operator makes calculations based on items on the stack and, in some cases, the transaction being verified. This specific operator is simple: it means “Copy the top item on the stack (but keep it on the stack), and put the copy on top.” Lisa follows orders and copies the public key on the stack. You now have two public keys and a signature on the stack.
de_de: Das nächste Element im Programm ist `OP_DUP` (<<fig0513>>). Das sind jetzt nicht nur Daten–das ist ein Operator. Ein Operator führt Berechnungen durch auf Basis der Elemente auf dem Stack und, in manchen Fällen, der zu verifizierenden Transaktion. Dieser spezielle Operator ist einfach: er sagt “Kopiere das oberste Element auf dem Stack (aber lasse es dort liegen), und lege die Kopie obendrauf”. Lisa befolgt den Befehl und kopiert den public Key auf dem Stack. Jetzt liegen zwei public Keys und eine Signatur auf dem Stack.

source: Copying the public key on the stack, and adding a PKH
de_de: Kopieren des public Key auf dem Stack und Hinzufügen eines PKH

source: The next item is also an operator, `OP_HASH160` (also shown in <<fig0513>>). This means “Take the top item off the stack and hash it using SHA256+RIPEMD160, and put the result on the stack.”
de_de: Das nächste Element ist ebenfalls ein Operator, `OP_HASH160` (auch dargestellt in <<fig0513>>). Dies bedeutet “Nimm das oberste Element vom Stack herunter, berechne dessen Hash mittels SHA256+RIPEMD160, und lege das Ergebnis wieder auf den Stack.”

source: Cool. Lisa takes the top public key from the stack, hashes it, and puts the resulting PKH on top of the stack. This happens to be John’s PKH~1~ because it was John’s public key that Lisa hashed.
de_de: Cool. Lisa nimmt den oberen public Key vom Stack, hasht ihn und legt den resultierenden PKH oben auf den Stack. Das ist natürlich gerade Johns PKH~1~, weil es ja Johns public Key war, den Lisa gehasht hat.

source: The next item is just data (<<fig0514>>): it’s PKH~1~, which is the rightful recipient of the 8 CT. Lisa puts PKH~1~ on the stack.
de_de: Das nächste Element ist wieder nur Daten (<<fig0514>>): es ist PKH~1~, was der rechtmässige Empfänger der 8 CT ist. Lisa legt PKH~1~ auf den Stack.

source: Adding PKH~1~ to the stack and comparing the two PKH items
de_de: Ablegen von PKH~1~ auf dem Stack und Vergleich der beiden PKH Elemente

source: Next up is another operator, `OP_EQUALVERIFY`. This means “Take the top two items from the stack and compare them. If they’re equal, continue to the next program instruction; otherwise, quit the program with an error.” Lisa takes the two PKH items from the top of the stack and verifies that they’re equal. They _are_ equal, which means the public key John has provided in his transaction’s signature script matches the PKH that was set as the recipient in the output.
de_de: Als Nächstes kommt ein weiterer Operator, `OP_EQUALVERIFY`. Das bedeutet “Nimm die beiden obersten Elemente vom Stack und vergleiche sie miteinander. Wenn sie gleich sind, dann fahre beim nächsten Element mit dem Programm fort; ansonsten brich das Programm mit einem Fehler ab.” Lisa nimmt die beiden PKH Elemente von der Spitze des Stacks und prüft, ob sie identisch sind. Sie _sind_ identisch, was bedeutet, der public Key, den John im Signature Script seiner Transaktion mitgeliefert hatte passt zu dem PKH, der als Empfänger im Output gesetzt worden war.

source: Verifying the signature using John’s transaction and the rest of the items from the stack
de_de: Prüfung der Signatur unter Benutzung von Johns Transaktion und dem Rest der Elemente auf dem Stack.

source: John’s cleaned transaction
de_de: Johns bereinigte Transaktion

source: The last operator, `OP_CHECKSIG` (<<fig0515>>), means “Verify that the top public key on the stack and the signature that’s next on the stack correctly sign the transaction. Put `true` or `false` on top of the stack depending on the verification outcome.” Lisa takes John’s transaction and cleans out all the signature script from all inputs. She uses the top two items from the stack, which are John’s public key and his signature, to verify that the signature signs the cleaned transaction. When John signed this transaction, he did so without any signature data in the inputs. This is why Lisa must first clean out the signature script data from the transaction before verifying the signature. The signature was good, so Lisa puts `true`, meaning `OK`, back on the stack.
de_de: Der letzte Operator, `OP_CHECKSIG` (<<fig0515>>), bedeutet “Verifiziere, dass der public Key oben auf dem Stack und die Signatur darunter die Transaktion korrekt signieren. Lege `true` oder `false` oben auf den Stack, abhängig vom Ergebnis der Verifikation.” Lisa nimmt Johns Transaktion und löscht alle Signaturen aus allen Inputs. Sie benutzt die beiden obersten Objekte, was Johns public Key und seine Signatur sind, um zu verifizieren, dass die Signatur die bereinigte Transaktion signiert. Als John seine Transaktion signierte, hat er das ohne Signaturdaten in den Inputs getan. Deshalb muss Lisa erstmal die Signatur-Scriptdaten aus der Transaktion entfernen, bevor sie die Transaktion verifiziert. Die Signatur war in Ordnung, also legt Lisa `true`, was so viel heisst wie `OK´, zurück auf den Stack.

source: Look, the program is empty! Nothing is left to do. After running a program, the top item on the stack reveals whether the spending of the output is authentic. If `true`—`OK`—then the spending is authorized. If `false`—`not OK`—then the transaction must be declined. Lisa looks at the top item on the stack, and there’s an `OK`. Lisa now knows that John’s input with index 0 is good (<<fig0516>>).
de_de: Schau, das Programm ist jetzt leer! Es gibt nichts mehr zu tun. Nachdem das Programm durchgelaufen ist, enthüllt das oberste Element auf dem Stack, ob das Ausgeben des Outputs authentisch ist. Wenn `true`–`OK`–dann ist das Ausgeben autorisiert. Wenn `false`–`nicht OK`– dann muss die Transaktion abgewiesen werden. Lisa schaut auf das oberste Stack-Element, und das ist ein `OK`. Lisa weiss jetzt, dass Johns Input mit Index 0 in Ordnung ist (<<fig0516>>).

source: The first input is verified.
de_de: Der erste Input wird geprüft.

source: Lisa does the same checks for the other input, with index 1, of John’s transaction. If this program also ends with `OK`, then the entire transaction is valid, and she can add the transaction to the spreadsheet.
de_de: Lisa führt dieselben Checks für den anderen Input von Johns Transaktion durch, den mit Index 1. Wenn dieses Programm ebenfalls mit `OK` endet, dann ist die Transaktion gültig und sie kann die Transaktion an das Ende des Spreadsheets hängen.

source: Why use a program?
de_de: Warum ein Programm benutzen?

source: The pubkey script part of the program stipulates exactly what the spending transaction needs to provide to spend the output. The only way to spend an output is to provide a signature script that makes the program finish with an OK on top of the stack.
de_de: Der Pubkey Script Teil des Programmes schreibt vor, was die ausgebende Transaktion genau liefern muss, um einen Output auszugeben. Die einzige Methode, einen Output auszugeben ist, ein Signatur Script zu liefern, das für einen fehlerfreien Programmdurchlauf sorgt, bei dem am Ende ein `OK` auf dem Stack liegt.

source: In the example I just presented, the only acceptable signature script is a valid signature followed by the public key corresponding to the PKH in the pubkey script.
de_de: In dem Beispiel, das ich gerade präsentiert habe, ist das einzige akzeptable Signatur Script eine gültige Signatur, gefolgt von dem public Key, der mit dem PKH im Pubkey Script korrespondiert.

source: Operators
de_de: Operatoren

source: A lot of useful operators can be used to create all kinds of fancy programs. Check out <<web-op-codes>> for a complete list.
de_de: Eine Menge nützlicher Operatoren können verwendet werden, um allerlei originelle Programme zu schreiben. Schau dir die komplette Liste an unter <<web-op-codes>>.

source: Using a programming language, Script, in the transactions makes them very flexible. You’ll see several different types of Script programs throughout this book. If the transactions didn’t use a programming language, all use cases would have to be invented up front. The Script language lets people come up with new use cases as they please.
de_de: Eine Programmiersprache, Script, in den Transaktionen zu benutzen macht diese sehr flexibel. Du wirst mehrere verschiedene Typen von Script Programmen in diesem Buch zu sehen bekommen. Wenn die Transaktionen keine Programmiersprache benutzen würden, hätten alle Anwendungsfälle schon vorab erfunden werden müssen. Die Script Sprache lässt einen später nach Bedarf neue Anwendungsfälle einrichten.

source: I’ve already mentioned that “pay to PKH” isn’t the only way to pay. You can write any program in the pubkey script. For example, you can write a pubkey script that ends with `OK` only if the signature script provides two numbers whose sum is 10. Or, you can write a program that ends with `OK` only if the signature script contains the SHA256 pre-image of a hash. Consider this example:
de_de: Ich habe bereits erwähnt, dass “pay to PKH” nicht die einzige Art zu zahlen ist. Man kann in einem Pubkey Script beliebige Programme schreiben. Zum Beispiel kann man ein Pubkey Script schreiben, das mit `OK` nur dann endet, wenn das Signatur Script zwei Zahlen enthält, deren Summe 10 ist. Oder ein Programm, das nur dann mit `OK` endet, wenn das Signatur Script das SHA256 Pre-Image eines Hashes enthält. Schau dir folgendes Beispiel an:

source: This will allow anyone who knows an input to SHA256 that results in the hash `334d016f…d42c87b7` to spend the output. You happen to know from <<ch02>> that the text “Hello!” will give this specific output. Suppose your signature script is
de_de: Dies gestattet jedem das Ausgeben des Outputs, der einen Input für SHA256 liefert, der als Hashwert `334d016f…d42c87b7` liefert. Du weisst zufälligerweise aus <<ch02>>, der Text "Hello!" genau diesen Wert erzeugt. Angenommen, dein Signatur Script ist

source: Run the program to convince yourself that it works and that all signature scripts that don’t contain a correct pre-image fail.
de_de: Lass das Programm laufen um dich zu vergewissern, dass es funktioniert und dass alle Signatur Scripts, die kein korrektes Pre-Image enthalten, scheitern.

source: Why signature script and pubkey script?
de_de: Weshalb Signatur Script und Pubkey Script?

source: Odd names
de_de: Merkwürdige Namen

source: Bitcoin developers commonly use the term _scriptPubKey_ for the pubkey script and _scriptSig_ for the signature script because that’s how they’re named in the Bitcoin Core source code.
de_de: Bitcoin Entwickler benutzen oft den Term _scriptPubKey_ für das Pubkey Script und _scriptSig_ für das Signatur Script, weil diese im Bitcoin Core Quellcode so heissen.

source: You might wonder why we call the output script part _pubkey script_ when it usually doesn’t contain a public key. Likewise, the input script is called _signature script_, but it doesn’t only contain a signature.
de_de: Du fragst dich vielleicht, warum wir den Output Script Teil _Pubkey Script_ nennen, obwohl es doch keinen public Key enthält. Und ebenso, warum das Input Script _Signatur Script_ heisst, obwohl es nicht nur aus einer Signatur besteht.

source: The pubkey script in Bitcoin transactions used to contain an actual public key, and the signature script used to contain the signature only. It was more straightforward then. A typical pubkey script looked like this
de_de: Das Pubkey Script in Bitcoin Transaktionen enthielt früher einen richtigen public Key, und das Signatur Script bestand nur aus der Signatur. Damals war es einfacher. Ein typisches Pubkey Script sah so aus

source: and the signature script like this:
de_de: und das Signature Script so:

source: Things have changed since then, but the names _signature script_ and _pubkey script_ remain. Most developers today look at this more abstractly: the pubkey script can be regarded as a public key, and the signature script can be regarded as a signature, but not necessarily ordinary public keys and signatures. In a normal payment today, the “public key” is the script that needs to be satisfied by the “signature,” the signature script. Of course, the “public key” here contains some operators and a PKH, but we can still view it as a public key on a conceptual level. The same goes for the signature script, which we can view as a signature on a conceptual level.
de_de: Die Dinge haben sich seitdem verändert, aber die Namen _Signatur Script_ und _Pubkey Script_ sind geblieben. Die meisten Entwickler betrachten das Ganze abstrakter: man kann das Pubkey Script als public Key betrachten und das Signatur Script als Signatur, aber nicht notwendigerweise als normale public Keys und Signaturen. In einer normalen Zahlung heute ist der "public Key" das Script, das durch die "Signatur" erfüllt werden muss, das Signatur Script. Natürlich enthält hier der "public Key" einige Operatoren und einen PKH, aber wir können ihn konzeptionell immer noch als public Key betrachten. Das gleiche gilt für das Signatur Script, das wir konzeptionell als Signatur betrachten können.

source: This chapter covers most aspects of transactions. <<fig0517>> is a reminder from <<ch01>> of how a typical transaction is sent.
de_de: Dieses Kapitel beleuchtet die meisten Aspekte von Transaktionen. <<fig0517>> ist ein Rückverweis aus <<ch01>> darüber, wie eine typische Transaktion gesendet wird.

source: We’ve gone through the anatomy of the transaction and are now discussing different ways to authenticate, or “sign,” transactions.
de_de: Wir sind durch die Anatomie einer Transaktion durchgegangen und diskutieren jetzt verschiedene Wege, Transaktionen zu authentisieren oder "signieren".

source: This chapter covers transactions. Right now, we’re exploring different ways to authenticate transactions.
de_de: Dieses Kapitel betrachtet Transaktionen. Im Moment erforschen wir verschiedene Wege, Transaktionen zu authentisieren.

source: Fancy payment types
de_de: Einfallsreiche Zahlungsweisen

source: Pay to hash
de_de: Zahlung an Hash, pay to hash

source: John’s transaction just spent two _pay-to-public-key-hash_ (p2pkh) outputs. But as noted earlier, other payment types are possible—for example, pay-to-hash, where you pay to a SHA256 hash. To spend this output, you need to provide the hash’s pre-image in the spending input’s signature script. We’ll explore some more interesting and useful ways to authenticate transactions.
de_de: Johns Transaktion hat gerade zwei _pay-to-public-key-hash_ (p2pkh) Outputs ausgegeben. Aber wie vorher erwähnt, gibt es auch andere Arten zu zahlen–zum Beispiel pay-to-hash, wobei man an einen SHA256 Hash bezahlt. Um einen solchen Output auszugeben, muss man das Pre-Image des Hashes im Signatur Script des ausgebenden Inputs mitliefern. Wir untersuchen noch einige weitere interessante und nützliche Wege, Transaktionen zu authentisieren.

source: Multiple signatures
de_de: Mehrere Signaturen, multiple signatures

source: In p2pkh, the recipient generates a cookie token address that’s handed over to the sender. The sender then makes a payment to that address.
de_de: In p2pkh erzeugt der Empfänger eine Cookie Token Adresse, die dem Sender übergeben wird. Der Sender zahlt dann an diese Adresse.

source: But what if the recipient would like their money secured by something other than a single private key? Suppose Faiza, Ellen, and John want to raise money for charity from their coworkers.
de_de: Aber was, wenn der Empfänger sein Geld lieber mit etwas anderem absichern will als mit einem einfachen private Key? Angenommen Faiza, Ellen und John wollen Spenden von ihren Kollegen für einen guten Zweck sammeln.

source: They could use a normal p2pkh address that their supporters donate cookie tokens to. They could let, say, Faiza have control over the private key, so only she could spend the funds. This approach has a few problems:
de_de: Sie könnten eine normale p2pkh Adresse benutzen, an die die Spender zahlen würden. Sie könnten dann zum Beispiel Faiza den private Key geben, sadass nur sie das Geld ausgeben könnte. Dieser Ansatz hat ein paar Probleme:

source: If Faiza dies, the money might be lost forever. Ellen and John won’t be able to recover the funds.
de_de: Wenn Faiza sterben würde, wäre das Geld für immer verloren. Ellen und John könnten nicht über die Spenden verfügen.

source: If Faiza is sloppy with backup, the money might get lost. Again, no one will be able to recover the funds.
de_de: Wenn Faiza unvorsichtig mit ihrem Backup ist, könnte das Geld verlorengehen. Wieder wird niemand in der Lage sein, das Geld zu verwenden.

source: If Faiza is sloppy with her private key security, the money might get stolen.
de_de: Wenn Faiza mit dem private Key unvorsichtig ist, könnte das Geld gestohlen werden.

source: Faiza might run away with the money.
de_de: Faiza könnte mit dem Geld abhauen.
