Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: Let’s zoom in a bit on what’s happening. Suppose you want to sign a transaction with two inputs. The first input is signed as illustrated in <<fig1005>>.
de_de: Zoomen wir ein bisschen in das hinein, was da vor sich geht. Nimm an, du willst eine Transaktion mit zwei Inputs signieren. Der erste Input wird signiert wie in <<fig1005>> dargestellt.

source: Signing the first input. You prepare by copying the pubkey script to the signature script.
de_de: Signieren des ersten Inputs. Du bereitest es durch Kopieren des Pubkey Scripts in das Signatur Script vor.

source: The signature scripts of all inputs are empty, but you copy the pubkey script of the spent output and insert it into the signature script of the spending input. You then create the signature for the first input and move on to sign the second input (<<fig1006>>).
de_de: Die Signatur Scripts aller Inputs sind leer, aber du kopierst das Pubkey Script des ausgegebenen Outputs und fügst es in das Signatur Script des ausgebenden Inputs ein. Dann erzeugst du die Signatur für den ersten Input und machst mit dem zweiten Input weiter (<<fig1006>>).

source: Signing the second input
de_de: Signieren des zweiten Inputs

source: Here, all signature scripts except the second one are empty. The second signature script is populated with the spent output’s pubkey script. The signature is then created.
de_de: Hier sind alle Signatur Scripts ausser dem zweiten leer. Das zweite Signatur Script wird mit dem Pubkey Script des ausgegebenen Outputs gefüllt. Dann wird die Signatur erstellt.

source: By doing this exercise for each input, you ensure that signatures aren’t reusable across inputs if signed by the same private key. But this also introduces a problem: signature verification becomes inefficient.
de_de: Indem man diese Übung für alle Inputs durchführt, stellt man sicher, dass Signaturen nicht für andere Inputs wiederverwendbar sind, auch wenn sie vom selben private Key signiert wurden. Aber das führt auch ein neues Problem ein: Signaturverifikation wird ineffizient.

source: Suppose you want to verify the signatures of the aforementioned transaction. For every input, you need to perform basically the same procedure as when the transaction was signed: clean all the signature scripts from the transaction and then, one at a time, insert the pubkey script in the signature script of the input you want to verify. Then, verify the signature for that input.
de_de: Angenommen du willst die Signaturen der oben genannten Transaktion verifizieren. Dann musst du im Grunde für jeden Input dasselbe Vorgehen abarbeiten wie als die Transaktion signiert wurde: alle Signatur Scripts aus der Transaktion bereinigen und dann, eins nach dem anderen, die Pubkey Scripts in das Signatur Script des Inputs, den du verifizieren willst, einfügen. Und danach die Signatur für diesen Input verifizieren.

source: This might seem harmless, but as the number of inputs grows, the amount of data to hash for each signature increases. If you double the number of inputs, you roughly
de_de: Das mag harmlos erscheinen, aber wenn die Anzahl Inputs zunimmt, wächst die Menge an Daten, die für jede Signatur gehasht werden müssen. Wenn du die Anzahl Inputs verdoppelst wirst du grob

source: Double the number of signatures to verify
de_de: Die Anzahl an Signaturen verdoppeln

source: Double the size of the transaction
de_de: Die Grösse der Transaktion verdoppeln

source: Why 1 ms?
de_de: Warum 1 ms?

source: The 1 ms time is just an example. The actual time to verify a transaction varies among nodes.
de_de: Die Zeit von 1 ms ist nur ein Beispiel. Die eigentliche Zeit zur Verifikation einer Transaktion variiert von Node zu Node.

source: If the time to verify the transaction with two inputs in <<fig1007>> is 1 ms, it will take 4 ms to verify a transaction with four inputs. Double the number of inputs again, and you have 16 ms. A transaction with 1,024 inputs would take more than 4 minutes!
de_de: Wenn die Zeit zur Verifikation der Transaktion mit zwei Inputs in <<fig1007>> 1 ms beträgt, dann dauert es 4 ms um eine Transaktion mit vier Inputs zu verifizieren. Verdopple die Anzahl Inputs erneut, und du bekommst 16 ms. Eine Transaktion mit 1.024 Inputs würde über 4 Minuten brauchen!

source: Total time for hashing during signature verification. Time roughly quadruples when the number of inputs doubles.
de_de: Gesamtdauer zum Hashen während der Signaturverifikation. Die Zeit vervierfacht sich etwa, wenn sich die Anzahl Inputs verdoppelt.

source: This weakness can be exploited by creating a large transaction with a lot of inputs. All nodes verifying the transaction will be occupied for minutes, making them unable to verify other transactions and blocks during this time. The Bitcoin network as a whole would slow down.
de_de: Diese Schwäche kann ausgenutzt werden, indem eine grosse Transaktion mit einer Menge Inputs erzeugt wird. Alle Nodes, die verifizieren, werden minutenlang blockiert, wodurch sie während dieser Zeit nicht mehr in der Lage sind, andere Transaktionen und Blocks zu verifizieren. Das Bitcoin Netzwerk als Ganzes verlangsamt sich dadurch.

source: It would be much better if the transaction verification time grew linearly instead of quadratically: the time to verify a transaction would double as the number of inputs doubled. Then, the 1,024 inputs would take roughly 512 ms to verify instead of 4 minutes.
de_de: Es wäre viel besser, wenn die Transaktions-Verifikationszeit linear wachsen würde statt quadratisch.: die Zeit zur Verifikation einer Transaktion würde sich verdoppeln, wenn sich die Anzahl Inputs verdoppelt. Dann würde es nur ungefähr 512 ms dauern, die 1024 Inputs zu verifizieren, anstatt 4 Minuten.

source: Waste of bandwidth
de_de: Bandbreitenverschwendung

source: When a full node sends a transaction to a lightweight wallet, it sends the complete transaction, which includes all signature data. But a lightweight wallet can’t verify the signatures because it doesn’t have the spent outputs.
de_de: Wenn ein Full Node eine Transaktion an ein Lightweight Wallet sendet, schickt er die komplette Transaktion, die alle Signaturdaten enthält. Aber ein Lightweight Wallet kann die Signaturen nicht verifizieren, weil es die ausgegebenen Outputs nicht kennt.

source: The signature scripts constitute a large percentage of the transaction size. A typical signature script spending a p2pkh output takes 107 bytes. Consider a few different transactions with two outputs, as <<tab1001>> shows.
de_de: Die Signatur Scripts machen einen erheblichen Teil der Transaktionsgrösse aus. Ein typisches Signatur Script, das einen p2pkh ausgibt, belegt 107 Bytes. Betrachten wir ein par verschiedene Transaktionen mit zwei Outputs, wie in <<tab1001>> gezeigt.

source: Space occupied by signature script data of different typical transactions
de_de: Durch Signatur Script Daten belegter Platz verschiedener typischer Transaktionen

source: | Inputs | Total signature script size (bytes) | Tx size (bytes) | Signature script percentage | 1 | 107 | 224 | 47% | 2 | 214 | 373 | 57% | 3 | 321 | 521 | 61% | 8 | 856 | 1255 | 68%
de_de: | Inputs | Gesamte Signatur Script Grösse (Bytes) | Tx Grösse (Bytes) | Relativer Signatur Script Anteil | 1 | 107 | 224 | 47% | 2 | 214 | 373 | 57% | 3 | 321 | 521 | 61% | 8 | 856 | 1255 | 68%

source: Wouldn’t it be nice if a full node didn’t have to send the signature script data to the lightweight wallet? You’d probably save more than 50% data traffic. There’s just one problem: such data is needed to calculate txids. If you skip sending signature scripts of transactions, the lightweight wallet won’t be able to verify that the transaction is included in a block because it can’t verify the merkle proof (<<fig1008>>).
de_de: Wäre es nicht schön, wenn ein Full Node nicht die Signatur Script Daten an das Lightweight Wallet schicken müsste? Du würdest vermutlich über 50% an Datenvolumen einsparen. Es gibt nur ein Problem: diese Daten werden benötigt, um die txids zu berechnen. Wenn du das Senden von Signatur Scripts von Transaktionen überspringst, kann das Lightweight Wallet nicht mehr verifizieren, dass die Transaktion im Block enthalten ist, weil sie den Merkle Proof nicht verifizieren kann (<<fig1008>>).

source: Without the signature scripts, a lightweight wallet can’t verify that a transaction is included in the block.
de_de: Ohne die Signatur Scripts könnte das Lightweight Wallet nicht verifizieren, dass sich die Transaktion im Block befindet.

source: We’d definitely like to solve this somehow.
de_de: Wir würden das wirklich gerne irgendwie lösen.

source: Script upgrades are hard
de_de: Script Upgrades sind schwer

source: Sometimes, we want to extend the script language with new operations. For example, `OP_CHECKSEQUENCEVERIFY` (`OP_CSV`) and `OP_CHECKLOCKTIMEVERIFY` (`OP_CLTV`) were introduced in the language in 2015 and 2016. Let’s look at how `OP_CLTV` was introduced.
de_de: Gelegentlich wollen wir die Script Sprache mit neuen Operationen erweitern. Zum Beispiel wurden `OP_CHECKSEQUENCEVERIFY` (`OP_CSV`) und `OP_CHECKLOCKTIMEVERIFY` (`OP_CLTV`) der Sprache 2015 and 2016 hinzugefügt. Schauen wir uns an, wie `OP_CLTV` eingeführt wurde.

source: We’ll start with what `OP_` codes are. They’re nothing but a single byte. `OP_EQUAL` for example, is represented by the byte `87` in hex code. Every node knows that when it encounters byte `87` in the script program, it needs to compare the top two items on the stack and push the result back on the stack. `OP_CHECKMULTISIG` is also a single byte, `ae`. All operators are represented by different bytes.
de_de: Wir beginnen damit, was `OP_` Codes sind. Sie sind nichts als ein einzelnes Byte. `OP_EQUAL` wird zum Beispiel durch den Hex Code `87` repräsentiert. Jeder Node weiss, dass er, wenn er Byte `87` im Script Programm sieht, die beiden obersten Elemente auf dem Stack vergleichen und das Ergebnis auf dem Stack ablegen muss. `OP_CHECKMULTISIG` ist auch nur ein einzelnes Byte, `ae`. Alle Operatoren werden durch verschiedene Bytes repräsentiert.

source: When Bitcoin was created, several NOP operators, `OP_NOP1`–`OP_NOP10`, were specified. These are represented by the bytes `b0`–`b9`. They’re designed to do nothing. The name NOP comes from No OPeration, which basically means, “When this instruction appears, ignore it and move on.”
de_de: Als Bitcoin erfunden wurde, wurden mehrere NOP Operatoren spezifiziert, `OP_NOP1`–`OP_NOP10`. Diese werden durch die Bytes `b0`–`b9` repräsentiert. Sie sind dafür gemacht, nichts zu tun. Der Name NOP kommt von No OPeration, was im Grunde bedeutet “Wenn diese Instruktion auftaucht, ignoriere sie und mach weiter.”

source: These NOPs can be used to extend the script language, but only to a certain extent. The `OP_CLTV` operator is actually `OP_NOP2`, or byte `b1`. `OP_CLTV` was introduced by releasing a version of Bitcoin Core that redefines how `OP_NOP2` works. But it needs to be done in a compatible way so we don’t break compatibility with old, non-upgraded nodes.
de_de: Diese NOPs können zur Erweiterung der Script Sprache verwendet werden. Der `OP_CLTV` Operator ist eigentlich `OP_NOP2`, oder Byte `b1`. `OP_CLTV` wurde durch Freigabe einer neuen Bitcoin Core Version eingeführt, die neu definiert, wie `OP_NOP2` funktioniert. Aber es musste auf eine kompatible Art geschehen, damit wir nicht die Kompatibilität mit alten, nicht aktualisierten Nodes kaputtmachen.

source: Let’s go back to the example from <<absolute-time-locked-outputs>>, where you gave your daughter an allowance in advance that she could cash out on 1 May (see <<fig1009>>).
de_de: Gehen wir zurück zum Beispiel von <<absolute-time-locked-outputs>>, wo wir deiner Tochter im voraus ein Taschengeld gegeben haben, das sie ab dem 1. Mai einlösen konnte (siehe <<fig1009>>).

source: Using `OP_CLTV` to lock an output until 1 May
de_de: Benutzung von `OP_CLTV`, um einen Output bis zum 1. Mai zu verriegeln.

source: The pubkey script for this output is
de_de: Das Pubkey Script für diesen Output ist

source: This is how a new node—which is aware of the new meaning of byte `b1`—interprets the script. It will do the following:
de_de: So interpretiert ein neuer Node–der die neue Bedeutung des Byte `b1` kennt–das Script. Er macht folgendes:

source: Push the time `<1 may 2019 00:00:00>` to the stack.
de_de: Legt die Zeit `<1 may 2019 00:00:00>` auf den Stack.

source: Check that the spending transaction’s lock time has at least the value found on top of the stack, or fail immediately otherwise.
de_de: Prüft, dass die Lock Time der ausgebenden Transaktion mindestens den Wert hat, der oben auf dem Stack liegt, oder bricht sonst sofort ab.

source: Drop the time value from the stack.
de_de: Nimmt den Zeitwert wieder vom Stack herunter.

source: Continue with normal signature verification.
de_de: Macht mit der normalen Signatur Verifikation weiter.

source: An old node, on the other hand, will interpret the script as follows:
de_de: Ein alter Node andererseits wird das Script wie folgt interpretieren:

source: It will
de_de: Er wird

source: _Do nothing._
de_de: _Nichts tun._

source: Old nodes still treat `OP_NOP2` as they used to—by doing nothing and moving on. They aren’t aware of the new rules associated with the byte `b1`.
de_de: ALte Nodes behandeln `OP_NOP2` wie bisher–indem sie nichts tun und weitermachen. Die wissen nichts von den neuen Regeln, die mit dem Byte `b1` assoziiert sind.

source: The old and the new nodes will behave the same if the `OP_CLTV` succeeds on the new node. But if the `OP_CLTV` fails on the new node, the old node won’t fail, because “do nothing” never fails. The new nodes fail more often than the old nodes because new nodes have stricter rules. The old nodes will always finish the script program with success whenever the new nodes finish with success. This is known as a _soft fork_—a system upgrade that doesn’t require all nodes to upgrade. We’ll talk more about forks, system upgrades, and alternate currencies born from Bitcoin’s blockchain in <<ch11>>.
de_de: Die alten und neuen Nodes werden sich gleich verhalten, wenn der `OP_CLTV` auf dem neuen Node gelingt. Aber wenn er auf dem neuen Node fehlschlägt, wird er das auf dem alten Node nicht tun, da "tu nichts" nie fehlschlägt. Die neuen Nodes schlagen häufiger fehl als die alten Nodes, weil die neuen Nodes strengeren Regeln folgen. Die alten Nodes beenden das Script immer erfolgreich, wenn die neuen Nodes das Script erfolgreich beenden. Dies wird als _Soft Fork_ bezeichnet_ein System Upgrade, das nicht von allen Nodes verlangt wird. Wir sprechen mehr über Forks, System Upgrades und alternative Währungen, die von Bitcoins Blockchain abstammen, in <<ch11>>.

source: You might be wondering what the `OP_DROP` instruction is for. `OP_DROP` takes the top item on the stack and discards it. `OP_CLTV` is designed to behave exactly like `OP_NOP2` when it succeeds. If `OP_CLTV` had been designed without taking old nodes into account, it would probably remove the top item from the stack. But because we need to take old nodes into account, `OP_CLTV` doesn’t do that. We must add the extra `OP_DROP` after `OP_CLTV` to get rid of the time item from the stack.
de_de: Du fragst dich vielleicht, wozu die `OP_DROP` Instruktion da ist. `OP_DROP` nimmt das oberste Element vom Stack und wirft es weg. `OP_CTLV` ist so gemacht, dass es sich genau wie `OP_NOP2` benimmt, wenn es erfolgreich ist. Wenn `OP_CTLV` ohne Rücksicht auf alte Nodes entworfen worden wäre, dann würde es vermutlich das oberste Element vom Stack nehmen. Aber weil wir an die anderen Nodes denken müssen, tut `OP_CTLV` dies nicht. Wir brauchen den zusätzlichen `OP_DROP` hinter `OP_CTLV`, um das oberste Element auf dem Stack loszuwerden.

source: This was an example of how old script operators can be repurposed to do something stricter without disrupting the entire network.
de_de: Dies war ein Beispiel dafür, wie alte Script Operatoren so umfunktioniert werden können, dass sie etwas Eingeschränkteres tun, ohne das ganze Netzwerk zu stören.

source: This method of script upgrades has been done for two operators so far:
de_de: Diese Methode für Script Upgrades wurde bis jetzt für zwei Operatoren verwendet:

source: | Byte | Old code | New code | New meaning | `b1` | `OP_NOP2` | `OP_CLTV` | Verify that the spending transaction has a high enough absolute lock time. | `b2` | `OP_NOP3` | `OP_CSV` | Verify that the spending input has a high enough relative lock time.
de_de: | Byte | Alter Code | Neuer Code | Neue Bedeutung | `b1` | `OP_NOP2` | `OP_CLTV` | Verifiziere, dass die ausgebende Transaktion eine ausreichend hohe absolute Lock Time hat. | `b2` | `OP_NOP3` | `OP_CSV` | Verifiziere, dass die ausgebende Transaktion eine ausreichend hohe relative Lock Time hat.

source: Only 10 `OP_NOP` operators are available to use for script upgrades, and such upgrades are limited to exactly mimic the `OP_NOP` behavior if they don’t fail.
de_de: Nur 10 `OP_NOP` Operatoren sind für Script Upgrades verfügbar, und solche Upgrades sind darauf beschränkt, im Erfolgsfalle genau das Verhalten von `OP_NOP` nachzubilden.

source: Sooner or later, we’ll need another script-upgrade mechanism, both because we’ll run out of ``OP_NOP``s and because we want the new script operators to behave differently than `OP_NOP` when they succeed.
de_de: Früher oder später werden wir einen weiteren Script Upgrade Mechanismus benötigen, sowohl weil wir irgendwann keine ``OP_NOP``s mehr haben als auch weil wir wollen, dass die neuen Script Operatoren sich anders benehmen als `OP_NOP`, wenn sie erfolgreich sind.

source: Solutions
de_de: Lösungen

source: A solution to all these problems was presented at a 2015 conference. The solution was to move the signature scripts out of transactions altogether.
de_de: Eine Lösung für all diese Probleme wurde 2015 auf einer Konferenz präsentiert. Die Lösung war, die Signatur Scripts komplett aus den Transaktionen herauszunehmen.

source: Let’s look again at the anatomy of a normal transaction, shown in <<fig1010>>.
de_de: Schauen wir uns nochmal die Anatomie einer normalen Transaktion an, wie in <<fig1010>> gezeigt.

source: The txid is calculated from the entire transaction, including signature scripts.
de_de: Die txid wird aus der gesamten Transaktion berechnet, einschliesslich der Signatur Scripts.

source: If we could change the system so the txid didn’t cover the signature script, we’d remove all known possibilities of unintentional transaction malleability. Unfortunately, if we did this, we’d make old software incompatible because it calculates the txid in the traditional way.
de_de: Wenn wir das System so ändern könnten, dass die txid nicht das Signatur Script beinhaltet, würden wir alle bekannten Möglichkeiten von unbeabsichtigter Transaktionsumformung eliminieren. Unglücklicherweise würden wir damit auch alte Software inkompatibel machen, weil diese die txid auf die herkömmliche Art berechnet.

source: The new rules defined by segregated witness are specified in BIP141, “Segregated Witness (Consensus layer).”
de_de: Die von Segregated Witness definierten neuen Regeln sind spezifiziert in BIP141, “Segregated Witness (Consensus layer).”

source: Segwit solves this problem and all the aforementioned problems in a forward- and backward-compatible way:
de_de: SegWit löst dieses Problem und alle vorher genannten Probleme auf vorwärts- und rückwärtskompatible Weise:

source: Forward-compatible because blocks created by new software work with old software
de_de: Vorwärtskompatibel, weil Blocks, die von der neuen Software erzeugt wurden, mit der alten Software funktionieren.

source: Backward-compatible because blocks created by old software work with new software
de_de: Rückwärtskompatibel, weil Blocks, die durch die alte Software erzeugt wurden, auf der neuen funktionieren.

source: In crypto-lingo, a _witness_ basically means a signature. It’s something that attests to the authenticity of something. For a Bitcoin transaction, the witness is the contents of the signature scripts, because that’s what proves the transaction is authenticated. _Segregated_ means parted, so we part the contents of the signature scripts from the transaction, effectively leaving the signature scripts empty, as <<fig1011>> shows.
de_de: Im Kryptojargon heisst _Witness_, also Zeuge, im Grunde so viel wie Signatur. Etwas, das die Authentizität von irgendetwas bezeugt. Für eine Bitcoin Transaktion ist der Witness der Inhalt der Signatur Scripts, denn das ist das, was bezeugt, dass die Transaktion authentifiziert wurde. _Segregated_ heisst abgetrennt, weil wir den Inhalt der Signatur Scripts von der Transaktion abtrennen und im Effekt die Signatur Scripts leer lassen, wie <<fig1011>> zeigt.

source: A segwit transaction contains no signature data. The signatures are attached, instead. The txid doesn’t commit to the signatures.
de_de: Eine SegWit Transaktion enthält keine Signaturdaten. Die Signaturen werden stattdessen angehängt. Die txid bindet sich nicht an die Signaturen.

source: _Segregated witness_ thus means the contents of the signature scripts are removed from the transaction and put into an external structure called the witness.
de_de: _Segregated Witness_ bedeutet also, der Inhalt der Signatur Scripts wurde aus der Transaktion entfernt und in eine externe Struktur namens Witness eingebracht.

source: We’ll follow a few segwit transactions to see how they affect the different parts of the Bitcoin system. But first, let’s get some bitcoin into a segwit wallet.
de_de: Wir folgen ein paar SegWit Transaktionen, um zu sehen, wie diese verschiedene Teile des Bitcoin Systems tangieren. Aber zuerst tun wir ein wenig bitcoin in unser SegWit Wallet.

source: Segwit addresses
de_de: Segwit Adressen

source: Suppose your wallet uses segwit, and you’re selling a laptop to Amy. Your wallet needs to create an address that you can give to Amy. So far, nothing new.
de_de: Angenommen, dein Wallet benutzt SegWit und du verkaufst einen Laptop an Amy. Dein Wallet muss eine Adresse erzeugen, die du Amy geben kannst. So weit nichts Neues.

source: This BIP defines the checksummed encoding scheme Bech32 and how segwit addresses are composed and encoded using Bech32.
de_de: Dieser BIP definiert das mit Checksum versehene Codierungsschema Bech32 und wie SegWit Adressen mit Hilfe von Bech32 zusammengesetzt und codiert werden.

source: But segwit defines a new address type that’s encoded using _Bech32_ instead of base58check. Suppose your wallet creates the following segwit address:
de_de: Aber SegWit definiert einen neuen Adresstyp, der mittels _Bech32_ statt base58check codiert wird. Nimm an, dein Wallet erzeugt die folgende SegWit Adresse:

source: This address format provides several improvements compared to the base58check addresses you’re used to:
de_de: Dieses Adressformat bietet im Vergleich zu den bereits geläufigen base58check Adressen mehrere Verbesserungen:

source: All characters are of the same case, which means
de_de: Alle Zeichen sind im gleichen _case_, also gross oder klein, was bedeutet

source: QR codes can be made smaller.
de_de: QR Codes können kleiner dargestellt werden.

source: Addresses are easier to verbally read out.
de_de: Adressen lassen sich leichter vorlesen.
