Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: But base64 doesn’t quite fit the bill for cookie token addresses. We need an encoding that doesn’t just detect typing errors when they happen but minimizes the risk of making them. Notice how some characters look similar in some fonts, like `lI` (lowercase L, capital I) and `0O` (zero and capital O). We also need a format that users can easily copy and paste, meaning special characters such as `+` and `/` shouldn’t be allowed—they’ll prevent us from marking the whole address by double-clicking it. Removing those six characters reduces the possibility of typing errors. But now we have only 58 characters left, so we need another type of encoding.
de_de: Aber base64 passt nicht besonders gut auf die Problemstellung der Cookie Token Adressen. Wir brauchen eine Codierung, die Tippfehler nicht nur findet, wenn sie passiert sind, sondern auch das Risiko verringert, überhaupt welche zu machen. Bedenke, dass einige Zeichen sich in manchen Fonts ähneln, wie `lI` (kleines L, grosses i) und `0O` (Null und grosses O). Wir brauchen ausserdem ein Format, das die Benutzer leicht kopieren und einfügen können, was bedeutet, dass Sonderzeichen wie `+` und `/` nicht vorkommen sollten—diese hindern uns daran, die ganze Adresse per Doppelklick zu markieren. Diese sechs Zeichen auszuschliessen, reduziert die Wahrscheinlichkeit von Tippfehlern. Aber jetzt haben wir nur noch 58 Zeichen übrig, also brauchen wir eine neue Art der Codierung.

source: This new way to encode data is called _base58_ because the alphabet is the following 58 character
de_de: Die neue Art der Codierung heisst _base58_, weil deren Alphabet 58 Zeichen enthält.

source: If you feel put off by this low-level base58 mumbo jumbo, you can skip to <<base58check-decoding>> and just accept that base58 is a way to encode and decode data. For the rest of you, please continue. It’s fun.
de_de: Wenn dich dieser maschinenorientierte base58 Hokuspokus abschreckt, kannst du zu <<base58check-decoding>> vorspulen und einfach akzeptieren, dass base58 eine Art der Codierung und Decodierung von Daten ist. Der Rest von euch macht weiter. Es macht Spass.

source: In base64, each character represents exactly 6 bits, which makes it straightforward to encode and decode data. But with base58, each character represents slightly less than 6 bits but more than 5 bits. We need to encode data differently.
de_de: In base64 repräsentiert jedes Zeichen 6 Bits, was das Codieren und Decodieren einfach macht. Aber bei base58 repräsentiert jedes Zeichen etwas weniger als 6 Bits, aber mehr als 5 Bits. Wir müssen die Daten anders codieren.

source: Let’s get back to the example in which John creates his address. He’s just added a version and a checksum. Now it’s time to encode the 25 bytes into the final result: the address (<<base58-encoding>>).
de_de: Gehen wir zu dem Beispiel zurück, in dem John seine Adresse erzeugt. Er hat gerade die Version und Checksum hinzugefügt. Jetzt ist es Zeit, die 25 Bytes in das Endergebnis zu überführen: die Adresse (<<base58-encoding>>).

source: Encoding John’s versioned and checksummed PKH with base58. The essential part is where you divide the number by 58 and keep the remainders, which are then mapped one by one in the lookup table.
de_de: Johns versionierter und prüfsummierter PKH mit base58. Der wichtige Teil ist dort, wo wir die Zahl durch 58 teilen und die Reste behalten, die dann einer nach dem anderen in der Lookup-Tabelle abgebildet werden.

source: The overall strategy of base58 is to treat the data as a huge number that you divide by 58 over and over until the quotient is 0; you keep the remainders of every division. You look up each remainder in the lookup table and append a `1` last for each leading 0 byte in the input. The string is finally reversed, and the result is John’s cookie token address. Note that all cookie token addresses, not just John’s, will start with a `1`. This is because the version byte is 0, which is encoded by the character `1`.
de_de: Die Grundstrategie von base58 ist die, die gesamten Daten als eine riesige Zahl zu betrachten, die man wieder und wieder durch 58 teilt, bis der Quotient 0 ergibt; man merkt sich dabei den Rest jeder Division. Man schaut in der Lookup-Tabelle jeden Rest nach und hängt für jedes führende Byte 0 im Input eine `1` hinten an. Am Schluss wird die Zeichenkette umgedreht, und das Ergebnis ist Johns Cookie Token Adresse. Wohlgemerkt beginnen alle, nicht nur Johns, Cookie Token Adressen mit einer `1`. Das liegt daran, dass das Versionsbyte 0 ist, was durch das Zeichen `1` codiert wird.

source: You can decode base58-encoded data such as John’s address back to the original input of the base58 encoding. I’ll leave this as an exercise for the interested reader.
de_de: Du kannst base58 codierte Daten wie Johns Adresse zurück zum ursprünglichen Input der base58 Codierung decodieren. Ich überlasse das dem interessierten Leser als Übung.

source: Note that base58 encoding is nothing new. It’s a generic way to convert a decimal number to any other base. You can use the same algorithm to convert to base3, instead—divide by 3 instead of 58. Maybe you’d also like to change the lookup table to map 0 to 0, 1 to 1, and 2 to 2 to get the characters you’re used to. For example, write 17 in base 3:
de_de: Denke daran, dass die base58 Codierung nichts Neues ist. Es ist eine generische Art, eine Dezimalzahl in eine andere Basis umzurechnen. Man kann denselben Algorithmus benutzen, um stattdessen zur Basis 3 zu konvertieren–man dividiert durch 3 anstatt durch 58. Ausserdem will man vielleicht die Lookup-Tabelle so ändern, dass sie 0 auf 0, 1 auf 1 und 2 auf 2 abbildet, damit man die gewohnten Zeichen bekommt. Schreibe zum Beispiel mal 17 zur Basis 3:

source: Then, look up the remainders in the lookup table (same digits as the ones you convert), and you’ll get `2 2 1`. Reverse that to get the final result: `1 2 2`. Verify that it’s correct as follows:
de_de: Dann schlage die Reste in der Lookup-Tabelle nach (dieselben Ziffern wie die, die du konvertierst), und du bekommst `2 2 1`. Drehe das um und du bekommst das Endergebnis: `1 2 2`. Verifiziere die Korrektheit wie folgt:

source: Base58check decoding
de_de: Base58check Decodierung

source: John has just created his cookie token address by base58check encoding his PKH. He’s given the address to Faiza so she can send him 20 CT. Now, Faiza needs to write a message to Lisa. To do this, she needs John’s PKH. The great thing about base58check encoding is that the process can be reversed so you can get the PKH from the address while simultaneously checking for typing errors (<<fig0315>>).
de_de: John hat soeben seine Cookie Token Adresse durch base58check Codierung seines PKH erzeugt. Er hat die Adresse Faiza gegeben, damit sie ihm 20 CT senden kann. Jetzt muss Faiza eine Nachricht an Lisa schreiben. Um das zu tun, braucht sie Johns PKH. Das Gute an der base58check Codierung ist, dass der Prozess umkehrbar ist, sodass man den PKH aus der Adresse ermitteln und gleichzeitig auf Tippfehler prüfen kann (<<fig0315>>).

source: Base58check decoding is basically done by reversing the base58check encoding. Typing errors are detected when the checksums don’t match.
de_de: Base58check Decodierung erreicht man im Grunde dadurch, dass man die base58check Codierung umdreht. Tippfehler werden erkannt, wenn die Checksum nicht passt.

source: Faiza takes John’s cookie token address and base58 decodes it. Then, she removes the checksum and uses the remaining part, the versioned PKH, to calculate the checksum again. The newly calculated checksum and the just-removed checksum must match. Otherwise, a typing error has occurred, in which case Faiza won’t create the message. She’ll know the address was corrupted somewhere along the way and refrain from sending an email to Lisa. She’ll verify that she entered the address correctly and that John gave her the correct address to learn where it went wrong.
de_de: Faiza nimmt Johns Cookie Token Adresse und base58-decodiert sie. Dann entfernt sie die Checksum und benutzt den verbliebenen Teil, den versionierten PKH, um die Checksum nochmal zu berechnen. Die neu berechnete Checksum und die soeben entfernte Checksum müssen gleich sein. Ansonsten war ein Tippfehler passiert, und in dem Fall würde Faiza keine Nachricht verfassen. Sie würde wissen, dass die Adresse auf dem Weg verfälscht wurde und keine Mail an Lisa schicken. Sie würde nochmal prüfen, dass sie die Adresse korrekt eingegeben hat und dass John ihr die richtige Adresse gegeben hatte, um herauszufinden, wo der Fehler passiert ist.

source: How safe is the checksum? Suppose a typing error occurred in an address. What’s the probability that the checksum won’t detect the error? The checksum is 4 bytes, which corresponds to 2^32^ ≈ 4.3 billion values. The chance is about 1 in 4.3 billion that base58check fails to detect the typing error. It’s pretty safe.
de_de: Wie sicher ist die Checksum? Nimm an, ein Tippfehler passiert in einer Adresse. Mit welcher Wahrscheinlichkeit würde die Checksum den Fehler nicht erkennen? Die Checksum ist 4 Bytes, was 2^32^ ≈ 4,3 Milliarden Werten entspricht. Die Chance ist etwa 1 zu 4,3 Milliarden, dass base58check einen Tippfehler nicht bemerkt. Es ist ziemlich sicher.

source: Back to privacy
de_de: Zurück zu Privacy

source: Although privacy improved when we replaced names with PKHs, the spreadsheet still reveals some information that Acme Insurances finds useful.
de_de: Obwohl die Privacy verbessert wurde, als wir die Namen durch PKH ersetzt haben, enthält das Spreadsheet immer noch Informationen, die für die Acme Versicherung nützlich sind.

source: Forensics
de_de: Forensik

source: This technique is often used in Bitcoin—for example, during crime investigations.
de_de: Diese Technik wird in Bitcoin häufig benutzt–zum Beispiel bei kriminaltechnischen Untersuchungen.

source: For example, Acme can probably figure out the cafe has the PKH `87e3d169…8393b1cc` because a lot of 10 CT payments have been made to this PKH. From this, Acme will be able to see which PKHs are making the most 10 CT payments to that PKH. Let’s say Acme talks to Faiza and asks her for information about her recent payments. She’s made only one payment so far, the one to John. Faiza, unaware of why Acme is asking these questions, discloses that the transaction is for John.
de_de: Zum Beispiel kann Acme herausfinden, dass das Café den PKH `87e3d169…8393b1cc` besitzt, weil eine Menge Zahlungen dorthin geleistet worden sind. Von dort aus kann Acme sehen, welche PKHs die meisten 10 CT Zahlungen an diesen PKH senden. Sagen wir mal, Acme redet mit Faiza und bittet sie um Informationen zu ihren letzten Zahlungen. Sie hat bisher erst eine Zahlung geleistet, die an John. Weil Faiza nicht weiss, weshalb Acme diese Auskunft haben möchte, gibt sie an, dass die Zahlung an John ging.

source: Dear John,
de_de: Lieber John,

source: It has come to our attention that you live an unhealthy life. We have therefore promoted you to a higher risk category. Congratulations.
de_de: uns fiel auf, dass Sie ungesund leben. Wir haben Sie daher in eine höhere Kategorie eingestuft. Wir Gratulieren.

source: Sincerely, + Acme Insurances
de_de: Mit freundlichen Grüssen, Acme Versicherung

source: A week later, John receives a letter from Acme politely informing him that he’s been promoted to a higher risk category, and his insurance premium has been adjusted accordingly.
de_de: Eine Woche später bekommt John einen Brief von Acme, der ihn höflich darüber informiert, dass er in eine höhere Risikoklasse aufgestiegen ist, und dass seine Versicherungsprämie entsprechend angepasst wurde.

source: Some privacy issues obviously remain. Luckily, users can create as many addresses they like. For example, the cafe could create a unique address for every incoming payment. And John could create a brand-new cookie token address the next time he accepts cookie tokens from Faiza.
de_de: Es verbleiben offenbar noch einige Privacy Probleme. Glücklicherweise können Benutzer so viele Adressen erzeugen wie sie wollen. Zum Beispiel könnte das Café eine einmalige Adresse für jede eingehende Zahlung erzeugen. Und John könnte beim nächsten Mal, wenn er von Faiza Cookie Tokens bekommt, eine neue Adresse generieren.

source: Using unique addresses for each payment will make it harder for Acme to extract information from the cookie token spreadsheet, because they won’t be able to tell which payments belong to the same person.
de_de: Einmalige Adressen für jede Zahlung zu benutzen macht es Acme schwieriger, Information aus dem Cookie Token Spreadsheet zu extrahieren, weil sie nicht mehr sagen können, welche Zahlungen der gleichen Person zuzurechnen sind.

source: This chapter started with replacing the names in the spreadsheet with users’ respective PKHs.
de_de: Dieses Kapitel begann damit, die Namen im Spreadsheet durch die jeweiligen PKHs der Benutzer zu ersetzen.

source: Then, we used base58check to create an address from a PKH. Let’s put the pieces together and look at the whole cookie token address-creation process from random number generator to the address.
de_de: Dann benutzten wir base58check, um aus dem PKH eine Adresse zu generieren. Lass uns die Teile zusammenfügen und den gesamten Cookie Token Adressenerzeugungs-Prozess vom Zufallszahlengenerator bis zur Adresse betrachten.

source: Faiza makes sure no typing errors happen by base58check decoding the address before signing the message.
de_de: Faiza geht sicher, dass keine Tipfehler passieren, indem sie die Adresse base58check-decodiert, bevor sie die Nachricht signiert.

source: System changes
de_de: Systemänderungen

source: The concept table (<<tab0301>>) isn’t updated in this chapter. Cookie token addresses are exactly what Bitcoin uses, so we haven’t introduced any concepts that differ from Bitcoin.
de_de: Die Kozepttabelle (<<tab0301>>) hat sich in diesem Kapitel nicht verändert. Cookie Token Adressen sind exakt das, was Bitcoin benutzt, also haben wir keine Konzepte eingeführt, die von Bitcoin abweichen.

source: Nothing new in the concept table
de_de: Nichts Neues in der Konzepttabelle

source: | Cookie Tokens | Bitcoin | Covered in | 1 cookie token | 1 bitcoin | <<ch02>> | The spreadsheet | The blockchain | <<ch06>> | Email to Lisa | A transaction | <<ch05>> | A row in the spreadsheet | A transaction | <<ch05>> | Lisa | A miner | <<ch07>>
de_de: | Cookie Tokens | Bitcoin | Behandelt in | 1 Cookie Token | 1 bitcoin | <<ch02>> | Das Spreadsheet | Die Blockchain | <<ch06>> | Email an Lisa | Eine Transaktion | <<ch05>> | Eine Zeile im Spreadsheet | Eine Transaktion | <<ch05>> | Lisa | Ein Miner | <<ch07>>

source: Thanks to PKH and cookie token addresses, Lisa can ditch her table of public keys. You can add PKH and addresses to your toolbox for later use, and we release version 3.0 of the cookie token system (<<tab0302>>).
de_de: Dank PKH und Cookie Token Adressen kann Lisa ihre Tabelle von public Key loswerden. Wir nehmen PKH und Adressen in unseren Werkzeugkasten mit auf und geben Version 3.0 des Cookie Token Systems frei (<<tab0302>>).

source: 2+|image:{commonimagedir}/new.png[role="gbnew"]3.0
de_de: 2+|image:{commonimagedir}/new.svg[role="gbnew"]3.0

source: |Safe from expensive typing errors |Cookie token addresses. |Privacy improvements |A PKH instead of a personal name is stored in the spreadsheet. |2.0 |Secure payments |Digital signatures solve the problem with imposters.
de_de: |Sicher gegen teure Tippfehler |Cookie Token Adressen. |Privacy Verbesserungen |Ein PKH statt eines Namens steht im Spreadsheet. |2.0 |Sichere Zahlungen |Digitale Signaturen lösen das Problem mit Betrügern.

source: |Simple payment system |Relies on Lisa being trustworthy and knowing everyone’s face. |Finite money supply |7,200 new CT are rewarded to Lisa daily; the amount halves every four years.
de_de: |Einfaches Bezahlsystem |Vertraut auf Lisas Integrität und ihre Kenntnis aller Mitarbeiter |Begrenzte Geldmenge |Lisa wird täglich mit 7,200 neuen CT belohnt; halbiert sich alle vier Jahre

source: The PKH is shorter than the public key—only 160 bits. We made it shorter using RIPEMD160. Why do you want it to be shorter? There are two good reasons.
de_de: Der PKH ist kürzer als der public Key–nur 160 Bits. Wir haben ihn mittels RIPEMD160 gekürzt. Warum möchten wir ihn kürzer haben? Es gibt zwei gute Gründe.

source: Base58check encoding is used to create a cookie token (Bitcoin) address from a PKH. Is it possible to reverse this process to create a PKH from an address?
de_de: Base58check Codierung wird benutzt, um eine Cookie Token (Bitcoin) Adresse aus einem PKH zu erzeugen. Ist es möglich, den Prozess umzudrehen, um aus einer Adresse einen PKH zu machen?

source: When is base58check decoding used, and by whom?
de_de: Wann wird base58check Decodierung benutzt, und von wem?

source: Base58 encode the two hex bytes `0047`. Use the following diagram. You may skip this exercise if you didn’t read the section on base58 encoding.
de_de: Base58-codiere die beiden Hexziffern `0047`. Benutze das folgende Diagramm. Du kannst diese Übung überspringen, wenn du nicht den Abschnitt über base58 Codierung gelesen hast.

source: What in an address makes it mostly safe from typing errors?
de_de: Welcher Teil der Adresse schützt sie am meisten vor Tippfehlern?

source: Imagine that John wants a cookie from the cafe. He has two addresses: @~1~ with a balance of 5 CT, and @~2~ with 8 CT. His total balance is 13 CT, so he should be able to afford 10 CT for a cookie. Give an example of how he could pay 10 CT to the cafe.
de_de: Stell dir vor, John möchte einen Keks vom Café kaufen. Er besitzt zwei Adressen: @~1~ mit einem Kontostand von 5 CT, und @~2~ mit 8 CT. Sein Gesamtstand ist 13 CT, also sollte er 10 CT für einen Keks bezahlen können. Gib ein Beispiel, wie er 10 Cookie Token an das Café bezahlen könnte.

source: Is it possible to deduce what cookie token addresses were involved in a certain payment by looking at the following spreadsheet?
de_de: Ist es möglich herzuleiten, welche Cookie Token Adressen in einer bestimmten Zahlung involviert waren, indem man das folgende Spreadsheet untersucht?

source: Is it possible to deduce what public keys were involved in a certain payment by looking at just the spreadsheet?
de_de: Ist es möglich herzuleiten, welche public Keys in einer bestimmten Zahlung involviert waren, indem man nur dieses Spreadsheet untersucht?

source: Suppose everybody always used unique addresses for each payment. What information from the spreadsheet could Acme use to roughly identify the cafe’s addresses?
de_de: Angenommen jeder benutzt immer einmalige Adressen für jede Zahlung. Welche Information aus dem Spreadsheet kann Acme verwenden, um die Adressen des Cafés ungefähr zu identifizieren?

source: Suppose there was a serious flaw in the public key derivation function, so anyone could calculate the private key from a public key. What prevents a bad guy from stealing your money in this scenario?
de_de: Angenommen es gäbe einen ernsthaften Mangel in der public Key Ableitungsfunktion, sodass jeder aus einem public Key den private Key berechnen könnte. Was hindert in diesem Szenario einen Bösewicht daran, dein Geld zu stehlen?

source: Suppose there was a serious flaw in RIPEMD160, so anyone could easily figure out a 256-bit pre-image of the PKH. This would mean it wasn’t pre-image resistant. What prevents a bad guy from stealing your money in this scenario?
de_de: Angenommen es gäbe einen ernsthaften Mangel in RIPEMD160, sodass jeder ganz einfach ein 256 Bit Pre-image eines PKH erzeugen könnte. Das würde bedeuten, es wäre nicht Pre-Image resistent. Was hindert einen Bösewicht in diesem Szenario daran, dein Geld zu stehlen?

source: Privacy is important for you, not just for criminals.
de_de: Privacy ist für dich wichtig, nicht nur für Kriminelle.

source: Using PKHs instead of personal names as recipients for payments is important for privacy and more secure.
de_de: PKHs statt persönliche Namen für die Empfänger von Zahlungen zu benutzen, ist sicherer und wichtig für die Privacy.

source: Encoding a PKH as a Bitcoin address, or cookie token address, reduces the risk of sending money into the void, thanks to the checksum in the address.
de_de: Einen PKH als Bitcoin Adresse zu codieren, verringert dank der Checksum in der Adresse das Risiko, Geld ins Leere zu schicken.

source: Only users care about Bitcoin addresses. The Bitcoin network, or Lisa, deals with plain PKHs.
de_de: Nur Benutzer interessieren sich für Bitcoin Adressen. Das Bitcoin Netzwerk oder Lisa befasst sich nur mit einfachen PKHs.

source: You can have as many Bitcoin addresses as you like. Using multiple addresses, preferably one per received payment, improves your privacy.
de_de: Man kann so viele Bitcoin Adressen haben wie man will. Mehrere Adressen zu benutzen, vorzugsweise eine pro empfangener Zahlung, verbessert deine Privacy.

source: Automating payments
de_de: Automatisieren von Zahlungen

source: Creating and managing keys
de_de: Erzeugen und Verwalten von Schlüsseln

source: Making simple, secure key backups
de_de: Einfache, sichere Backups anfertigen

source: So far, we’ve done nothing to improve the user experience for the company’s coworkers using the cookie token spreadsheet. The situation has become worse for users because emails to Lisa now need more information than in the beginning. On top of this, users should take extra steps to use multiple addresses to preserve their privacy.
de_de: Bisher haben wir nichts getan, um die User Experience für die Kollegen in der Firma, die das Cookie Token Spreadsheet benutzt, zu verbessern. Die Situation hat sich für die Benutzer verschlimmert, weil Mails an Lisa jetzt mehr Informationen benötigen als zu Anfang. Darüber hinaus sollen die Benutzer jetzt auch noch weitere Schritte unternehmen, um zur Verbesserung ihrer Privacy mehrere Adressen zu benutzen.

source: In this chapter, we’ll build a mobile app, called a _wallet_ (<<fig0401>>), that handles many of the common tasks users want to perform. This wallet will create new addresses, store private keys, simplify how addresses are transferred between users, and automate the payment process.
de_de: In diesem Kapitel werden wir eine mobile App bauen, die wir als _Wallet_ (<<fig0401>>) bezeichnen, welche viele der üblichen Aufgaben übernimmt, die Benutzer durchführen möchten. Dieses Wallet wird neue Adressen erzeugen, private Keys speichern, den Transfer von Adressen zwischen Benutzern vereinfachen und den Zahlungsprozess automatisieren.

source: We’ll discuss different approaches to wallet backups. We’ll also look at a new way to generate keys, called _hierarchical deterministic wallets_ (HD wallets), so backups become dead simple; you only need to back up a single random number, called a _seed_, once and for all. We’ll finish the chapter with an optional deep dive into the math behind public key derivation.
de_de: Wir werden diverse Ansätze besprechen, wie man die Daten der Wallet sichern kann. Wir schauen uns auch ein neues Verfahren zur Schlüsselerzeugung an, namens _hierachical deterministic wallets_ (HD Wallets), womit Backups total einfach werden; man braucht nur noch eine einzige Zufallszahl zu sichern, die als _Seed_ oder Samenkorn bezeichnet wird, und das war es. Wir beenden das Kapitel mit einem optionalen Tauchgang tief in die Mathematik hinter public Key Ableitung.

source: This chapter won’t change anything regarding Lisa’s work or the spreadsheet. We focus only on users here.
de_de: Dieses Kapitel ändert nichts an Lisas Arbeit oder dem Spreadsheet. Wir konzentrieren uns hier auf die Benutzer.

source: First wallet version
de_de: Erste Wallet Version
