Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: This private key derives to the public key `M/1`. Bingo! She has calculated the private key `m/1` for the online sales account. The xprv shares the chain code with the xpub, so she also has the xprv for `m/1`, and she can calculate the private key tree for the account. Mallory steals all the money from the online sales account. Not good.
de_de: Dieser private Key leitet sich zu `M/1` ab. Bingo! Sie hat den private Key `m/1` für das online Verkaufskonto. Der xprv teilt sich den Chain Code mit dem xpub, also hat sie auch den xprv für `m/1`, und sie kann den Baum von private Keys für das Konto berechnen. Mallory stiehlt das gesamte Geld vom online Verkaufskonto. Nicht gut.

source: Now think about what would happen if Mallory had the master xpub. She could use the same technique to derive the master xprv from the master xpub and `m/1/1`. Mallory can re-create all the private keys of all accounts in the entire wallet. Can you do something to prevent such a catastrophic scenario? Yes, with _yet another key-derivation function_! This new key-derivation function is called _hardened xprv derivation_.
de_de: Jetzt überleg mal, was passieren würde, wenn Mallory den Master xpub hätte. Sie könnte mit derselben Technik den Master xprv aus dem Master xpub und `m/1/1` ableiten. Mallory könnte dann alle private Keys von allen Konten im gesamten Wallet rekreieren. Können wir etwas tun, um ein solches Katastrophenszenario zu verhindern? Ja, mit _noch einer Key Ableitungsfunktion_! Diese neue Ableitungsfunktion heisst _gehärtete xprv Ableitung_.

source: Suppose the cafe wants to prevent Mallory from accessing the master xprv, even if she got the master xpub and a private key in the online sales account. The cafe can generate the xprv for the online sales account using hardened xprv derivation, as <<fig0422>> shows.
de_de: Angenommen, das Café möchte verhindern, dass Mallory auf den master xprv zugreift, selbst wenn sie den master xpub und einen privaten Schlüssel im Online Verkaufskonto hat. Das Café kann den xprv für das Online Verkaufskonto mithilfe der gehärteten xprv Ableitung generieren, wie <<fig0422>> zeigt.

source: Normal child xprv derivation
de_de: Normale Child xprv Ableitung

source: Deriving a hardened child xprv for the online sales account. You use the parent private key as input to the hash function instead of the public key.
de_de: Ableitung eines gehärteten Child xprv für das online Verkaufskonto. Man benutzt den Parent private Key als Input für die Hashfunktion anstelle des public Key.

source: The apostrophe in `m/1'` isn’t a typo: it’s used to denote hardened key derivation. The difference is that with hardened key derivation, you hash the _private_ key instead of the public key. An attacker can’t do the “minus” trick anymore because the hash is derived from the parent private key. Mallory can’t calculate the left-half hash to subtract from the child private key because she doesn’t have the parent private key. <<fig0423>> illustrates the result.
de_de: Das Apostroph in `m/1'` ist kein Tippfehler: Es wird benutzt, um eine gehärtete Key Ableitung auszeichnen. Der Unterschied ist, dass man bei gehärteter Key Ableitung den _private_ Key anstelle des public Key hasht. Ein Angreifer kann den “minus” Trick nicht mehr anwenden, weil der Hash vom Parent private Key abgeleitet ist. Mallory kann die linke Hashhälfte zum Subtrahieren nicht mehr ausrechnen, weil sie den Parent private Key nicht kennt. <<fig0423>> illustriert das Ergebnis.

source: The master xpub can’t be used to generate any child keys because `m/0'` and `m/1'` are hardened keys.
de_de: Der master xpub kann nicht zur Erzeugung von Child Keys benutzt werden, weil `m/0'` und `m/1'` gehärtete Keys sind.

source: This also means you can’t derive a hardened child xpub from a parent xpub. You must have the parent xprv to generate any children, public or private. The children of `m/1'` can’t be derived as hardened private keys because that would require the cafe to put the private key `m/1'` on the online sales web server, which would be insecure. Using nonhardened leaf keys in the online sales account makes the cafe vulnerable to an attacker stealing `m/1'/1` and `M/1'`. If that happens, all funds in the account will be stolen. With hardened xprv, you solve the case of a stolen `M` and `m/1'/1` but not the case with a stolen `M/1'` and `m/1'/1`.
de_de: Das bedeutet auch, man kann keinen gehärteten Child xpub von einem Parent xpub erzeugen. Man muss den Parent xprv haben, um irgendwelche Child Keys zu generieren, public oder private. Die Abkömmlinge von `m/1'` können nicht als gehärtete Keys abgeleitet werden, denn das setzt voraus, dass das Café den private Key `m/1'` auf den online Web Server legt, was unsicher wäre. Nichtgehärtete Blatt Keys im online Verkaufskonto machen das Café empfindlich dagegen, dass ein Angreifer `m/1'/1` und `M/1'` stiehlt. Wenn das passiert, können alle Coins in dem Konto gestohlen werden. Mit einem gehärteten xprv löst man das Problem von gestohlenen `M` und `m/1'/1`, aber nicht den Fall von gestohlenen `M/1'` und `m/1'/1`.

source: Public key math
de_de: Public Key Mathematik

source: This section digs deeper into the math behind public keys. We’ll start by looking at how a public key is derived from a private key using _public key multiplication_. Later subsections will show why child xpub derivation, using _public key addition_, works, and how public keys are encoded in Bitcoin.
de_de: Dieser Anschnitt steigt tiefer in die Mathematik hinter public Keys ein. Wir beginnen damit, wie ein public Key aus einem private Key durch _public Key Multiplikation_ hergeleitet wird. Spätere Abschnitte werden dann ausführen, wie Child xprv Ableitung mittels _public Key Addition_ funktioniert und wie public Keys in Bitcoin codiert werden.

source: Public key multiplication
de_de: Public Key Multiplikation

source: I’ll try to explain this topic in simple terms, but if you think it’s too much, you can skip this section and jump to <<ch04-recap>>.
de_de: Ich werde versuchen, dieses Thema in einfachen Begriffen zu erklären, aber wenn du glaubst es ist zu schwer, dann überspring diesen Abschnitt und springe zu <<ch04-recap>>.

source: Normal public key derivation
de_de: Normale public Key Ableitung

source: Think back to when you derived a public key from a private key in <<ch02>>. I didn’t really tell you _how_ the public key was derived. I’ll make an attempt here instead.
de_de: Denk zurück an vorhin, als du in <<ch02>> einen public Key aus einem private Key hergeleitet hast. Ich habe dir da eigentlich gar nicht gesagt, _wie_ der public Key abgeleitet wurde. Das werde ich stattdessen hier probieren.

source: A public key in Bitcoin is a whole-number solution to this equation:
de_de: Ein public Key in Bitcoin ist eine ganzzahlige Lösung zu folgender Gleichung:

source: Many such solutions exist, about stem:[2^{256}] of them, so let’s simplify by using the solutions to stem:[y^2 = x^3 + 7 \mod{11}] instead (<<fig0424>>).
de_de: Viele solcher Lösungen existieren, ungefähr stem:[2^{256}] davon, also vereinfachen wir, indem wir stattdessen die Lösungen zu stem:[y^2 = x^3 + 7 \mod{11}] (<<fig0424>>) benutzen.

source: Bitcoin uses this curve
de_de: Bitcoin benutzt diese Kurve

source: This specific elliptic curve is called _secp256k1_ and is used in Bitcoin. Plenty of other curves have similar properties.
de_de: Diese spezielle elliptische Kurve heisst _secp256k1_ und wird in Bitcoin verwendet. Es gibt jede Menge anderer Kurven mit ähnlichen Eigenschaften.

source: Whole-number solutions to the elliptic curve stem:[y^2 = x^3 + 7 \mod{11}]. Each such solution is a public key.
de_de: Ganzzahlige Lösungen der elliptischen Kurve stem:[y^2 = x^3 + 7 \mod{11}]. Jede Lösung ist ein public Key.

source: Curve? I see only dots.
de_de: Kurve? Ich sehe nur Punkte.

source: It’s called a _curve_ because in the continuous, real-number world, the solutions form a curve like this:
de_de: Sie wird als _Kurve_ bezeichnet, weil in der durchgehenden, realen Welt der reellen Zahlen die Lösungen eine Kurve wie diese hier bilden würden:

source: The previous equations are examples of a class of equations called _elliptic curves_, and a solution is often referred to as a _point on the curve_. You can now calculate a public key, which is a point on the curve, from a private key. To do this, start at a special point, stem:[G=(6,5)], on the curve. stem:[G] is somewhat arbitrarily chosen, but it’s widely known by everybody to be the starting point for public key derivation. _The public key is the private key multiplied by stem:[G]._
de_de: Die vorangegangenen Gleichungen sind Beispiele einer Klasse von Gleichungen, die als _elliptische Kurven_ bezeichnet werden, und eine Lösung wird oft ein _Punkt auf der Kurve_ genannt. Du kannst jetzt einen public Key, der ein Punkt auf der Kurve ist, aus einem private Key berechnen. Um dies zu tun, beginnst du an einem bestimmten Punkt, stem:[G=(6,5)], auf der Kurve. stem:[G] wurde mehr oder weniger willkürlich ausgesucht, ist aber allen als Ausgangspunkt für die public Key Herleitung wohlbekannt. _Der public Key ist der private Key multipliziert mit stem:[G]._

source: Suppose your private key is stem:[5]. Then your public key is stem:[5G].
de_de: Angenommen dein private Key ist stem:[5]. Dann ist dein public Key stem:[5G].

source: To calculate this multiplication, you need two basic public key operations: addition and doubling, where doubling can be seen as adding a point to itself.
de_de: Um diese Multiplikation auszurechnen, brauchst du zwei grundlegende public Key Operationen: Addition und Verdopplung, wobei Verdopplung als Addition des Punktes zu sich selbst betrachtet werden kann.

source: To add two points (<<fig0425>>), you draw a straight line that “wraps around” the edges of the diagram and that intersects your two points and one third point. This third point is the negative result of the addition. To get the final result of the addition, take the symmetric point at the same stem:[x] value.
de_de: Um zwei Punkte zu addieren (<<fig0425>>) ziehst du eine Gerade, die an den Rändern des Diagramms “umgebrochen” wird und die sowohl deine beiden Punkte schneidet als auch einen dritten Punkt. Dieser dritte Punkt ist das negative Resultat der Addition. Um das Endresultat der Addition zu erhalten, nimmst du den symmetrischen Punkt am selben stem:[x] Wert.

source: Point addition. You add stem:[(x, y)=(6,5)] to stem:[(2, 2)] by drawing a straight line through them that will intersect a third point.
de_de: Punktaddition. Du addierst stem:[(x, y)=(6,5)] zu stem:[(2, 2)], indem du eine Gerade durch diese ziehst, die einen dritten Punkt schneidet.

source: Is there always a third point?
de_de: Gibt es immer einen dritten Punkt?

source: Yes, there’s always a line that intersects a third point. It’s one of the curve’s important properties.
de_de: Ja, es ergibt sich immer eine Gerade, die einen dritten Punkt schneidet. Das ist eine der wichtigen Eigenschaften dieser Kurve.

source: The result of stem:[(6, 5) + (2, 2)] is stem:[(7, 8)]. The straight line between the two points crosses the point stem:[(7, 3)]. The complement point to stem:[(7, 3)] is stem:[(7, 8)], which is the result of the addition.
de_de: Das Ergebnis von stem:[(6, 5) + (2, 2)] ist stem:[(7, 8)]. Die Gerade zwischen den beiden Punkten schneidet den Punkt stem:[(7, 3)]. Der komplementäre Punkt zu stem:[(7, 3)] ist stem:[(7, 8)], was das Ergebnis der Addition ist.

source: To double a point (<<fig0426>>) is to add it to itself, but there’s no slope to be calculated from a single point. In this special case, you calculate the slope from the single point stem:[P=(6,5)] as stem:[3*x^2*(2y)^{-1} \mod{11} = 2]. The process is almost the same as adding two different points, but you calculate the slope of the line differently.
de_de: Einen Punkt zu verdoppeln (<<fig0426>>) heisst, ihn zu sich selbst zu addieren, aber eine Steigung kann nicht aus einem einzigen Punkt berechnet werden. In diesem Spezialfall berechnet man die Steigung aus dem Einzelpunkt stem:[P=(6,5)] durch stem:[3*x^2*(2y)^{-1} \mod{11} = 2]. Der Vorgang ist fast derselbe wir bei der Addition zweier unterschiedlicher Punkte, aber die Steigung wird anders berechnet.

source: Point doubling. To double a point P, draw a line through P with a special slope that’s calculated from P. The line crosses another point, stem:[(3,10)]. The complement point stem:[(3, 1)] is the doubling result.
de_de: Punktverdopplung. Um einen Punkt P zu verdoppeln, ziehe eine Gerade durch P mit einer speziellen Steigung, die aus P berechnet wird. Die Linie schneidet einen weiteren Punkt, stem:[(3,10)]. Der komplementäre Punkt, stem:[(3, 1)], is das Verdopplungsergebnis.

source: Using these two basic operations, adding and doubling, you can derive the multiplication of stem:[5] and stem:[G]. In binary form, stem:[5] is
de_de: Mit diesen zwei Grundoperationen, Addition und Verdopplung, kann man die Multiplikation von stem:[5] und stem:[G] herleiten. In binärer Form ist stem:[5]

source: Your public key is then
de_de: Der public Key ist dann

source: Start in stem:[G] and calculate the resulting public key point by taking terms from right to left:
de_de: Fange bei stem:[G] an und berechne den resultierenden public Key Punkt, indem du die Terme von links nach rechts durchgehst:

source: Elliptic curve calculator
de_de: Rechner für elliptische Kurven

source: There’s a nice elliptic curve calculator at <<web-elliptic-curve-calculator>> that you can play with to get a better feel for how this works.
de_de: Es gibt einen schicken Rechner für elliptische Kurven bei <<web-elliptic-curve-calculator>>, mit dem man spielen kann, um ein besseres Gefühl dafür zu bekommen, wie das Ganze funktioniert.

source: Calculate stem:[2^0*G = 1*G = G]. Easy. Now remember this point.
de_de: Berechne stem:[2^0*G = 1*G = G]. Einfach. Jetzt merke dir diesen Punkt.

source: Calculate stem:[2^1*G = 2*G]. This is a point doubling of the previously remembered point _G_ from step 1. Remember the point. Because there is a 0 in front of stem:[2^1*G], you don’t do anything with it—just remember it.
de_de: Berechne stem:[2^1*G = 2*G]. Dies ist eine Punktverdopplung des zuvor gemerkten Punktes _G_ aus Schritt 1. Merke dir den Punkt. Weil vor stem:[2^1*G] eine 0 steht, tust du momentan nichts damit. Aber merke dir den Punkt.

source: Calculate stem:[2^2*G = 2*2*G], which is a doubling of the previously remembered point stem:[2*G]. Because there is a 1 in front of the stem:[2^2*G] term, you add this result to the result of step 1.
de_de: Berechne stem:[2^2*G = 2*2*G], was eine Verdopplung des zuvor gemerkten Punktes stem:[2*G] ist. Weil vor stem:[2^2*G] eine 1 steht, addierst du dieses Resultat zum Ergebnis von Schritt 1.

source: In short, multiplication is performed by a sequence of adding and doubling operations.
de_de: Kurz gesagt basiert Multiplikation auf einer Abfolge von Additions- und Verdopplungsoperationen.

source: Why is this secure?
de_de: Warum ist das sicher?

source: The multiplication process is pretty easy to complete; it takes about 256 steps for a 256-bit private key. But to reverse this process is a totally different story. No known way exists to get the private key by point “division” (for example, point stem:[(6,6)] “divided by” stem:[G]). The only known way is to try different private keys and see if the public key is what you’re looking for. This is what makes public-key derivation a one-way function.
de_de: Der Multiplikationsvorgang ist relativ einfach durchzuführen; es braucht ungefähr 256 Schritte für 256 Bit lange private Keys. Aber das umzukehren ist eine völlig andere Geschichte. Es gibt keinen bekannten Weg, den private Key durch Punkt-“Division” (zum Beispiel, Punkt stem:[(6,6)] “geteilt durch” stem:[G]). Der einzige bekannte Weg besteht darin, verschiedene private Keys auszuprobieren und zu sehen, ob dessen public Key derjenige ist, den du suchst. Das macht die public Key Ableitung zu einer Einbahnfunktion.

source: Xpub derivation
de_de: Xpub Herleitung

source: You’ve seen how an ordinary public key is derived from a private key through public-key multiplication. But how can adding the parent public key with the public key derived from the left 256 bits make the child public key? See <<fig0427>>.
de_de: Du hast gesehen, wie ein normaler public Key aus einem private Key durch public Key Multiplikation hergeleitet werden kann. Aber wie kann die Addition eines Parent public Keys zu einem public Key, der aus den linken 256 Bits abgeleitet wurde, den Child public Key ergeben? Siehe <<fig0427>>.

source: The child public key is derived by adding the parent public key with the public key derived from the left 256 bits.
de_de: Der Child public Key wird durch Addition des Parent public Key zu dem public Key, der aus den linken 256 Bits abgeleitet wurde, erzeugt.

source: You can convince yourself that it works by looking at both normal public-key derivation and child public-key derivation in the same picture: see <<fig0428>>.
de_de: Du kannst dich überzeugen, dass das funktioniert, indem du sowohl die normale public Key Herleitung als auch die Child public Key Herleitung im selben Bild betrachtest: siehe <<fig0428>>.

source: Xpub derivation and normal public-key derivation. A normal public key is the starting point _G_ multiplied by a private key. A child public key is the parent public key added to the public key derived from the left-half hash.
de_de: Xpub Herleitung und normale public Key Herleitung. Ein normaler public Key ist der Startpunkt _G_ multipliziert mit einem private Key. Ein Child public Key ist der Parent public Key addiert zu dem public Key, der aus der linken Hashhälfte abgeleitet wurde.

source: The nice thing with elliptic curves is that the special public key “add” operation works a bit like normal add. The same goes for the special public key “multiplication.” You can thus solve some equations:
de_de: Das Schöne an elliptischen Kurven ist, dass die spezielle public Key “Addition” Operation ein bisschen funktioniert wie eine normale Addition. Dasselbe gilt für die spezielle public Key “Multiplikation”. Man kann daher einige Gleichungen lösen:

source: The result, stem:[C=Gc], is exactly how to derive the public key stem:[C] from the private key stem:[c].
de_de: Das Ergebnis, stem:[C=Gc], ist genau wie man den public Key stem:[C] vom private Key stem:[c] ableiten kann.

source: Public key encoding
de_de: Public Key Codierung

source: Do you remember how John’s public key looked like a big number?
de_de: Erinnerst du dich daran, dass Johns public Key wie eine riesige Zahl aussah?

source: That doesn’t look like a pair of coordinates, does it? The public key is encoded in a certain way. Because of the symmetry, exactly two points exist for every value of stem:[x], one with an even stem:[y] value and one with an odd stem:[y] value (<<fig0429>>).
de_de: Das sieht nicht wie ein Koordinatenpaar aus, oder? Der public Key wird auf eine bestimmte Art codiert, Aufgrund der Symmetrie existieren exakt zwei Punkte für jeden Wert von stem\:[x], einer mit einem geraden stem\:[y] Wert und einer mit einem ungeraden stem\:[y] Wert (<<fig0429>>).

source: Each point on the curve has a symmetric point at the same stem:[x] value.
de_de: Jeder Punkt auf der Kurve besitzt einen symmetrischen Punkt am selben stem:[x] Wert.

source: You don’t need to store stem:[y] values, only whether the stem:[y] value is even or odd. You do this by prefixing the stem:[x] value with `02` (even) or `03` (odd). In John’s case, the stem:[y] value happens to be odd, so the prefix is `03`.
de_de: Man braucht die stem:[y] Werte nicht zu speichern, sondern nur, ob der stem:[y] Wert gerade oder ungerade it. Das geschieht, indem man dem stem:[x] Wert eine `02` (gerade) oder `03` (ungerade) voranstellt. In Johns Fall ist der stem:[y] Wert ungerade, also lautet das Prefix `03`.

source: This is why public keys are 33 bytes and not 32 bytes. It’s a 256-bit number—the stem:[x]-coordinate—prefixed by a byte specifying the odd/even property.
de_de: Deshalb sind public Keys 33 Bytes und nicht 32 Bytes lang. Es ist eine 256 Bit Zahl–die stem:[x] Koordinate–mit einem Byte als Prefix, das die Geradzahligkeit oder Parität angibt.

source: The curve in the figure has a single point stem:[x=5, y=0]. This doesn’t look symmetric, but it’s a so-called _double-root_ to the curve—it’s two points with the same stem:[y] value 0. They’re symmetric because they’re at equal distance 5.5 from the symmetry line. In this special case, both these points will use `02` because 0 is even.
de_de: Die Kurve in der Abbildung hat einen einzelnen Punkt stem:[x=5, y=0]. Das sieht nicht symmetrisch aus, aber es ist eine sogenannte _Doppel-Wurzel_ der Kurve—zwei Punkte mit dem selben stem:[y] von 0. Sie sind symmetrisch, weil sie dieselbe Strecke von 5.5 von der Symmetrielinie entfernt sind. In diesem Fall benutzen beide Punkte `02`, weil 0 eine gerade Zahl ist.

source: Let’s look back at what you’ve learned in this chapter. An HD wallet generates a tree of keys from a random seed. It can use key hardening to isolate different branches of the tree from each other.
de_de: Schauen wir zurück, was wir in diesem Kapitel gelernt haben. Ein HD Wallet generiert einen Baum von Keys aus einem zufälligen, sogenannten Random Seed. Es kann Härtung benutzen, um die verschiedenen Zweige des Baumes voneinander zu isolieren.

source: Users back up their keys by writing the random seed in the form of 12 to 24 English words on a piece of paper and lock it up safely.
de_de: Benutzer sichern ihre Keys, indem sie den Random Seed in Form von 12 bis 24 englischen Wörtern auf Papier schreiben und es sicher verwahren.

source: The cafe accepts cookie tokens in its online shop. It only puts the xpub for the online sales account, `M/1'`, on the web server, which can now create as many addresses as needed without using any private keys. The private keys are kept in the cafe’s wallet and never touch the web server.
de_de: Das Café akzeptiert Cookie Token in seinem Online Shop. Es legt nur den xpub für das online Verkaufskonto, `M/1'`, auf den Web Server, der nun so viele Adressen generieren kann wie nötig, ohne dafür einen private Key zu benötigen. Die private Keys liegen im Wallet des Cafés und berühren niemals den Webserver.

source: Our concept table (<<tab0401>>) isn’t updated in this chapter. The wallets described in this chapter work basically as they do in Bitcoin, but they send an email to Lisa instead of sending a transaction across the global Bitcoin network. We’ll get to that in the next chapter.
de_de: Unsere Konzepttabelle (<<tab0401>>) wird in diesem Kapitel nicht aktualisiert. Die Wallets, die hier beschrieben sind, funktionieren im Grunde genauso wie sie es in Bitcoin tun, nur schicken sie Mails an Lisa anstatt Transaktionen ans das globale Bitcoin Netzwerk zu senden. Dazu kommen wir im nächsten Kapitel.

source: | Cookie Tokens | Bitcoin | Covered in | 1 cookie token | 1 bitcoin | <<ch02>> | The spreadsheet | The blockchain | <<ch06>> | Email to Lisa | A transaction | <<ch05>> | A row in the spreadsheet | A transaction | <<ch05>> | Lisa | A miner | <<ch07>>
de_de: | Cookie Tokens | Bitcoin | Behandelt in | 1 Cookie Token | 1 bitcoin | <<ch02>> | Das Spreadsheet | Die Blockchain | <<ch06>> | Email an Lisa | Eine Transaktion | <<ch05>> | Eine Zeile im Spreadsheet | Eine Transaktion | <<ch05>> | Lisa | Ein Miner | <<ch07>>

source: Let’s have a release party! Cookie tokens 4.0, fresh from the lab!
de_de: Feiern wir eine Release Party! Cookie Tokens 4.0, frisch aus dem Labor!

source: 3+|image:{commonimagedir}/new.png[role="gbnew"]4.0
de_de: 3+|image:{commonimagedir}/new.svg[role="gbnew"]4.0
