Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: |Easy to make payments and create new addresses |Mobile app “wallet” |Simplified backups |HD wallets are generated from a seed. Only the seed, 12 to 24 English words, needs to be backed up. |Creating addresses in insecure environments |HD wallets can generate public key trees without ever seeing any of the private keys
de_de: |Einfache Zahlungen und Adresserzeugung |Mobile App “Wallet” |Einfachere Backups |HD Wallets aus Seed generiert. Nur der Seed, 12 bis 24 englische Wörter, wird gesichert. |Adresserzeugung in unsicherer Umgebung |HD Wallets können public Key Bäume erzeugen, ohne je die private Keys zu sehen.

source: |Safe from expensive typing errors |Cookie token addresses |Privacy improvements |A PKH is stored in the spreadsheet instead of a personal name.
de_de: |Sicher gegen teure Tippfehler |Cookie Token Adressen. |Privacy Verbesserungen |Ein PKH statt eines Namens steht im Spreadsheet. |2.0 |Sichere Zahlungen |Digitale Signaturen lösen das Problem mit Betrügern.

source: Suppose all your money is spread over three UTXOs: one with 4 CT, one with 7 CT, and one with 2 CT. Which of these outputs would you spend if you wanted to buy a cookie for 10 CT? What outputs would your transaction have, and what would their CT values be?
de_de: Angenommen, dein ganzes Geld ist auf drei UTXOs verteilt: einen mit 4 CT, einen mit 7 CT und einen mit 2 VT. Welche dieser Outputs würdest du für eine Zahlung von 10 CT verwenden? Welche Outputs hätte deine Transaktion und was wären ihre Werte in CT?

source: What are txids used for in a transaction?
de_de: Für was werden in einer Transaktion txids benutzt?

source: Why do you usually need to add a change output in your transaction?
de_de: Warum besitzt eine Transaktion normalerweise einen Change Output?

source: Where are the signatures located in a transaction?
de_de: Wo liegen in einer Transaktion die Signaturen?

source: Why is the public key needed in the input of a transaction if it spends a p2pkh output?
de_de: Warum wird der public Key im Input einer Transaktion benötigt, die einen p2pkh Output ausgeben will?

source: Why are the signature scripts of a transaction cleaned when your wallet signs the transaction?
de_de: Warum werden die Signatur Scripts einer Transaktion bereinigt, wenn ein Wallet die Transaktion signiert?

source: Where are the pubkey scripts located in a transaction, and what do they contain?
de_de: Wo liegen innerhalb einer Transaktion die Pubkey Scripts und was enthalten sie?

source: What’s required from a Script program (signature script + pubkey script) for an input to be considered authentic?
de_de: Was muss ein Script Programm (Signatur Script + Pubkey Script) erfüllen, damit ein Input als authentisch gilt?

source: How can you recognize a p2sh address?
de_de: Woran kann man eine p2sh Adresse erkennen?

source: Suppose you have 100 CT in a single output at index 7 of a transaction. You want to pay 10 CT to the cafe’s p2pkh address @~C~ and 40 CT to Faiza, Ellen, and John’s charity’s p2sh address @~FEJ~. Construct a single transaction that does this. Please cheat by looking up the exact operators and program templates from this chapter. You don’t have to sign any inputs.
de_de: Angenommen, du hast 100 CT in einem einfachen Output an Index 7 einer Transaktion. Du möchtest 10 CT an die p2pkh Adresse @~C~ des Cafés und 40 CT an Faizas, Ellens und Johns p2sh Wohltätigkeits-Spendenadresse @~FEJ~ zahlen. Konstruiere eine einzige Transaktion, die das erledigt. Bitte schummele, indem du die genauen Operatoren und Programmvorlagen aus diesem Kapitel nachschlägst. Du brauchst die Inputs nicht zu signieren.

source: The UTXO set contains all UTXOs. Suppose it contains 10,000 UTXOs, and you send a transaction to Lisa that has two inputs and five outputs. How many UTXOs will the UTXO set contain after the transaction has been confirmed?
de_de: Das UTXO Set enthält alle UTXOs. Nimm an, es enthält 10.000 UTXOs und du schickst eine Transaktion an Lisa, die zwei Inputs und fünf Outputs enthält. Wie viele UTXOs enthält das UTXO Set, nachdem die Transaktion bestätigt wurde?

source: Create a really simple pubkey script that allows anyone to spend the output. What would the signature script of the spending input contain?
de_de: Erzeuge ein wirklich einfaches Pubkey Script, das jedem das Ausgeben des Outputs erlaubt. Was würde das Signatur Script des ausgebenden Inputs enthalten?

source: Create a pubkey script that requires the spender to provide two numbers in the signature script whose sum is 10 in order to spend the money. An operator called `OP_ADD` takes the top two items from the stack and puts back the sum of those items.
de_de: Erzeuge ein Pubkey Script, das von Ausgebenden verlangt, zwei Zahlen im Signatur Script zu liefern, deren Summe 10 beträgt, damit das Geld ausgegeben werden kann. Ein Operator namens `OP_ADD` nimmt die beiden obersten Elemente vom Stack und legt deren Summe wieder dort ab.

source: Suppose you run a full node and receive money from Faiza in a confirmed transaction. Can you trust that the money from Faiza is real?
de_de: Angenommen, du betreibst einen Full Node und erhältst Geld von Faiza in einer bestätigten Transaktion. Kann du darauf vertrauen, dass das Geld von Faiza echt ist?

source: A public key is visible in the input that spends a p2pkh output. What’s the drawback of this if you have multiple UTXOs for the same PKH? What can you do to avoid this drawback?
de_de: Ein public Key ist in dem Input, der einen p2pkh Output ausgibt, sichtbar. Was ist der Nachteil davon, wenn du mehrere UTXOs an derselben PKH Adresse besitzt? Was kannst du tun, um diesen Nachteil zu vermeiden?

source: Transactions have inputs and outputs, so you can spend multiple “coins” and pay multiple recipients in a single transaction.
de_de: Transaktionen haben Inputs und Outputs, sodass man in einer einzelnen Transaktion mehrere “Coins” ausgeben und an mehrere Empfänger zahlen kann.

source: The outputs of transactions are “programmable.” The sender wallet decides what program to put in the output. This dictates what’s needed to spend the money.
de_de: Die Outputs von Transaktionen sind “programmierbar”. Das Sender-Wallet entscheidet, welches Programm in den Output kommt. Dies gibt die Bedingungen vor, die zum Ausgeben des Geldes nötig sind.

source: Anyone can verify the entire spreadsheet because all signatures are public. This greatly reduces the required trust in Lisa.
de_de: Jeder kann das gesamte Spreadsheet verifizieren, weil die Signaturen öffentlich sind. Das verringert das Mass an notwendigem Vertrauen in Lisa.

source: Scripts can be used to enable multisignature capabilities—for example, three-of-seven capabilities. This is great for companies and charities.
de_de: Scripts können benutzt werden, um Multisignatur-Fähigkeiten zu erreichen–zum Beispiel drei-von-sieben Tauglichkeit von Transaktionen. Das ist grossartig für Firmen und karitative Einrichtungen.

source: A new address type, a p2sh address beginning with `3`, is used to simplify the payment process for a lot of fancy payment types, such as multisignatures.
de_de: Ein neuer Adresstyp, die mit `3` beginnende p2sh Adresse, wird zur Vereinfachung von Bezahlvorgängen bei einer Reihe von Bezahlarten verwendet, zum Beispiel für Multisignaturen.

source: All transactions descend from one or more coinbase transactions. Coinbase transactions are the only way to create money.
de_de: Alle Transaktionen stammen von einer oder mehreren Coinbase Transaktionen ab, Coinbase Transaktionen sind die einzige Art der Geldschöpfung.

source: Money creation is verified by any coworker to make sure Lisa creates exactly as much as agreed: 7,200 CT per day and halving every four years.
de_de: Die Geldschöpfung wird von jedem Kollegen geprüft um sicherzustellen, dass Lisa exakt so viel erzeugt wie vereinbart: 7.200 CT pro Tag, mit einer Halbierung alle vier Jahre.

source: Lisa can censor and revert transactions. You still have to trust her with that.
de_de: Lisa kann Transaktionen zensieren und umkehren. Damit musst du ihr immer noch vertrauen.

source: Improving spreadsheet security
de_de: Sicherheitsverbesserungen am Spreadsheet

source: Reducing wallet bandwidth requirements
de_de: Verringerung des Bandbreitenbedarfs von Wallets

source: In <<ch05>>, we discussed transactions that let anyone verify all transactions in the spreadsheet. But there are still things verifiers can’t verify—that Lisa doesn’t remove or censor transactions. We’ll handle censorship resistance in chapters 7 and 8. This chapter examines how to make it impossible for Lisa to remove or replace transactions without also making it obvious that she’s tampered with the transaction history.
de_de: In <<ch05>> haben wir Transaktionen diskutiert, die jedermann alle Transaktionen im Spreadsheet verifizieren lassen. Aber es bleiben immer noch zwei Dinge, die wir nicht überprüfen können–dass Lisa keine Transaktionen zensiert oder löscht. Wir werden Zensurfestigkeit in Kapitel 7 und 8 behandeln. Dieses Kapitel untersucht, wie es für Lisa unmöglich wird, Transaktionen zu entfernen oder zu ersetzen, ohne dass auffällt, dass sie an der Transaktionshistorie herumgespielt hat

source: Lisa does this by replacing the spreadsheet with a _blockchain_ (<<fig0601>>). The blockchain contains transactions that are secured from tampering through hashing and signing the set of transactions in a clever way. This technique makes it easy to provide cryptographic proof of fraud if Lisa deletes or replaces transactions. All verifiers keep their own copies of the blockchain, and they can fully verify it to ensure that Lisa doesn’t remove already-confirmed transactions.
de_de: Lisa tut dies, indem sie das Spreadsheet durch eine _Blockchain_ (<<fig0601>>) ersetzt. Die Blockchain enthält Transaktionen, die dadurch manipulationssicher gemacht werden, dass eine Gruppe von Transaktionen auf eine clevere Art gehasht und signiert wird. Diese Technik macht es einfach, einen Betrug kryptografisch zu beweisen, falls Lisa Transaktionen löscht oder ersetzt. Alle Prüfer behalten ihre eigenen Kopien der Blockchain und können diese vollständig validieren, um sicherzustellen, dass Lisa keine bereits bestätigten Transaktionen löscht.

source: This chapter also introduces a lightweight wallet, or _simplified payment verification_ (SPV) wallet, that will defer blockchain verification to someone else—a full node—to save bandwidth and storage space. This is possible thanks to the blockchain, but it comes at a cost.
de_de: Dieses Kapitel führt ausserdem ein leichtgewichtiges Wallet, oder _Simplified Payment Verification_ (SPV, vereinfachte Zahlungsprüfung) Wallet, ein, das die Blockchain Verifikation auf jemand anderen verschiebt–einen Full Node–um Bandbreite und Speicherplatz zu sparen. Das wird dank der Blockchain möglich, kostet allerdings an anderer Stelle.

source: The Bitcoin blockchain
de_de: Die Bitcoin Blockchain

source: Lisa can delete transactions
de_de: Lisa kann Transaktionen löschen

source: As noted several times before, Lisa can delete transactions. For example, Lisa could buy a cookie from the cafe, eat it, and delete the transaction. Of course, she wouldn’t do this because she’s the most trustworthy person on earth, but not all her coworkers know or believe this. Suppose she does indeed delete a transaction, as <<fig0602>> shows.
de_de: Wie zuvor mehrfach erwähnt, kann Lisa Transaktionen löschen. Zum Beispiel kann Lisa einen Keks vom Café kaufen, ihn essen und die Transaktion löschen. Natürlich würde sie das nie tun, weil sie vertrauenswürdigste Person der Welt ist, aber nicht alle ihre Kollegen wissen oder glauben dies. Nehmen wir mal an, sie löscht tatsächlich eine Transaktion, wie in <<fig0602>> gezeigt.

source: Lisa buys a cookie and then reverts the transaction. She just stole a cookie from the cafe! The cafe and Lisa now have different UTXO sets.
de_de: Lisa kauft einen Keks und rollt dann die Transaktion zurück. Sie hat dem Café gerade einen Keks gestohlen. Das Café und Lisa haben jetzt unterschiedliche UTXO Sets.

source: Later, when the cafe notices that the transaction has disappeared, it can’t prove that Lisa’s transaction was ever in the spreadsheet. And Lisa can’t prove it wasn’t there. This situation is troublesome. If it’s word against word, you’re in for a long and costly dispute, possibly involving lawyers, police, Acme Insurances, and private detectives.
de_de: Später, wenn das Café merkt, dass die Transaktion verschwunden ist, kann es nicht beweisen, dass die Transaktion je im Spreadsheet enthalten war. Und Lisa kann nicht beweisen, dass die Transaktion nicht darin war. Die Situation ist lästig. Wenn es Aussage gegen Aussage steht, kann man sich auf einen langen, teuren Disput einlassen, möglicherweise mit Rechtsanwälten, Polizei, der Acme Versicherung und Privatdetektiven.

source: How can you prove whether a transaction was confirmed? Lisa needs a way to publish transactions and their ordering such that she can’t tamper with them.
de_de: Wie kann man beweisen, dass eine Transaktion bestätigt war? Lisa braucht einen Weg, die Transaktionen und deren Reihenfolge so zu veröffentlichen, dass sie nicht mehr daran herumspielen kann.

source: Building the blockchain
de_de: Die Blockchain wird gebaut

source: Lisa can delete transactions because no one can prove that the list of all transactions has changed. What if we could change the system to make it provable that she’s fiddled with history?
de_de: Lisa kann Transaktionen löschen, weil niemand beweisen kann, dass sich die Liste der Transaktionen geändert hat. Was, wenn wir das System so ändern, dass nachweisbar wird, wenn sie an der Historie herumfummelt?

source: Among your coworkers, some developers suggest getting rid of the cookie token spreadsheet and replacing it with a blockchain (<<fig0603>>).
de_de: Unter deinen Kollegen schlagen einige Entwickler vor, das Cookie Token Spreadsheet wegzuschmeissen und es durch eine Blockchain zu ersetzen (<<fig0603>>).

source: A blockchain is a chain of blocks. These blocks contain transactions, and each block references its predecessor.
de_de: Eine Blockchain ist eine Kette von Blocks. Diese Blocks enthalten Transaktionen, und jeder Block referenziert seinen Vorgänger.

source: Blockchain length
de_de: Blockchain Länge

source: The Bitcoin blockchain contains hundreds of thousands of blocks. At the time of writing, the chain tip had height 550,836.
de_de: Die Bitcoin Blockchain enthält hunderttausende von Blocks. Zum Zeitpunkt des Schreibens lag die Höhe der Kettenspitze bei 550.836.

source: In the blockchain, each block references the previous block and has an implicit _height_ that says how far it is from the first block. The first block has height 0, the second block has height 1, and so on. In <<fig0603>>, the _chain tip_, or last block, of this blockchain is at height 7, meaning the blockchain is 8 blocks long. Every 10 minutes, Lisa puts recent unconfirmed transactions into a new block and makes it available to everybody who’s interested.
de_de: In der Blockchain zeigt jeder Block auf seinen Vorgängerblock und besitzt eine implizierte _Höhe_, die angibt, wie weit dieser Block vom ersten Block entfernt ist. Der erste Block besitzt Höhe 0, der zweite Höhe 1 und so weiter. In <<fig0603>> ist die _Chain Tip_, also das Kettenende oder der letzte Block bei Höhe 7, was bedeutet, die Blockchain ist 8 Blocks lang. Alle 10 Minuten steckt Lisa unbestätigte Transaktionen zusammen in einen neuen Block und gibt ihn an alle Interessenten frei.

source: The blockchain stores transactions just like the spreadsheet did. But each block also contains a _block header_ to protect the integrity of the contained transactions and the blockchain before it. Let’s say the blockchain in <<fig0603>> has grown to contain 20 blocks, so the chain tip is at height 19. <<fig0604>> zooms in on the last few blocks of the blockchain.
de_de: Die Blockchain speichert Transaktionen, genau wie das Spreadsheet das tat. Aber der Block enthält auch einen _Block Header_, um die Integrität der darin enthaltenen Transaktionen sowie der davor liegenden Blockchain zu schützen. Sagen wir mal, die Blockchain aus <<fig0603>> ist so gewachsen, dass sie 20 Blocks enthält, die Chain Tip also auf Höhe 19 liegt. <<fig0604>> zoomt in die letzten paar Blocks der Blockchain hinein.

source: Each block header protects the integrity of the contained transactions and the blockchain before the block.
de_de: Jeder Block Header schützt die Integrität der in dem Block enthaltenen Transaktionen sowie die Blockchain vor diesem Block.

source: Each block contains one or more transactions and a block header. The block header consists of
de_de: Jeder Block enthält eine oder mehrere Transaktionen und einen Block Header. Der Block Header besteht aus

source: The double SHA256 hash of the previous block’s header
de_de: Dem Doppel-SHA256 Hash des Vorgänger Block Headers.

source: The combined hash of the transactions in the block, the _merkle root_
de_de: Dem kombinierten Hash der Transaktionen im Block, der Merkle'schen Wurzel oder _Merkle Root_.

source: A timestamp of the block’s creation time
de_de: Einem Zeitstempel des Herstellungszeitpunkts dieses Blockes

source: Lisa’s signature of the block header
de_de: Lisas Signatur des Block Headers

source: The hash of a block header is an identifier for the block, just as a transaction hash, or transaction ID (txid), is an identifier for a transaction. I’ll sometimes refer to the block header hash as the _block ID_.
de_de: Der Hash eines Block Headers ist eine Kennung, ein Identifier für den Block, genauso wie ein Transaction Hash, oder eine Transaktions-ID (txid) eine Kennung oder ein Identifier für eine Transaktion ist. Ich bezeichne Block Header auch gelegentlich als _Block ID_.

source: The leftmost part of the block header is the block ID of the previous block in the blockchain. This is why it’s called a block_chain_. The previous block-header hashes form a chain of block headers.
de_de: Der linke Teil des Block Headers ist die Block ID des Vorgängerblockes in der Blockchain. Deshalb heisst das Ganze dann Block_chain_. Die vorigen Block Header Hashes bilden eine Kette, oder Chain, aus Block Headern.

source: The second part from the left is the combined hash of the transactions. This is the _merkle root_ of a _merkle tree_. We’ll talk about this in later sections of this chapter, but for now, let’s just say that the transactions in the block are hashed together into a single hash value that’s written into the block header. You can’t change any transactions in the block without also changing the merkle root.
de_de: Der zweite Teil von links ist der kombinierte Hash aller Transaktionen. Dies ist der _Merkle Root_ von einem _merkle tree_, die Merkle'sche Wurzel eines Merkle'schen Baumes. Wir werden das in späteren Abschnitten dieses Buches besprechen, aber für den Moment sagen wir einfach, dass die Transaktionen im Block zu einem einzigen Hashwert zusammengehasht werden, der in den Block Header geschrieben wird. Man kann keine Transaktion im Block ändern, ohne damit den Merkle Root zu ändern.

source: The third part from the left is the block’s creation time. This time isn’t exact and doesn’t even always increase from block to block. But it’s roughly accurate.
de_de: Der dritte Teil von links ist die Herstellungszeit des Blockes. Diese Zeit ist nicht genau und steigt von Block zu Block nicht einmal in jedem Fall an, aber sie stimmt zumindest grob.

source: The fourth part is Lisa’s block signature, which is a stamp of approval from Lisa that anyone can verify. Lisa’s signature proves that she once approved the block, which can be held against her if she tries to cheat. You’ll see how this works shortly. The digital signature in the block header introduces some problems, which we’ll fix in <<ch07>> by replacing these digital signatures with something called _proof of work_.
de_de: Der vierte Teil ist Lisas Block Signatur, die ein Genehmigungsstempel von Lisa ist, den jeder verifizieren kann. Lisas Signatur beweist, dass sie den Block einmal genehmigt hatte, was gegen sie verwendet werden könnte, falls sie einmal mogeln sollte. Du wirst gleich sehen, wie das funktioniert. Die digitale Signatur im Block Header führt neue Probleme ein, die wir in <<ch07>> beheben werden, indem wir die digitale Signatur durch etwas ersetzen werden, das wir _Proof of Work_ nennen werden.

source: Lisa builds a block
de_de: Lisa produziert einen Block

source: Shared folder? Really?
de_de: Geteilter Ordner? Ernsthaft?

source: Bitcoin doesn’t use a shared folder. The shared folder is a placeholder for Bitcoin’s peer-to-peer network, which we’ll look at in <<ch08>>.
de_de: Bitcoin benutzt keine geteilten Ordner. Der geteilte Ordner ist ein Platzhalter für Bitcoins Peer-to-Peer Netzwerk, das wir in <<ch08>> näher betrachten werden.

source: Lisa creates a new block roughly every 10 minutes, containing unconfirmed transactions. She writes this block into a new file in a shared folder. Everyone has permission to create new files in the shared folder, but no one has permission to delete or change files. When Lisa writes a block to a file in the shared folder, she _confirms_ the transactions in that block.
de_de: Lisa erzeugt grob alle 10 Minuten einen neuen Block, der unbestätigte Transaktionen enthält. Sie schreibt den Block in eine neue Datei in einem geteilten Ordner, oder _Share_. Jeder hat die Zugriffsrechte, um neue Dateien in dem Share anzulegen, aber niemand hat die Rechte, Dateien zu ändern oder zu löschen. Wenn Lisa einen Block in eine Datei in dem Share schreibt, _bestätigt_ sie die Transaktionen in dem Block.

source: Suppose Lisa is about to create a new block at height 20. She’ll do the following:
de_de: Angenommen, Lisa ist dabei, einen neuen Block auf Höhe 20 zu erstellen. Sie tut folgendes:

source: Create a block template.
de_de: Erzeugt eine Blockschablone.

source: Sign the block template to make it complete.
de_de: Signiert die Blockschablone, um sie zu vervollständigen.

source: Publish the block.
de_de: Veröffentlicht den Block.

source: Block templates
de_de: Blockschablonen

source: Lisa starts by creating the _block template_, a block without a signature (<<fig0605>>).
de_de: Lisa beginnt, indem sie eine _Blockschablone_ erstellt, einen Block ohne Signatur (<<fig0605>>).

source: Lisa creates a new block. It’s called a _block template_ because it isn’t yet signed.
de_de: Lisa erstellt den neuen Block. Wir nennen ihn _Blockschablone_ weil er noch nicht signiert ist.

source: She collects several transactions to put in the block. She then creates the block header. She creates the previous block ID by hashing the previous block header and putting the result in the new block header. The merkle root is built using the transactions in the block template, and the time is set to the current time.
de_de: Sie sammelt mehrere Transaktionen, die sie dem Block hinzufügen will. Dann erzeugt sie den Block Header. Sie erzeugt die Vorgänger-Block ID, indem sie den Block Header des Vorgängerblocks hasht und das Ergebnis in den neuen Block Header schreibt. Der Merkle Root wird anhand der Transaktionen in der Blockschablone ermittelt und die Zeit wird auf die aktuelle Zeit gesetzt.

source: Block rewards
de_de: Blockvergütung

source: In Bitcoin, the block reward covers more than just the newly created money. It also includes transaction fees, discussed in <<ch07>>. The newly created money in a block is called the _block subsidy_.
de_de: In Bitcoin enthält die Blockvergütung mehr als nur das neu geschaffene Geld. Es führt auch Transaktionsgebühren ein, die in <<ch07>> diskutiert werden. Das neu erzeugte Geld in einem Block wird als _Blocksubvention_ oder _block subsidy_ bezeichnet.
