Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: Properties 2 and 4 are lacking.
de_de: Eigenschaften 2 und 4 fehlen.

source: Second-pre-image resistance is stopping the attacker. The attacker needs to find an input that gives the same hash as a certain other input: the cat picture.
de_de: Second-Pre-Image Resistenz stoppt den Angreifer. Der Angreifer muss einen Input finden, der denselben Hash liefert wie ein bestimmter anderer Input: das Katzenbild.

source: The money supply increase rate will decrease over time because the reward to Lisa halves every 4 years. This means the total amount of CT to ever be created will be about 21,000,000.
de_de: Das Geldmengenwachstum verringert sich im Laufe der Zeit, weil die Belohnung an Lisa sich alle 4 Jahre halbiert. Das bedeutet, die Gesamtmenge an CT, die jemals erzeugt werden wird, wird ungefähr 21.000.000 betragen.

source: The coworkers have read access to the spreadsheet. They can watch the spreadsheet and verify that Lisa doesn’t reward herself too much or too often.
de_de: Die Kollegen haben Lesezugriff auf das Spreadsheet. Sie können das Spreadsheet beobachten und verifizieren, dass Lisa sich nicht zu viel oder zu häufig selbst belohnt.

source: The private key is created using a random number generator of some sort. A simple one is a coin that you flip 256 times to generate your 256-bit private key. You can also use your operating system’s built-in random number generator.
de_de: Der private Key wird mit Hilfe irgendeiner Art von Zufallszahlengenerator erzeugt. Ein Einfacher ist eine Münze, die man 256 mal wirft, um seinen 256 Bit Key zu generieren. Du kannst auch den in deinem Betriebssystem eingebauten Zufallszahlengenerator benutzen.

source: The private key.
de_de: Der private Key.

source: The message is hashed because you want signatures to be small and fixed in size. You don’t want the signatures to be big just because the signed message is big.
de_de: Die Message wird gehasht, weil du willst, dass die Signatur klein und von fester Grösse ist. Du willst keine grossen Signaturen haben, bloss weil die signierte Nachricht gross ist.

source: Mallory would need John’s private key to steal cookies from him. She would also need his name, John, to write into the email to Lisa, but that’s easily available in the spreadsheet.
de_de: Mallory würde Johns private Key brauchen, um von ihm Kekse zu klauen. Sie würde auch seinen Namen, John, brauchen, um ihn in die Mail an Lisa zu schreiben, aber der steht ja frei zugänglich im Spreadsheet.

source: Fred can use your public key to encrypt the message and send the encrypted message to you. You can then decrypt that message using your private key.
de_de: Fred kann deinen public Key benutzen, um die Nachricht zu verschlüsseln und dir zu schicken. Du kannst dann die Nachricht mit deinem private Key entschlüsseln.

source: You sign the message using your private key and write the digital signature onto the note in the bottle. Fred can then verify that the signature is in fact made with your private key. He does this by using your public key to decrypt the signature and comparing the decrypted hash with the actual hash of the message. If they match, he can be sure the message is from you.
de_de: Du signierst die Nachricht mit deinem private Key und schreibst die digitale Signatur auf die Notiz in der Flasche. Fred kann dann verifizieren, dass die Signatur in der Tat mit deinem private Key angefertigt wurde. Er tut dies, indem er deinen public Key zum Entschlüsseln der Signatur benutzt und den entschlüsselten Hash mit dem Hash der Nachricht vergleicht. Wenn sie übereinstimmen, kann er sicher sein, dass die Nachricht von dir stammt.

source: Chapter 3
de_de: Kapitel 3

source: The PKH is made short because a) it makes the spreadsheet smaller in size and b) it makes cookie token addresses (and Bitcoin addresses) shorter to write for a user.
de_de: Der PKH ist kurz ausgelegt, weil es a) das Spreadsheet von der Grösse her kleiner macht und b) der Benutzer bei Cookie Token Adressen (und Bitcoin Adressen) weniger schreiben muss.

source: Yes, you can. There’s a base58check decoding algorithm that does this.
de_de: Ja, du kannst. Es gibt einen base58check Dekodieralgorithmus, der das macht.

source: It’s used by a payer to translate the recipient’s address into a PKH. The payer needs to write the recipient’s PKH in the email to Lisa.
de_de: Es wird von einem Zahler benutzt, um die Empfängeradresse in einen PKH zu übersetzen. Der Zahler muss den PKH des Empfängers in die Mail an Lisa schreiben.

source: Let’s base58-encode 0047 step by step:
de_de: Lass uns 0047 base58-codieren, Schritt für Schritt:

source: Remove leading 00 bytes. There is one, which leaves you with 47.
de_de: Entferne führende 00 Bytes. Es gibt davon nur eines, was dir 47 übrig lässt.

source: Convert to a decimal number: 47 in hex is 4 × 16 + 7 = 71 in decimal.
de_de: Konvertiere da in eine Dezimalzahl: 47 in Hex ist 4 × 16 + 7 = 71 in Dezimal.

source: Divide 71 by 58: 71 = 1 × 58 + 13. The quotient is 1, and the remainder is 13.
de_de: Dividiere 71 durch 58: 71 = 1 × 58 + 13. Der Quotient ist 1 und der Rest ist 13.

source: Divide the quotient, 1, by 58: 1 = 0 × 58 + 1. The quotient is 0, and the remainder is 1.
de_de: Dividiere den Quotienten, 1, durch 58: 1 = 0 × 58 + 1. Der Quotient ist 0 und der Rest ist 1.

source: Look up the remainders 13 and 1. Result: E and 2.
de_de: Schlage die Reste 13 and 1 nach. Resultat: E und 2.

source: Add a 1 for the removed 00 byte in step 1, which results in E21.
de_de: Addiere eine 1 für das entfernte 00 Byte aus Schritt 1, was in E21 resultiert.

source: Reverse it: 12E. Done.
de_de: Drehe es um: 12E. Fertig.

source: The 4-byte checksum.
de_de: Die 4-Byte Checksumme.

source: He must make two separate payments. For example: payment 1 pays 2 CT from @~1~ to the cafe, and payment 2 pays 8 CT from @~2~ to the cafe. Another way is to first pay 2 CT from @~1~ to @~2~ and then pay 10 CT from @~2~ to the cafe.
de_de: Er muss zwei getrennte Zahlungen machen. Zum Beispiel: Zahlung 1 zahlt 2 CT von @~1~ an das Café und Zahlung 2 zahlt 8 CT von @~2~ an das Café. Man könnte auch erst 2 CT von @~1~ an @~2~ zahlen und dann 10 CT von @~2~ an das Café.

source: Yes it is. Base58check-encode the PKHs to get the addresses.
de_de: Ja, es ist. Base58check-codiere die PKHs, um die Adresse zu bekommen.

source: No, because the spreadsheet contains PKHs. Because cryptographic hash functions are one-way functions, you can’t go from PKH to public key.
de_de: Nein, weil das Spreadsheet PKHs enthält. Da kryptografische Hashfunktionen Einbahn-Funktionen sind, kannst du aus dem PKH nicht den public Key herleiten.

source: They can look at the amounts. Many of the 10 CT payments are probably cookie purchases.
de_de: Sie können die Beträge betrachten. Viele der 10 CT Zahlungen sind wahrscheinlich Käufe von Keksen.

source: The bad guy can’t steal cookie tokens because he needs the public key to exploit the flaw in the public key derivation function. The spreadsheet contains PKHs; the bad guy can’t get the public key from it.
de_de: Der Bösewicht kann keine Cookie Tokens stehlen, weil er den public Key bräuchte, um den Fehler in der public Key Ableitungsfunktion auszunutzen. Das Spreadsheet enthält PKHs; der Bösewicht kann daraus nicht den public Key herleiten.

source: The bad guy needs the private key to sign fraudulent emails to Lisa. Even though he can reverse RIPEMD160, he’d still need to pre-image attack SHA256 and reverse the public key derivation function to get to a working private key.
de_de: Der Bösewicht braucht den private Key, um betrügerische Mails an Lisa zu schicken. Auch wenn er RIPEMD160 umdrehen kann, muss er immer noch eine Pre-Image Attacke aus SHA256 führen und die public Key Ableitungsfunktion umkehren, um zu einem funktionierenden private Key zu kommen.

source: Chapter 4
de_de: Kapitel 4

source: Each character corresponds to 6 bits of entropy because 2^6^ = 64. Ten such characters make 60 bits of entropy, which corresponds to 60 coin flips.
de_de: Jedes Zeichen korrespondiert mit 6 Bits Entropie, weil 2^6^ = 64. Zehn solche Zeichen ergeben 60 Bits Entropie, was 60 Münzwürfen entspricht.

source: The four problems:
de_de: Die vier Probleme:

source: Passwords are easily forgotten.
de_de: Passwörter werden schnell vergessen.

source: Randomness is hard.
de_de: Zufälligkeit ist schwierig.

source: The security of a password decreases as technology improves.
de_de: Die Sicherheit eines Passworts sinkt mit fortschreitender Technologie.

source: You need to keep track of two items: the backup _and_ the password. This increases the risk that the backup is lost.
de_de: Du musst zwei Dinge m Auge behalten: das Backup _und_ das Passwort. Dies erhöht das Risiko, dass das Backup verloren ist.

source: The seed is created by using a random number generator—for example, a series of coin flips or the random number generator provided by your operating system.
de_de: Der Seed wird unter Benutzung eines Zufallszahlengenerators erzeugt–zum Beispiel einer Serie von Münzwürfen oder dem Zufallszahlengenerator, den dein Betriebssystem liefert.

source: The xprv at path `m/2/1` and the wanted index `7`.
de_de: Der xprv an Pfad `m/2/1` und der gewünschte Index `7`.

source: No, you would need xprv `m/2/1` to derive xpub `M/2/1/7'`. You first derive hardened xprv `m/2/1/7'` from `m/2/1` using hardened xprv derivation and then calculate the xpub `M/2/1/7'` from `m/2/1/7'`.
de_de: Nein, du bräuchtest xprv `m/2/1`, um xpub `M/2/1/7'` abzuleiten. Du leitest erst den gehärteten xprv `m/2/1/7'` von `m/2/1` mittels gehärteter xprv Ableitung her und berechnest dann den xpub `M/2/1/7'` aus `m/2/1/7'`.

source: You can use the following procedure to get the master xprv:
de_de: Du kannst wie folgt vorgehen, um den Master xprv zu erhalten:

source: Use master xpub `M` to derive xpub `M/4` and remember the left-half hash, L~4~.
de_de: Benutze den Master xpub `M`, um den xpub `M/4` abzuleiten, und merke dir den links-links Hash L~4~.

source: Use `M/4` to derive the left-half hash L~41~ at index 1.
de_de: Benutze `M/4`, um den links-links Hash L~41~ an Index 1 abzuleiten.

source: Subtract L~41~ from the private key `m/4/1` to get private key `m/4`.
de_de: Subtrahiere L~41~ vom private Key `m/4/1`, um den private Key `m/4` zu erhalten.

source: Subtract L~4~ from the private key `m/4` to get private key `m`.
de_de: Subtrahiere L~4~ vom private Key `m/4`, um den private Key `m` zu bekommen.

source: `m` together with the chain code of xpub `M` is the master xprv.
de_de: `m` zusammen mit dem Chain Code von xpub `M` ist der Master xprv.

source: Yes, you’d be able to steal all funds in any addresses because you can calculate the master xprv.
de_de: Ja, du wärst in der Lage, alles Geld in jeder Adresse zu stehlen, weil du den Master xprv berechnen könntest.

source: The victim could have used hardening to generate `m/4'` instead. This way, you wouldn’t be able to get the master xprv. If you stole `m/4'/1` and the master xpub, you would only be able to steal funds on the `m/4'/1` key. You wouldn’t be able to calculate the `M/4'` xpub.
de_de: Das Opfer hätte stattdessen Härtung benutzen können, um `m/4'` zu generieren. Dann könntest du nicht den Master xprv bekommen. Wenn du `m/4'/1` und den Master xpub stehlen würdest, könntest du nur das Geld auf dem `m/4'/1` Key stehlen. Du könntest nicht den `M/4'` xpub berechnen.

source: The employees can import the xpub for the counter sales account. They will then be able to generate any public keys under that account and thus generate as many addresses as they need without ever having to know any private keys.
de_de: Die Angestellten können den xpub für das Thekenverkaufskonto importieren. Dann können sie alle public Keys unter diesem Konto generieren, und daher alle Adressen, die sie brauchen, ohne jemals irgendeinen private Key kennen zu müssen.

source: Your (and Anita’s) wallet can generate 10 addresses ahead of time and monitor the spreadsheet for those addresses. If Anita gets paid to one of these addresses—probably the first of those 10—then your wallet won’t reuse that address when you request a payment from a customer. You would instead take the next unused address.
de_de: Dein (und Anitas) Wallet kann 10 Adressen im voraus generieren, und das Spreadsheet im Hinblick auf diese Adressen beobachten. Wenn Anita an einer dieser Adressen eine Zahlung empfängt–vermutlich auf der ersten der 10–, dann wird dein Wallet diese Adresse nicht erneut benutzen, wenn du eine Zahlung von einem Kunden anforderst. Es würde stattdessen die nächste unbenutzte Adresse nehmen.

source: Chapter 5
de_de: Kapitel 5

source: You would spend the 4 CT and the 7 CT outputs. The new outputs would be 10 CT to the cafe and 1 CT in change to an address you control.
de_de: Du würdest die 4 CT und die 7 CT Outputs verwenden. Die neuen Outputs wären 10 CT an das Café und 1 CT an Change an eine Adresse, die dir gehört.

source: They’re used in inputs to reference transactions from which to spend outputs.
de_de: Sie werden in Inputs benutzt, um Transaktionen zu referenzieren, von denen Outputs ausgegeben werden sollen.

source: Because you can’t spend part of a transaction output. You either spend the output or you don’t. If the spent output contains more value than you’re paying, you need to give back change to yourself.
de_de: Weil du nicht einen Teil eines Transaktionsoutputs ausgeben kannst. Du gibst den Output entweder komplett aus oder gar nicht. Wenn der ausgegebene Output mehr Wert enthält als du zahlst, musst du Wechselgeld, also Change, an dich zurück zahlen.

source: In the signature scripts in the inputs.
de_de: In den Signatur Scripts in den Inputs.

source: Because the verifiers need to know what public key to verify the signature with. You can’t verify the signature with a PKH, so you need to explicitly reveal the public key in the signature script.
de_de: Weil die Prüfenden wissen müssen, mit welchem public Key du die Signatur verifizierst. Du kannst die Signatur nicht mit einem PKH überprüfen, also musst du den public Key im Signatur Script explizit preisgeben.

source: The signature scripts are cleaned so that verifiers don’t have to know the order in which the inputs are signed.
de_de: Die Signatur Scripts werden bereinigt, so dass die Prüfer die Reihenfolge, in denen die Inputs signiert wurden, nicht kennen müssen.

source: Each output of a transaction contains a pubkey script. It contains the second part of a script program. The first part will be provided later, when the output is spent.
de_de: Jeder Output einer Transaktion enthält ein Pubkey Script. Es enthält den zweiten Teil des Script Programms. Der erste Teil wird später geliefert, wenn der Output ausgegeben wird.

source: The Script program must end with OK on top of the stack.
de_de: Das Script Programm muss mit einem OK ganz oben auf dem Stack enden.

source: A p2sh address always starts with a `3`. You can also recognize it by base58check-decoding it and looking at the first byte. If that byte is 05, it’s a p2sh address.
de_de: Eine p2sh Adresse beginnt stets mit einer `3`. Du kannst sie auch dadurch erkennen, dass du sie base58check-decodierst und dir das erste Byte anschaust. Wenn das Byte 05 ist, ist es eine p2sh Adresse.

source: You’ll create a transaction with one input and three outputs:
de_de: Du erzeugst eine Transaktion mit einem Input und drei Outputs:

source: 10,003 UTXOs. You remove two UTXOs by spending two outputs, and you add five new UTXOs. The net effect on the UTXO set is thus +3 UTXOs.
de_de: 10.003 UTXOs. Du entfernst zwei UTXOs, indem du deren Outputs ausgibst, und du fügst fünf neue UTXOs hinzu. Der Nettoeffekt auf das UTXO Set beträgt somit +3 UTXOs.

source: The pubkey script can be, for example, `1`. The spending input can have an empty signature script. The full Script program just puts a `1` on the stack. A result stack with non-zero on top means OK.
de_de: Das Pubkey Script kann zum Beispiel `1 ` sein. Der ausgebende Input kann ein leeres Signatur Script haben. Das volle Script Programm legt nur eine `1` auf den Stack. Ein Ergebnis-Stack mit einem Wert ungleich Null oben auf dem Stack bedeutet OK.

source: `OP_ADD 10 OP_EQUAL`. This will first add the two top items on the stack and put the result back on top. Then, you’ll push the number 10 to the stack and compare the two top items. If they’re equal, OK will be pushed to the stack.
de_de: `OP_ADD 10 OP_EQUAL`. Dies wird erst die beiden obersten Elemente auf dem Stack addieren und das Resultat wieder oben ablegen. Dann schiebst du die Zahl 10 auf den Stack und vergleichst die beiden Elemente. Wenn sie gleich sind, wird OK auf den Stack gelegt.

source: Yes. Your full node verifies everything in the spreadsheet from the very first transaction up to the transaction containing your money from Faiza. It verifies (among other things) the following:
de_de: Ja. Dein Full Node verifiziert alles im Spreadsheet von der allerersten Transaktion bis zu der Transaktion, die dein Geld von Faiza enthält. Es verifiziert (unter anderem) das Folgende:

source: Lisa created the expected number of coinbase transactions with the correct amounts in them.
de_de: Lisa hat die erwartete Anzahl Coinbase Transaktionen mit den korrekten Beträgen darin erzeugt.

source: For each transaction in the spreadsheet, the value sum of outputs doesn’t exceed the value sum of inputs.
de_de: Für jede Transaktion im Spreadsheet überschreitet der Wert der Summe der Outputs nicht den Wert der Summe der Inputs.

source: All signatures from Faiza’s payment back to all coinbase transactions are OK.
de_de: Alle Signaturen von Faizas Zahlung zurück bis zu allen Coinbase Transaktionen sind OK.

source: If there are several UTXOs to the same PKH, then as soon as one of them is spent, the security of the other UTXOs to the same PKH will be degraded. This is because you remove a layer of security, the cryptographic hash function. From this point, you rely solely on the public key derivation function to be secure. You can avoid this problem by using unique addresses for all your incoming payments. Then, all your UTXOs will have different PKHs.
de_de: Wenn mehrere UTXOs für dieselbe PKH vorhanden sind, wird die Sicherheit der anderen UTXOs für dieselbe PKH beeinträchtigt, sobald eine davon ausgegeben wird. Dies liegt daran, dass du eine Sicherheitsebene entfernst, die kryptografische Hash-Funktion. Ab diesem Zeitpunkt verlässt du dich ausschließlich auf die Funktion zur Ableitung des public Keys, um sicher zu sein. Du kannst dieses Problem vermeiden, indem du für alle eingehenden Zahlungen eindeutige Adressen verwendest. Dann haben alle deine UTXOs unterschiedliche PKHs.

source: Chapter 6
de_de: Kapitel 6

source: By the previous block’s block ID, which is the hash of the previous block’s header.
de_de: Über die Block ID des Vorgängerblocks, welcher der Hash des Block Headers des Vorgängerblocks ist.

source: The merkle root of a block commits to all transactions in that block.
de_de: Der Merkle Root bindet sich an alle Transaktionen in diesem Block.

source: Lisa’s block signature commits to the timestamp, the merkle root (and indirectly all transactions in this block), and the previous block ID (and indirectly the whole blockchain before this block).
de_de: Lisas Block Signatur bindet sich an den Timestamp, den Merkle Root (und damit indirekt an alle Transaktionen in diesem Block) und die Vorgänger-Block-ID (und damit indirekt an die gesamte Blockchain vor diesem Block).

source: The first transaction in each block is a coinbase transaction. This coinbase transaction creates 50 new cookie tokens and sends them to Lisa’s cookie token address.
de_de: Die erste Transaktion in jedem Block ist die Coinbase Transaktion. Diese Coinbase Transaktion erzeugt 50 neue Cookie Tokens und schickt diese an Lisas Cookie Token Adresse.

source: All transactions. The hash functions will all result in an index containing `1` because there are no zeroes in the bloom filter. Any item in the transaction that you test will be a positive.
de_de: Alle Transaktionen. Die Hashfunktionen resultieren alle in einem Index, der `1` enthält, weil es keine Nullen im Bloom Filter gibt. Jedes Element in der Transaktion, die du prüfst, wird ein Treffer sein.

source: The following are tested:
de_de: Das Folgende wird geprüft:

source: The txid together with the index that identifies the output to spend
de_de: Die txid zusammen mit dem Index, der den auszugebenden Output identifiziert.

source: All data items in the signature scripts
de_de: Alle Datenobjekte in den Signatur Scripts.

source: All data items in the pubkey scripts
de_de: Alle Datenobjekte in den Pubkey Scripts.

source: They aren’t pre-image resistant, collision resistant, or second-pre-image resistant. The output space is small—typically just a few hundred to a few thousand numbers. It will take only a fraction of a second to find a pre-image of, for example, `172`.
de_de: Sie sind nicht Pre-Image resistent, kollisionsresistent oder second-Pre-Image resistent. Der Output-Raum ist klein–typischerweise nur ein paar hundert bis ein paar tausend Zahlen. Es würde nur einen Bruchteil einer Sekunde dauern, um ein Pre-Image für, zum Beispiel, `172` zu finden.

source: The rightmost leaf must be copied to make an even number of leaves. The same goes for the next level, where the third hash needs to be copied.
de_de: Das am weitesten rechts stehende Blatt muss kopiert werden, um zu einer geraden Anzahl Blätter zu kommen. Dasselbe gilt für die nächste Ebene, wo der dritte Hash kopiert werden muss.

source: If Lisa’s private block-signing key is stolen, the thief can create blocks in Lisa’s name. Also, if a bad guy replaces Lisa’s block-signing public key on one or more sources, such as the bulletin board or the intranet, the bad guy can fool people into accepting blocks not signed by Lisa.
de_de: Wenn Lisas privater Block-Signatur-Key gestohlen wird, kann der Dieb Blocks in Lisas Namen erzeugen. Und wenn ein Bösewicht Lisas Block-Signatur-publik-Key an einer oder mehreren Stellen ersetzt, zum Beispiel am schwarzen Brett oder im Intranet, kann der Bösewicht die Leute dazu bekommen, Blocks zu akzeptieren, die nicht von Lisa signiert wurden.

source: Lisa can censor transactions, and the shared folder administrator can censor blocks.
de_de: Lisa kann Transaktionen zensieren, und der Administrator des Shared Folders kann Blocks zensieren.

source: a) Yes, a new node that downloads all blocks from the shared folder will notice that there are two versions of the block. b) Yes, an old node that has already downloaded the original block will detect that there is an alternate version of the block.
de_de: a) Ja, ein neuer Node, der alle Blocks vom Shared Folder herunterlädt, wird merken, dass es zwei Versionen des Blocks gibt. b) Ja, ein alter Node, der den Originalblocks bereits heruntergeladen hat, wird merken, dass es eine alternative Version des Blocks gibt.

source: The bits at indexes `1`, `5`, `6`, and `7` are set to 1 and the other to 0. The full node would _not_ send this transaction to the lightweight wallet. Nothing that’s tested hashes to only indexes where the bits are `1`. This was something of a trick question, because the spent txid and the output index of the spent transaction aren’t tested individually, so 1,6,6 will never be considered by the full node.
de_de: Die Bits an den Indizes `1`, `5`, `6` und `7` werden auf 1 gesetzt und die anderen auf 0. Der Full Node würde seine Transaktion _nicht_ an das Lightweight Wallet schicken. Nichts, das getestet wird, hasht nur zu Indizes, wo die Bits `1` sind. Das war ein bisschen eine Trickfrage, weil die ausgegebene txid und der Output Index der ausgegebenen Transaktion nicht einzeln getestet werden, sodass 1,6,6 nie vom Full Node in Betracht gezogen wird.
