Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: A lot of risks seem to be inherent in this setup, but what if Faiza gives the private key to her two charity partners? Then, all partners can spend the money. This will solve problems 1 and 2, but problems 3 and 4 would be worse because now any of the three partners might be sloppy with private-key security or run away with the money.
de_de: In diesem Aufbau scheint eine Menge Risiko zu stecken, aber was, wenn Faiza den private Key ihren beiden Wohltätigkeits-Kollegen gibt? Dann kann jeder von denen das Geld ausgeben. Das löst Probleme 1 und 2, aber Probleme 3 und 4 würden schlimmer werden, weil jetzt jeder der drei den private Key nachlässig sichern oder mit dem Geld durchbrennen könnte.

source: This organization consists of three people. It would be better if these three people could _share the responsibility and the power over the money_ somehow. Thanks to the Script programming language, they can accomplish this.
de_de: Die Organisation besteht aus drei Leuten. Es wäre besser, wenn diese drei irgendwie _die Verantwortung und Kontrolle über das Geld teilen_ könnten. Dank der Script Programmiersprache können sie dies tun.

source: They can create one private key each and demand that two of the three keys must sign the transaction to spend the charity funds. (<<fig0518>>).
de_de: Sie können je einen private Key erzeugen und verlangen, dass zwei der drei Keys die Transaktion signieren, bevor die Spenden ausgegeben werden können. (<<fig0518>>).

source: Multisignature setup between Faiza, Ellen, and John. Two of the three keys are needed to spend money.
de_de: Multisignatur-Aufbau zwischen Faiza, Ellen und John. Zwei der drei Keys sind nötig, um auf das Geld zuzugreifen.

source: This brings some good properties to the charity fundraising account:
de_de: Dies führt einige gute Eigenschaften in den Wohltätigkeits-Fonds ein:

source: If one of the three keys is stolen, the thief can’t steal the money.
de_de: Wenn einer der drei Keys gestohlen wird, kommt der Dieb trotzdem nicht an das Geld heran.

source: If one of the three keys is lost due to sloppy backups or death, then the other two keys are enough to spend the money.
de_de: Wenn einer der drei Keys aufgrund von Nachlässigkeit oder Tod verlorengeht, dann reichen die anderen beiden Keys aus, um das Geld zu verwenden.

source: Out of the three partners, no single person can singlehandedly run away with the money.
de_de: Von den dreien kann nicht einer einfach mit dem Geld verschwinden.

source: <<fig0519>> shows a script program that enforces the two-of-three rule.
de_de: <<fig0519>> zeigt ein Script Programm, das die zwei-aus-drei Regel umsetzt.

source: There is a bug in Bitcoin software that causes `OP_CHECKMULTISIG` to need an extra dummy item first in the signature script.
de_de: Es gibt einen Bug in der Bitcoin Software, der verursacht, dass `OP_CHECKMULTISIG` ein zusätzliches Dummy-Element am Beginn des Signatur Scripts verlangt.

source: A program that enforces two signatures out of three possible keys. The secret sauce is `OP_CHECKMULTISIG`.
de_de: Ein Programm, das zwei Signaturen aus drei möglichen Keys erfordert. Das Geheimrezept ist `OP_CHECKMULTISIG`.

source: The `OP_CHECKMULTISIG` operator instructs Lisa to verify that the two signatures in the signature script are made with the keys in the pubkey script. Lisa runs the program in <<fig0520>>.
de_de: Der `OP_CHECKMULTISIG` Operator instruiert Lisa, zu prüfen, dass die zwei Signaturen im Signatur Script mit den Keys im Pubkey Script erzeugt wurden. Lisa lässt das Programm in <<fig0520>> laufen.

source: Moving some data items to the stack
de_de: Ablegen einiger Datenelemente auf den Stack.

source: The top eight data items in the program are put on the stack. Then the only operator, `OP_CHECKMULTISIG`, runs, as illustrated in <<fig0521>>. `OP_CHECKMULTISIG` takes a number, `3` in this case, from the stack and then expects that number of public keys from the stack followed by another number. This second number dictates how many signatures are needed to spend the money. In this case, the number is `2`. Then, the operator takes the expected number of signatures from the stack, followed by the dummy mentioned earlier. You don’t use the dummy item.
de_de: Die obersten acht Datenobjekte im Programm werden auf den Stack gelegt. Danach wird der einzige Operator, `OP_CHECKMULTISIG`, gestartet, wie in <<fig0521>> dargestellt. `OP_CHECKMULTISIG` nimmt eine Zahl, in diesem Fall `3`, vom Stack herunter und erwartet dann diese Anzahl public Keys auf dem Stack, gefolgt von einer weiteren Zahl. Diese zweite Zahl gibt an, wie viele Signaturen zum Ausgeben des Geldes benötigt werden. In diesem Fall ist die Zahl `2`. Der Operator nimmt dann die erwartete Anzahl Signaturen vom Stack, gefolgt von dem oben genannten Dummy. Das Dummy Objekt wird nicht benutzt.

source: Executing the `OP_CHECKMULTISIG` operator, which results in OK this time
de_de: Ausführen des `OP_CHECKMULTISIG` Operators, was dieses Mal zu `OK` führt.

source: `OP_CHECKMULTISIG` uses all this information and the transaction to determine whether enough signatures are made and verifies those signatures. If everything is `OK`, it puts `OK` back on the stack. This is where the program ends. Because the top item on the stack is `OK`, the output spending is authorized.
de_de: `OP_CHECKMULTISIG` benutzt all diese Informationen und die Transaktion, um festzustellen, ob genug Signaturen erstellt wurden, und verifiziert diese Signaturen. Wenn alles `OK` ist, tut er `OK` zurück auf den Stack. Damit endet das Programm. Weil auf dem Stack oben `OK` liegt, ist das Ausgeben des Outputs autorisiert.

source: A coworker who wants to donate cookie tokens to the charity needs to get their wallet to write the pubkey script in <<fig0519>> into the donation transaction’s output. This presents a few problems:
de_de: Ein Kollege, der Cookie Tokens an den wohltätigen Fonds spenden möchte, muss sein Wallet dazu bringen, das Pubkey Script in <<fig0519>> in den Transaktions-Output zu schreiben. Das erzeugt ein paar Probleme:

source: The coworker’s wallet knows how to make only p2pkh outputs. The wallet must be modified to understand multisignature outputs and include a user interface to make this kind of output understandable to users.
de_de: Das Wallet des Kollegen weiss nur, wie es p2pkh Outputs erzeugen kann. Das Wallet müsste modifiziert werden, um Multisignatur Outputs zu verstehen, und müsste eine Benutzerschnittstelle bekommen, die diese Art von Output für Benutzer verwendbar macht.

source: A sender usually doesn’t need to know how the recipient’s money is protected. The sender doesn’t care if it’s multisignature, p2pkh, or anything else. They just want to pay.
de_de: Ein Sender muss normalerweise nicht wissen, wie der Empfänger sein Geld schützt. Dem Sender ist es egal, ob Multisignatur, p2pkh oder sonst irgendetwas. Sie wollen einfach bezahlen.

source: Transactions usually need to pay a fee to be processed (more on this in <<ch07>>). This fee generally depends on how big the transaction is, in bytes. A big pubkey script causes the sender to pay a higher fee. This isn’t fair because it’s the recipient who wants to use this fancy, expensive feature. The recipient, not the sender, should pay for this luxury.
de_de: Transaktionen müssen normalerweise eine Gebühr zahlen, um bearbeitet zu werden (mehr dazu in <<ch07>>). Diese Gebühr hängt davon ab, wie gross die Transaktion in Bytes ist. Für ein grosses Pubkey Script muss der Sender eine höhere Gebühr bezahlen. Das ist unfair, weil der Empfänger derjenige ist, der dieses extravagante, teure Feature benutzt. Der Empfänger, nicht der Sender, sollte für diesen Luxus zahlen.

source: You can fix all this with a small change to how the programs are run. Some developers among your coworkers invent something called _pay-to-script-hash_ (p2sh).
de_de: Man kann dies mit einer kleinen Änderung in der Weise, wie die Programme laufen, korrigieren. Ein paar der Entwickler unter deinen Kollegen erfinden etwas namens _pay-to-script-hash_ (p2sh).

source: We’ve discussed how p2pkh hides the public key from the sender, who gets a hash of the public key to pay to instead of the public key itself.
de_de: Wir haben diskutiert, wie p2pkh den public Key vor dem Sender versteckt, der anstelle des public Key nur den Hash des public Key zu sehen bekommt.

source: This type of payment was introduced in 2012 in BIP16.
de_de: Diese Art von Zahlung wurde 2012 mit BIP16 eingeführt.

source: p2sh takes this idea even further—it hides the script program. Instead of giving a big, complicated pubkey script to the sender, you give them just the hash of the script. The sender then makes a payment to that hash and leaves it up to the recipient to provide the script later, when the recipient wants to spend the money.
de_de: p2sh spinnt diese Idee noch weiter–es versteckt das Script Programm. Anstatt dem Sender ein grosses, kompliziertes Script Programm zu geben, gibt man ihm nur den Hash des Scripts. Der Sender bezahlt dann an diesen Hash und überlässt es dem Empfänger, später das Script zu liefern, wenn er das Geld ausgeben möchte.

source: Suppose again that Faiza, Ellen, and John want to raise money for charity, and they want a multisignature setup to protect their money (<<fig0522>>).
de_de: Nehmen wir wieder mal an, dass Faiza, Ellen und John Geld für eine Hilfsorganisation sammeln wollen, und sie wollen ein Multisignatur Setup benutzen, um das Geld zu sichern (<<fig0522>>).

source: Overview of p2sh. The pubkey script is simple. The signature script is special because it contains a data item that contains a program.
de_de: Überblick über p2sh. Das Pubkey Script ist einfach. Das Signatur Script ist etwas Besonderes, weil es ein Datenobjekt enthält, das ein Programm ist.

source: To verify this transaction in full, you need new software. We’ll talk about how this new software verifies this transaction in a moment. First, let’s see how the old software would handle this transaction.
de_de: Um diese Transaktion vollständig zu validieren, brauchen wir neue Software. Wir sprechen gleich darüber, wie die neue Software diese Transaktionen verifiziert. Lass uns zuerst schauen, wie die alte Software es machen würde.

source: Old software
de_de: Alte Software

source: What if the person verifying the transaction hasn’t upgraded their software to the bleeding-edge version that supports verifying p2sh payments? The developers made this forward-compatible, meaning old software won’t reject these new transactions.
de_de: Was, wenn die Person, die die Transaktion verifiziert, ihre Software nicht auf die schillernde neue Version aktualisiert hat, die das Verifizieren von p2sh Zahlungen unterstützt? Die Entwickler haben das vorwärtskompatibel umgesetzt, das bedeutet, alte Software wird diese neuen Transaktionen nicht ablehnen.

source: Why verify?
de_de: Wozu verifizieren?

source: The cafe isn’t involved in this transaction, so why would the cafe want to verify it? The cafe wants to know whether Lisa is doing her job. It’s in the cafe’s interest to know if something fishy is going on.
de_de: Das Café ist in die Transaktion nicht involviert, warum sollte sie es also überhaupt verifizieren? Das Café will wissen, ob Lisa ihren Job macht. Es ist im Interesse des Café zu wissen, ob da irgendwo eine miese Geschichte abläuft.

source: Let’s pretend the cafe runs old software to verify this transaction in the spreadsheet (<<fig0523>>). Old software will do what it’s always been doing—push the stuff in the signature script and then run the pubkey script.
de_de: Stellen wir uns vor, das Café führt alte Software aus, um diese Transaktion im Spreadsheet zu überprüfen (<<fig0523>>). Alte Software macht das, was sie immer gemacht hat - das Zeug in das Signaturskript schieben und dann das Pubkey Script laufen lassen.

source: When the program is finished, the top item on the stack is `true`, or `OK`. This means the payment is valid according to this old software.
de_de: Wenn das Programm zu Ende ist, ist das oberste Objekt auf dem Stack `true`, oder `OK`. Das bedeutet, die Zahlung ist für die alte Software gültig.

source: Verifying the p2sh transaction using old software
de_de: Überprüfung der p2sh Transaktion mit der alten Software

source: You might recognize the pubkey script from the earlier example, when you could pay money to a pre-image of a hash. That’s what happened here, too, but with a different cryptographic hash function.
de_de: Du erkennst vielleicht das Pubkey Script aus dem früheren Beispiel wieder, als du Geld an ein Pre-Image eines Hashes zahlen konntest. Das ist auch das, was hier passiert ist, nur mit einer anderen kryptografischen Hashfunktion.

source: The old software interprets this program as a payment to a hash. Whoever can show a pre-image of this hash gets the money. The actual multisignature program contained in the redeem script never runs.
de_de: Die alte Software interpretiert das Programm als Zahlung an einen Hash. Wer immer ein Pre-Image dieses Hashes zeigen kann, bekommt das Geld. Das eigentliche Multisignatur Programm, das in dem Einlöse-Script enthalten ist, läuft nie ab.

source: New software
de_de: Neue Software

source: Suppose the cafe just upgraded its software and wants to verify this transaction again. Let’s see how that happens.
de_de: Angenommen das Café hat gerade ein Upgrade der Software gemacht und will die Transaktion erneut überprüfen. Schauen wir mal, was passiert.

source: The new software looks at the pubkey script to determine if this transaction is spending a p2sh output. It looks for this pattern:
de_de: Die neue Software schaut sich das Pubkey Script an, um festzustellen, ob diese Transaktion einen p2sh Output ausgibt. Sie sucht nach diesem Muster:

source: If the pubkey script has this exact pattern—the p2sh pattern—the software will treat the program differently. First, it will perform the same seven steps as the old software, shown in <<fig0523>>, but it will save the stack after step 2. Let’s call this the _saved stack_. If the first seven steps result in `OK`, then the stack is replaced by the saved stack; and the top item, `redeemScript`, is taken off the stack (<<fig0524>>).
de_de: Wenn das Pubkey Script genau dieses Muster hat–das p2sh Muster, dann behandelt die Software das Programm anders. Zuerst führt es dieselben Schritte durch wie die alte Software, siehe <<fig0523>>, aber sie wird den Stack nach Schritt 2 retten. Nennen wir das einmal den _geretteten Stack_. Wenn die ersten sieben Schritte ein `OK` ergeben, dann wird der Stack durch den geretteten Stack ersetzt; und das oberste Stack-Element, `Einlöse-Script`, wird vom Stack genommen (<<fig0524>>).

source: The stack is replaced by the saved stack, and `redeemScript` is taken off the stack.
de_de: Der Stack wird durch den geretteten Stack ersetzt, und das `Einlöse-Script` vom Stack genommen.

source: `redeemScript` is a data item that contains a program, as previously described. This program is now entered into the program area and begins to execute. It executes from now on as if it was an old-style payment (<<fig0525>>).
de_de: Das Einlöse-Script, wir bezeichnen es von jetzt an mit dem Fachbegriff `Redeem Script`, ist ein Datenobjekt, das ein Programm beherbergt, wie vorhin beschrieben. Dieses Programm wird jetzt in den Programmbereich gelegt und beginnt zu laufen. Es läuft jetzt genau so ab, als wäre es eine herkömmliche Zahlung (<<fig0525>>).

source: Executing the program contained in the redeem script
de_de: Ausführen des im Redeem Script enthaltenen Programms

source: It’s important for Lisa that she runs the latest software. If Lisa ran old software, she would verify only that the redeem script hash matches the script hash in the pubkey script. Anyone who happened to know the redeem script—for example, Faiza—would be able to take the money in the spreadsheet. Lisa would gladly confirm that transaction. This would cause problems if any verifying nodes ran new software. Those nodes wouldn’t accept the transaction in the spreadsheet because it’s invalid according to the new rules. The entire spreadsheet would then be invalid and unacceptable for new nodes from that point forward. We’ll discuss this situation more in <<ch11>>.
de_de: Es ist wichtig für Lisa, dass sie auf den letzten Stand der Software ist. Würde Lisa alte Software laufen lassen, könnte sie nur verifizieren, dass der Hash des Redeem Scripts dem Script Hash des Pubkey Scripts entspricht. Jeder, der zufällig das Redeem Script kennt–zum Beispiel Faiza–könnte sich das Geld im Spreadsheet aneignen. Lisa würde fröhlich die Transaktion bestätigen. Das würde zu Problemen führen, wenn auf anderen verifizierenden Nodes neuere Software liefe. Diese Nodes würden die Transaktion im Spreadsheet ablehnen, weil sie gemäss der neuen Regeln unzulässig wäre. Das gesamte Spreadsheet wäre dann ungültig und für neue Nodes ab diesem Punkt inakzeptabel. Wir diskutieren diese Situation detaillierter in <<ch11>>.

source: Pay-to-script-hash addresses
de_de: Pay-to-script-hash Adressen

source: Faiza, Ellen, and John have created their two-of-three multisignature redeem script:
de_de: Faiza, Ellen und John haben ein zwei-aus-drei Multisignatur Redeem Script erzeugt:

source: They now want people to pay to the redeem script’s SHA256+RIPEMD160 hash:
de_de: Sie wollen jetzt, dass Leute an den SHA256+RIPEMD160 Hash des Redeem Scripts bezahlen:

source: How do Faiza, Ellen, and John ask people to pay them? What do they print on the flyers so coworkers can pay to their script hash? Let’s look at a couple of their options:
de_de: Wie sagen Faiza, Ellen und John den Leuten, wohin sie zahlen sollen? Was drucken sie auf die Flugblätter, damit die Kollegen an ihren Script Hash zahlen können? Schauen wir uns ein paar Möglichkeiten an:

source: Print the script hash as is, and inform coworkers that this is a hash of a redeem script. This would expose the coworkers to the unnecessary risk of typing errors, just as with payments to raw PKHs, as discussed in <<ch03>>.
de_de: Drucke den Script Hash so, wie er ist, und informiere die Kollegen, dass dies der Hash eines Redeem Scripts ist. Das würde die Kollegen dem unnötigen Risiko von Tippfehlern aussetzen, genau wie bei Zahlungen an rohe PKHs, wie in <<ch03>> diskutiert.

source: Base58check-encode the script hash just as in <<ch03>>, which would generate an address like `1SpXyW…RMmEMZ`. If this address was printed on the flyers, they would also need to inform users that they must create a p2sh output instead of a normal p2pkh.
de_de: Base58check-codiere den Script Hash genau wie in <<ch03>>, was eine Adresse erzeugen würde wie `1SpXyW…RMmEMZ`. Würde diese Adresse auf die Flugblätter gedruckt, dann müssten sie den Benutzern auch sagen, dass die einen p2sh Output statt eines normalen p2pkh Outputs erzeugen sollen.

source: In both cases, if the donor erroneously makes a p2pkh payment using the printed hash or address, no one can spend the money because no private key corresponds to this false PKH.
de_de: In beiden Fällen, wenn der Spender irrtümlich eine p2pkh Zahlung mit dem gedruckten Hash oder der Adresse macht, kann niemand das Geld ausgeben, weil kein private Key mit diesem falschen PKH korrespondiert.

source: These two options seem neither safe nor practical. Instead, let’s introduce a new address format for p2sh, the _p2sh address_ (<<fig0526>>). This format is similar to normal p2pkh addresses. It uses the base58check encoding scheme, just as normal addresses did.
de_de: Diese zwei Optionen scheinen also weder sicher noch praktikabel. Lass uns stattdessen ein neues Adressformat für p2sh einführen, die _ps2h Adresse_ (<<fig0526>>). Dieses Format ist ähnlich wie die normalen p2pkh Adressen. Es benutzt das base58check Codierschema, genau wie normale Adressen dies tun.

source: Creating a p2sh address. The difference from normal addresses is the version, which is `05` for p2sh addresses instead of `00`.
de_de: Erzeugen einer p2sh Adresse. Der Unterschied zu normalen Adressen ist die Version, die für p2sh Adressen `05` ist statt `00`.

source: This process is almost the same as for p2pkh addresses. The only difference is that the version is `05` instead of `00`. This will cause the address to begin with a `3` instead of a `1`.
de_de: Der Vorgang ist fast derselbe wie bei p2pkh Adressen. Der einzige Unterschied ist, dass die Version `05` ist statt `00`. Das führt dazu, dass die Adresse mit einer `3` beginnt statt mit einer `1`.

source: Because of this change and how base58 works—using integer division by 58 successively—the last remainder will always be 2. If you’re interested, <<fig0527>> provides the base58 encoding of the versioned and checksummed script hash of Faiza’s, Ellen’s, and John’s redeem script.
de_de: Wegen dieser Änderung und aufgrund der Funktionsweise von base58–wiederholte Integerdivision durch 58–wird der letzte Rest immer 2 sein. Wenn es dich interessiert, in <<fig0527>> siehst du die base58 Codierung des versionierten und mit Checksum versehenen Script Hashes von Faizas, Ellens und Johns Script.

source: Encoding a versioned and checksummed script hash with base58. The result will _always_ start with the character `3`.
de_de: Codieren eines versionierten und mit Checksum versehenen Scripts mit base58. Das Ergebnis beginnt _immer_ mit der Ziffer `3`.

source: This last remainder `2` will translate to `3` in base58’s character-lookup table. This `3` character will become the first character when the base58 process performs the reversing step. This causes all p2sh addresses to start with a `3`. This is how users identify them as p2sh addresses and not, for example, p2pkh addresses.
de_de: Der letzte Rest `2` übersetzt sich zu `3` in der Zeichen-Lookup-Tabelle von base58. Dieses Zeichen `3` wird zum ersten Zeichen, wenn der base58 Prozess den Umkehrschritt durchführt. Daher beginnen alle p2sh Adressen mit `3`. So können Benutzer sie als p2sh Adressen erkennen und nicht zum Beispiel als p2pkh Adressen.

source: Faiza, Ellen, and John can now print `328qTX…wrB2ag` on their flyer. When a coworker scans this flyer’s QR code, their wallet will recognize the address as a p2sh address because it starts with a `3`. The wallet will base58check-decode the address and create a proper p2sh output:
de_de: Faiza, Ellen und John können jetzt `328qTX…wrB2ag` auf die Flugblätter drucken. Wenn ein Kollege den QR code ihres Flugblattes scannt, erkennt deren Wallet die Adresse als p2sh Adresse, weil sie mit `3` beginnt.Das Wallet wird die Adresse base58check-decodieren und einen korrekten ps2h Output erzeugen:

source: This concludes our discussion of programmable transactions. You’ve learned that transactions can express a lot of different rules for how to spend money. Note that you can’t constrain where spent money goes, only what’s needed in the input to spend the money. The pubkey script makes the rules for what’s required in the signature script. Later in the book, we’ll revisit transactions to talk about more fancy stuff you can do with them, such as make spending impossible until a certain future date.
de_de: Dies beendet unsere Diskussion über programmierbare Transaktionen. Du hast gelernt, dass Transaktionen eine Menge verschiedener Bedingungen für das Ausgeben des Geldes setzen können. Wohlgemerkt kann man nicht diktieren, wo das ausgegebene Geld hingehen soll, nur was der Input liefern muss, damit er das Geld ausgeben kann. Das Pubkey Script definiert die Regeln für das, was das Signatur Script liefern muss. Später im Buch werden wir Transaktionen noch einmal anschauen um über noch extravagantere Sachen zu reden, die man mit ihnen machen kann, wie zum Beispiel das Geld bis zu einem bestimmten Zeitpunkt einzufrieren.

source: More stuff in transactions
de_de: Mehr Zeug in Transaktionen
