Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: The full-node developers and the wallet developers cooperate to let wallets connect to full nodes over the internet and get relevant block data from those nodes in a way that doesn’t require huge amounts of data traffic. Wallets are allowed to connect to any full node and ask for the data they need.
de_de: Die Full Node Entwickler und die Wallet Entwickler kooperieren, um Wallets zu ermöglichen, sich über das Internet mit Full Nodes zu verbinden und die relevanten Blockdaten auf eine solche Weise von diesen Nodes zu holen, dass dazu kein grosser Datenverkehr nötig ist.

source: Suppose John’s wallet contains two addresses, @~a~ and @~b~, and he wants to receive notifications from a full node about transactions concerning his wallet. He can make a network connection to any of the full nodes—for example, the cafe’s. The wallet and the full node then start talking, as <<fig0615>> shows.
de_de: Angenommen, Johns Wallet enthält zwei Adressen, @~a~ und @~b~, und er möchte von einem Full Node bescheid bekommen, wenn Transaktionen bezügliche seines Wallets stattfinden. Er kann dazu eine Netzwerkverbindung zu einem Full Node eröffnen–zum Beispiel zu dem des Cafés. Das Wallet und der Full Node beginnen dann, miteinander zu reden wie in <<fig0615>> dargestellt.

source: Information exchange between a lightweight wallet and a full node. The full node sends all block headers and a fraction of all transactions to the wallet.
de_de: Informationsaustausch zwischen einem Lightweight Wallet und einem Full Node.Der Full Node schickt alle Block Header und einen Bruchteil der Transaktionen an das Wallet.

source: We’ll examine how this connection is made and how the wallet and node send information between each other more thoroughly in <<ch08>>. I only provide a high-level glimpse here, as follows:
de_de: Wir betrachten in <<ch08>> genauer, wie die Verbindung hergestellt wird und wie Wallet und Node Informationen zwischen sich austauschen. Ich liefere hier nur einen Überblick:

source: This process is described in full detail in BIP37, found at <<web-bips>>.
de_de: Die Beschreibung dieses Prozesses findet sich vollständig in BIP37, hier <<web-bips>>.

source: John’s wallet asks the full node for all block headers since the wallet’s last known block header and all transactions concerning John’s addresses.
de_de: Johns Wallet bittet den Full Node um alle neuen Block Header seit dem letzten, den das Wallet kennt, und um alle Transaktionen, die Johns Adressen betreffen.

source: The cafe’s full node sends all requested block headers to the wallet and at least all transactions concerning John’s addresses.
de_de: Der Full Node des Cafés schickt alle angefragten Block Header an das Wallet und mindestens alle Transaktionen, die Johns Adressen betreffen.

source: In step 1, the wallet doesn’t send the exact list of addresses in John’s wallet. This would harm John’s privacy because the cafe would then know that all John’s addresses belong together and could sell that information to Acme Insurances. Not nice. John’s wallet instead sends a filter to the full node. This filter is called a _bloom filter_. The full node uses it to determine whether to send a transaction to the wallet. The filter tells the full node to send all transactions concerning @~a~ and @~b~, but it also tells the full node to send transactions that aren’t relevant to John’s wallet, to obfuscate what addresses actually belong to the wallet. Although bloom filters don’t have much to do with the blockchain, I still dedicate a subsection to them here because lightweight wallets use them extensively.
de_de: In Schritt 1 schickt das Wallet nicht die genaue Liste von Johns Adressen im Wallet. Das würde Johns Privacy beeinträchtigen, weil das Café dann wüsste, dass die ganzen Adressen von John zusammengehören, und könnte diese Information der Acme Versicherung verkaufen. Nicht nett. Johns Wallet schickt stattdessen einen Filter an den Full Node. Dieser Filter wird als _Bloom Filter_ bezeichnet. Der Full Node benutzt ihn um festzustellen, ob er eine Transaktion an das Wallet schicken soll. Der Filter sagt dem Full Node, dass er alle Transaktionen bezüglich @~a~ und @~b~ schicken soll, aber auch, dass er andere Transaktionen schicken soll, die nicht zu Johns Wallet gehören, um zu verschleiern, welche Adressen tatsächlich zum Wallet gehören. Obwohl Bloom Filter nicht viel mit der Blockchain zu tun haben, widme ich ihnen hier dennoch einen Abschnitt, weil Lightweight Wallets sie intensiv benutzen.

source: In step 2, transactions and block headers are sent to John’s wallet, but the complete blocks aren’t sent (to save network traffic). John’s wallet can’t use just a transaction and the header to verify that the transaction is in the block. Something more is required: a _partial merkle tree_ that proves that one or more transactions are included in the block.
de_de: In Schritt 2 werden Transaktionen und Block Header an Johns Wallet geschickt, aber nicht die kompletten Blocks (um Netzwerkbandbreite einzusparen). Johns Wallet genügt allerdings nicht nur die Transaktion und der Block Header, um zu überprüfen, dass die Transaktion im Block enthalten ist. Es wird etwas mehr benötigt: ein Teil des Merkle Baumes, ein sogenannter _partial Merkle Tree_, der beweist, dass eine oder mehrere Transaktionen in dem Block vorkommen.

source: The two steps are performed as a synchronizing phase just after the wallet connects to the cafe’s full node. After this, as Lisa creates new blocks and the cafe’s full node picks them up, the corresponding block headers are sent to the wallet together with all transactions concerning John’s addresses in roughly the same way as described earlier.
de_de: Die beiden Schritte werden in einer Phase der Synchronisation direkt nach dem Verbindungsaufbau des Wallets zum Full Node des Cafés ausgeführt. Anschliessend werden an Johns Wallet immer dann, wenn Lisa neue Blocks generiert und das Café diese herunterlädt, die entsprechenden Block Header zusammen mit allen Transaktionen, die das Wallet betreffen, so wie vorhin beschrieben geschickt.

source: We’ll next discuss bloom filters. Merkle trees are explained in <<merkle-trees>>.
de_de: Als nächstes kommen Bloom Filter dran. Merkle Trees werden in <<merkle-trees>> erklärt.

source: Bloom filters obfuscate addresses
de_de: Bloom Filter verschleiern Adressen.

source: John’s wallet contains two addresses, @~a~ and @~b~, but John doesn’t want to reveal to anyone that @~a~ and @~b~ belong to the same wallet. He has reason to be wary because he’s heard rumors that Acme Insurances pays good money for such information, to “adjust” premiums based on people’s cookie-eating habits.
de_de: Johns Wallet enthält die zwei Adressen @~a~ und @~b~, aber John möchte niemandem gegenüber preisgeben, dass @~a~ und @~b~ zum selben Wallet gehören. Er hat auch Grund, misstrauisch zu sein, denn ihm ist zu Ohren gekommen, dass die Acme Versicherung viel Geld für solche Informationen bezahlt, um die Prämien auf Basis des Kekskonsums der Leute “anzupassen”.

source: Creating the bloom filter
de_de: Erzeugung des Bloom Filters

source: To obfuscate what addresses belong together, John’s wallet creates a bloom filter to send to the full node (<<fig0616>>).
de_de: Um zu vernebeln, welche Adressen zusammengehören, erzeugt Johns Wallet einen Bloom Filter, den es dem Full Node schickt (<<fig0616>>).

source: The client sends a bloom filter to the full node to obfuscate what addresses belong to the wallet.
de_de: Der Client sendet einen Bloom Filter an den Full Node, um zu vernebeln, welche Adressen zu dem Wallet gehören.

source: The bloom filter is a sequence of bits, which, as mentioned in <<ch02>>, can have the value 0 or the value 1. John’s bloom filter happens to be 8 bits long. <<fig0617>> illustrates how it was created.
de_de: Der Bloom Filter ist eine Reihe von Bits, die, wie in <<ch02>> erwähnt, einen Wert von 0 oder 1 haben können. Johns Bloom Filter ist 8 Bit lang. <<fig0617>> stellt dar, wie er erzeugt wurde.

source: The lightweight wallet creates a bloom filter to send to the full node. Each address in the wallet is added to the bloom filter.
de_de: Das Lightweight Wallet generiert einen Bloom Filter, um ihn dem Full Node zu schicken. Jede Adresse wird zum Bloom Filter addiert.

source: The wallet creates the sequence of bits (the bloom filter) and initializes them with zeroes all over. It then adds all John’s public key hashes (PKHs) to the bloom filter, starting with PKH~a~, the PKH for @~a~.
de_de: Das Wallet erzeugt die Reihe von Bits (den Bloom Filter) und initialisiert sie vollständig mit Nullen. Dann addiert sie die public Key Hashes (PKH) von allen Adressen von John zum Bloom Filter, beginnend mit PKH~a~, dem PKH von @~a~.

source: Why three hash functions?
de_de: Weshalb drei Hashfunktionen?

source: The number of hash functions can be anything, as can the size of the bloom filter. This example uses three hash functions and 8 bits.
de_de: Die Anzahl Hashfunktionen ist beliebig, ebenso wie die Grösse des Bloom Filters. Dieses Beispiel benutzt drei Hashfunktionen und 8 Bits.

source: It runs PKH~a~ through the first of the three hash functions. This hash function results in the value `2`. This value is the index of a bit in the bloom filter. The bit at index 2 (the third from the left) is then set to `1`. Then PKH~a~ is run through the second hash function, which outputs `0`, and the corresponding bit (the first from the left in the figure) is set to `1`. Finally, the third hash function outputs `6`, and the bit at index 6 (seventh from the left) is set to `1`.
de_de: Es schickt PKH~a~ durch die erste der drei Hashfunktionen. Diese Hashfunktion liefert als Ergebnis den Wert `2`. Dieser Wert ist der Index in den Bloom Filter. Das Bit an Index 2 (das dritte von links) wird dann auf `1` gesetzt. Dann wird PKH~a~ durch die zweite Hashfunktion geschickt, die `0` als Resultat liefert, und das korrespondierende Bit (in der Abbildung das erste von links) wird auf `1` gesetzt. Schliesslich liefert die dritte Hashfunktion den Wert `6`, und das Bit an Index 6 (das siebte von links) wird auf `1` gesetzt.

source: Next up is PKH~b~, which is handled the exact same way. The three hash functions output `5`, `0`, and `3`. These three bits are all set to `1`. Note that bit 0 was already set by PKH~a~, so this bit isn’t modified.
de_de: Als nächstes kommt der PKH~b~ an die Reihe, mit dem auf die genau gleiche Weise verfahren wird. Die drei Hashfunktionen liefern als Outputs `5`, `0` und `3`. Diese drei Bits werden alle auf `1` gesetzt. Wohlgemerkt war Bit 0 bereits durch PKH~a~ gesetzt, sodass dieses Bit hier nicht mehr geändert wird.

source: The bloom filter is finished and ready to be sent to the full node.
de_de: Der Bloom Filter ist fertig und kann an den Full Node geschickt werden.

source: Use the bloom filter
de_de: Benutzung des Bloom Filters

source: The full node receives the bloom filter from the wallet and wants to use it to filter transactions to send to the wallet.
de_de: Der Full Node empfängt den Bloom Filter vom Wallet und möchte ihn benutzen, um die Transaktionen herauszufiltern, die er an das Wallet schicken soll.

source: Suppose Lisa just published a new block to the shared folder, and the full node has verified the block. The full node now wants to send the new block’s header and all relevant transactions in it to the wallet. How does the full node use the bloom filter to determine what transactions to send?
de_de: Angenommen, Lisa hat gerade einen neuen Block im Share veröffentlicht und der Full Node hat den Block verifiziert. Der Full Node will jetzt den neuen Block Header und alle darin enthaltenen relevanten Transaktionen an das Wallet schicken. Wie benutzt der Full Node den Bloom Filter, um herauszufinden, welche Transaktionen er schicken soll?

source: The block contains three transactions: Tx~1~, Tx~2~, and Tx~3~ (<<fig0618>>).
de_de: Der Block enthält drei Transaktionen: Tx~1~, Tx~2~, and Tx~3~ (<<fig0618>>).

source: The block to send contains three transactions; only one concerns John.
de_de: Der zu sendende Block enthält drei Transaktionen; nur eine betrifft John.

source: Tx~1~ and Tx~3~ have nothing to do with John’s addresses, but Tx~2~ is a payment to John’s address @~b~. Let’s look at how the full node uses the bloom filter (<<fig0619>>).
de_de: Tx~1~ und Tx~3~ haben nichts mit Johns Adressen zu tun, aber Tx~2~ zahlt an Johns Adresse @~b~. Schauen wir uns an, wie der Full Node den Bloom Filter benutzt (<<fig0619>>).

source: The full node uses the bloom filter to determine which transactions are “interesting” to the wallet.
de_de: Der Full Node benutzt den Bloom Filter um festzustellen, welche Transaktionen für das Wallet “interessant” sind.

source: For each output in a transaction, the node tests whether any PKH matches the filter. It starts with Tx~1~, which has a single output to PKH~L~. To test whether PKH~L~ matches the filter, it runs PKH~L~ through the same three hash functions as John’s wallet did when the filter was created. The hash functions output the indexes `5`, `1`, and `0`. The bits at index `5` and `0` are both `1`, but the bit at index `1` is `0`. A 0 bit means PKH~L~ definitely isn’t interesting to John’s wallet. If John’s wallet was interested in PKH~L~, the wallet would have added it to the filter, thus setting bit `1` to `1`. Because PKH~L~ was the only PKH in Tx~1~, John’s wallet isn’t interested in this transaction.
de_de: Für jeden Output in einer Transaktion prüft der Node, ob irgendein PKH zu dem Filter passt. Er beginnt mit Tx~1~, die einen einzelnen Output an PKH~L~ enthält. Um zu prüfen, ob PKH~L~ durch den Filter passt, schickt er PKH~L~ durch dieselben drei Hashfunktionen, die Johns Wallet beim Erzeugen des Filters benutzt hat. Die Hashfunktionen liefern die Indizes `5`, `1` und `0`. Die Bits an Index `5` und `0` sind beide `1`, doch das Bit an Index `1` ist `0`. Ein 0 Bit bedeutet, PKH~L~ interessiert Johns Wallet definitiv nicht. Wenn Johns Wallet Interesse am PKH~L~ hätte, hätte das Wallet ihn zu dem Filter hinzugenommen und damit Bit `1` auf `1` gesetzt. Weil PKH~L~ der einzige PKH in Tx~1~ ist, ist Johns Wallet folglich nicht an dieser Transaktion interessiert.

source: The next transaction is Tx~2~. It contains two PKHs: PKH~b~ and PKH~X~. It begins with PKH~b~. Running this PKH through the hash functions gives the indexes `5`, `0`, and `3`. All three bits have the value `1`. This means the node can’t say for sure if the transaction is interesting to the wallet, but it can’t say that it’s definitely _not_ interesting. Testing any further PKHs in this transaction is pointless because the node has already determined that Tx~2~ should be sent to the wallet.
de_de: Die nächste Transaktion ist Tx~2~. Sie enthält zwei PKHs: PKH~b~ und PKH~X~. Es beginnt mit PKH~b~. Der Durchlauf durch die drei Hashfunktionen liefert die Indizes `5`, `0` und `3`. Alle drei Bits haben den Wert `1`. Das heisst, der Code kann nicht sicher sagen, dass die Transaktion das Wallet wirklich interessiert, aber er kann auch nicht mit Sicherheit sagen, dass sie es _nicht_ interessiert. Weitere PKHs in der Transaktion zu überprüfen ist sinnlos, weil der Node bereits beschlossen hat, dass Tx~2~ an das Wallet geschickt werden sollte.

source: The last transaction has two outputs to PKH~Y~ and PKH~Z~. It starts with PKH~Y~, which happens to point at `2`, `7`, and `4`. Both bits `4` and `7` are `0`, which means PKH~Y~ definitely isn’t interesting to the wallet. Let’s continue with PKH~Z~, which results in bits `2`, `3`, and `0`. All three bits have the value `1`. This, again, means Tx~3~ _might_ be interesting to the wallet, so the node will send this transaction, too. John’s wallet doesn’t actually contain PKH~Z~, but the bloom filter aims to match more than needed to preserve some degree of privacy. We call this a _false positive_ match.
de_de: Die letzte Transaktion hat zwei Outputs an PKH~Y~ und PKH~Z~. Es beginnt mit PKH~Y~, was auf `2`, `7` und `4` zeigt. Sowohl Bits `4` als auch `7` sind `0`, was bedeutet, PKH~Y~ ist für das Wallet definitiv nicht von Interesse. Machen wir mit PKH~Z~ weiter, was als Resultat Bits `2`, `3` und `0` liefert. Alle drei Bits haben den Wert `1`. Das wiederum bedeutet, dass Tx~3~ für das Wallet _vielleicht_ von Interesse sein könnte, also schickt der Node auch diese Transaktion. Johns Wallet enthält PKH~Z~ zwar nicht, aber der Bloom Filter versucht, mehr zu finden als nötig um einen gewissen Grad an Privacy zu erreichen. Wir nennen dies einen _false positive_ Treffer oder Scheintreffer.

source: The result of the bloom filtering is that the node will send Tx~2~ and Tx~3~ to the wallet. How the transactions are sent is a totally different story, described in <<merkle-trees>>.
de_de: Das Ergebnis der Bloom Filterung ist, dass der Node die Transaktionen Tx~2~ und Tx~3~ an das Wallet schicken wird. Wie die Transaktionen geschickt werden, ist eine völlig andere Geschichte, die in <<merkle-trees>> beschrieben wird.

source: The following is challenging. Feel free to skip this part and jump to <<ch06-periscope>>.
de_de: Im Folgenden wird es schwierig. Du kannst den Abschnitt ruhig überspringen und zu <<ch06-periscope>> springen.

source: The previous description is a simplification of what really happens. You tested only PKHs of the transaction outputs described, which would capture all transactions that pay cookie tokens _to_ any of John’s addresses. But what about transactions that are spending _from_ John’s addresses? We could argue that the full node doesn’t need to send those transactions to the wallet because the wallet already knows about them, given that it created them in the first place. Unfortunately, you do need to send those transactions, for two reasons.
de_de: Die obige Beschreibung ist eine Vereinfachung dessen, was tatsächlich passiert. Wir haben nur die PKHs der beschriebenen Transaktions Outputs getestet, was alle Transaktionen erwischen würde, die Cookie Token _an_ irgendwelche von Johns Adressen zahlen. Aber was ist mit den Transaktionen, die Geld _von_ Johns Adressen ausgeben? Wir könnten zwar sagen, dass der Full Node dies Transaktionen nicht an das Wallet zu senden braucht, weil es die ja selbst erzeugt hat und sie deshalb sowieso schon kennt. Leider muss man aber diese Transaktionen trotzdem übermitteln, und zwar aus zwei Gründen.

source: First, it might not be this wallet app that created the transaction. John can have multiple wallet apps that generate addresses from the same seed. For example, do you remember in <<ch04>> how a wallet can be restored from a mnemonic sentence? This sentence can be used by multiple wallet apps at the same time. John might want to make a payment from one of the wallet apps and be notified of the payment in the other wallet app so he can monitor the total balance in that app.
de_de: Erstmal kann es sein, dass nicht diese Wallet App die Transaktion erzeugt hat. John kann viele Wallet Apps benutzen, die Adressen aus demselben Seed erzeugen. Erinnere dich zum Beispiel daran, wie in <<ch04>> ein Wallet aus einem mnemonic sentence wiederhergestellt wurde? Dieser mnemonic sentence kann von vielen Wallets gleichzeitig benutzt werden. John möchte vielleicht von einem der Wallets eine Zahlung tätigen und einem anderen Wallet über die Zahlung auf informiert werden, damit er dort das Gesamtsaldo überschauen kann.

source: Second, John wants to be notified when the transaction is confirmed. The wallet app might already have the transaction, but it’s still marked as _unconfirmed_ in the app. John wants to know when the transaction has been included in a block, so he needs the node to send him this transaction when it’s in a block.
de_de: Zweitens möchte John bescheid bekommen, wenn die Zahlung bestätigt wurde. Die Wallet App mag die Transaktion zwar schon haben, aber sie wird in der App noch als _unconfirmed_ angezeigt. John möchte wissen, wann die Transaktion in einen Block Eingang gefunden hat, also muss der Node ihm diese Transaktion schicken, sobald sie in einem Block gelandet ist.

source: What the node really tests are the following items (<<fig0620>>):
de_de: Was der Node tatsächlich testet, sind die folgenden Dinge: (<<fig0620>>):

source: The txid of the transaction
de_de: Die txid der Transaktion

source: All transaction output (TXO) references in the inputs
de_de: Alle Transaktions-Output Verweise (TXO) in den Inputs.

source: All data items in signature scripts
de_de: Alle Datenobjekte in Signatur Scripts

source: All data items of the outputs
de_de: Alle Datenobjekte der Outputs

source: Several things in a transaction are tested through the bloom filter to determine whether the transaction is possibly interesting.
de_de: Mehrere Dinge in einer Transaktion werden durch den Bloom Filter getestet, um festzustellen, ob die Transaktion möglicherweise interessant ist.

source: For John’s wallet to be notified of spends, it needs to add either all its public keys to the bloom filter or all its UTXO references.
de_de: Damit Johns Wallet über Geldausgaben informiert wird, muss es entweder alle seine public Keys oder alle seine UTXO Verweise zum Bloom Filter hinzufügen.

source: Throttling privacy and data traffic
de_de: Drosseln von Privacy und Datenverkehr

source: The purpose of the bloom filter is to enhance user privacy. The level of privacy can be controlled by tuning the ratio between the number of 1s in the bloom filter and the bloom filter’s size. The more 1s in the bloom filter in relation to the bloom filter’s size, the more false positives. More false positives means the full node will send more unrelated transactions to the wallet. More unrelated transactions means more wasted data traffic but also improved privacy.
de_de: Der Sinn der Bloom Filter ist die Verbesserung der Benutzer-Privacy. Der Level an Privacy kann durch das Verhältnis von 1en im Bloom Filter und durch dessen Grösse justiert werden. Je mehr 1en im Bloom Filter relativ zu seiner Grösse auftauchen, desto mehr Scheintreffer gibt es. Je mehr Scheintreffer, desto mehr unnötige Transaktionen muss der Full Node an das Wallet schicken. Mehr unnötige Transaktion bedeuten mehr verschwendeter Datenverkehr aber auch verbesserte Privacy.

source: Let’s do some back-of-the-envelope calculations. The bloom filter in the earlier example has 8 bits, of which five are 1s. A single hash function’s output has a 5/8 probability of hitting a 1. For a single test, the probability that all three hash functions hit a 1 is then (5/8)^3^. The probability that a single test is negative—at least one of the three hash functions points to a 0—is then 1 – (5/8)^3^. The full node will perform several tests on each transaction, typically nine for a transaction with two inputs and two outputs. Let’s check this against the list of tests the full node performs:
de_de: Machen wir ein paar Überschlagsrechnungen. Der Bloom Filter im Beispiel vorhin hat 8 Bit, vom dem fünf 1en sind. Der Output einer einzelnen Hashfunktion hat daher eine 5/8 Wahrscheinlichkeit, eine dieser 1en zu treffen. Für einen einzelnen Test ist also die Wahrscheinlichkeit, dass alle drei Hashfunktionen eine 1 treffen, (5/8)^3^. Die Wahrscheinlichkeit, dass ein einzelner Test negativ ist–mindestens eine der drei Hashfunktionen zeigt auf eine 0–ist dann 1 – (5/8)^3^. Der Full Node führt auf jeder Transaktion mehrere Tests aus, typischerweise neun für eine Transaktion mit zwei Inputs und zwei Outputs. Checken wir das gegen die Liste von Tests, die der Full Node abarbeitet:

source: The txid of the transaction (1)
de_de: Die txid der Transaktion (1)

source: All TXO references in the inputs (2)
de_de: Alle TXO Verweise in den Inputs (2)
