Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: In traditional online payments, you send your debit card details to the merchant and _hope_ the merchant will withdraw as much as you agreed on. You also _hope_ the merchant handles your debit card details with great care. They probably store the details in a database. Think about that: for every debit card purchase you make, your card details will be stored in that merchant’s database. It’s likely that _one_ of the databases will be hacked and your card details stolen. The more merchants store your details, the higher the risk.
de_de: In traditionellen online Zahlungsverfahren schickt man Debitkarteninformationen an den Händler und _hofft_, dass der Händler nur so viel abbucht, wie als Preis vereinbart war. Du _hoffst_ auch, dass der Händler gut auf deine Kartendaten aufpasst. Die Händler speichern die Kartendaten wahrscheinlich in einer Datenbank. Denk mal darüber nach: für jeden Kauf, den du mit Debitkarte bezahlst, speichert ein Händler deine Kartendaten in einer Datenbank. Es ist sehr wahrscheinlich, dass _eine_ dieser Datenbanken gehackt wird und auch deine Kartendaten gestohlen werden. Je mehr Händler deine Daten haben, desto höher ist das Risiko.

source: With Bitcoin, you don’t have that problem because you don’t send any sensitive information to the merchant, or anyone else. You transfer the amount of money you agreed on and nothing more.
de_de: Mit Bitcoin hast du dieses Problem nicht, denn du brauchst weder dem Händler noch sonst jemandem heikle Daten zu schicken. Du schickst die vereinbarte Summe und fertig.

source: Speculation
de_de: Spekulation

source: The world is full of people wanting to get rich quick. Bitcoin can be alluring to them because of its price _volatility_, or tendency to change. Looking at the history of bitcoin’s price, as shown in <<btc-price>>, it’s tempting to try to buy when it’s low and sell when it’s high.
de_de: Die Welt ist voller Leute, die schnell reich werden wollen. Bitcoin kann für die sehr interessant sein, weil sein Preis sehr _volatil_ ist, also zu grossen Ausschlägen neigt. Schaut man sich den Preis von bitcoin an, wie hier <<btc-price>>, so kommt man in Versuchung, es billig zu kaufen und teurer wieder zu verkaufen.

source: Price in USD since the beginning of Bitcoin
de_de: Preis in US-Dollar seit Beginn von Bitcoin

source: In November 2013, the price climbed from about $100 USD to more than $1100 in a few weeks. This was clearly a so-called _bubble_, in which people were afraid of missing out on a great rise, so they bought in, driving the price further up, until it eventually started dropping again. The drop to 50% of its peak value was just as quick as its rise. The same pattern repeated in late 2017 but at a greater magnitude. This has happened many times already. Fluctuations like this are rarely driven by any specific news or technological advancement, but usually arise from speculation. Speculation can be fun, if you can afford to lose, but it’s more like a lottery than something to make a living from.
de_de: Im November 2013 kletterte der Preis von ungefähr $100 in wenigen Wochen auf über $1100. Das war ganz offensichtlich eine sogenannte _Blase_, in der Leute Angst hatten, einen grossen Preisanstieg zu verpassen und deshalb schnell kauften, was den Preis weiter nach oben trieb, bis dieser irgendwann wieder zu fallen begann. Der Fall um 50% des Spitzenwertes spielte sich ebenso schnell ab, wie der vorherige Anstieg. Dasselbe Muster wiederholte sich gegen Ende 2017, aber eine Grössenordnung höher. Das ist schon viele Male passiert. Fluktuationen wie diese sind selten von speziellen Nachrichten oder technischen Neuerungen getrieben, sondern resultieren normalerweise aus Spekulation. Spekulation kann Spass machen, wenn man sich das Verlieren leisten kann, aber es gleicht mehr einem Lotteriespiel als einem Gelderwerb.

source: Sometimes a government or big corporation makes a negative statement about Bitcoin that creates fear in the market, but those events tend to have a limited effect on bitcoin’s value.
de_de: Manchmal stellt eine Regierung oder eine grosse Firma eine negative Behauptung über Bitcoin auf, die Angst im Markt erzeugt, aber diese Vorkommnisse neigen nicht dazu, grossen Einfluss auf den Wert von Bitcoin zu haben.

source: Bitcoin’s price volatility seems contradictory to the claims of it having a non-inflationary property; a 50% drop in market value appears pretty inflationary. Bitcoin is still relatively new, and lots of short-term speculation causes this volatility. But as Bitcoin grows and more people and institutions start using it to store their wealth, it will probably stabilize in the long run, and its deflationary property will emerge over time.
de_de: Die Preisvolatilität von Bitcoin scheint der Behauptung zu widersprechen, Bitcoin sei nicht-inflationär; ein 50% Abfall im Marktwert kann einem schon ziemlich inflationär vorkommen. Bitcoin ist aber immer noch relativ neu und die Volatilität wird viel durch kurzfristige Spekulation genährt. Aber mit dem Wachsen von Bitcoin und zunehmender Akzeptanz durch Personen und Institutionen zum Speichern ihrer Vermögenswerte, wird sich langfristig der Preis wahrscheinlich stabilisieren und die deflationären Eigenschaften von Bitcoin werden sich im Laufe der Zeit zeigen.

source: Noncurrency uses
de_de: Nichtwährungs-Anwendungen

source: Bitcoin is digital cash, but this form of cash can be used for things beyond money. This section covers two common uses, but there are others, including those not yet invented.
de_de: Bitcoin ist digitales Bargeld, aber diese Form von Bargeld kann für Dinge verwendet werden, die über das Geld hinausgehen. Dieser Abschnitt behandelt zwei gebräuchliche Verwendungen, aber es gibt andere, einschließlich der noch nicht erfundenen.

source: Ownership
de_de: Eigentum

source: Bitcoin lets you embed small pieces of data with payments. This data can be, for example, a chassis number of a car. When the car leaves the factory, the manufacturer can make a small Bitcoin payment to the new car owner, containing the chassis number. This payment will then represent the transfer of ownership for that car.
de_de: In eine Bitcoin Zahlung kann man kleine Datenmengen einbetten. Diese Daten könnten z.B. die Fahrgestellnummer eines PKWs sein. Wenn das Auto die Fabrik verlässt, kann der Hersteller eine kleine Bitcoin Zahlung an den neuen Besitzer schicken, und die Fahrgestellnummer in die Zahlung einbetten. Diese Zahlung kann dann den Eigentumsübergang des Autos repräsentieren.

source: Bitcoin payments are public records, but they aren’t tied to people in any way. They’re tied to long strings of numbers called _public keys_, explained in detail in <<ch02>>. The car manufacturer has made its public key available on its website, in newspapers, and in advertisements to tie the key to the manufacturer’s identity. Anyone can then verify that the manufacturer has transferred ownership of the car to the new owner. The new owner can show that she owns the car by proving that she owns the private key belonging to the public key to which the manufacturer has transferred ownership.
de_de: Bitcoin Zahlungen sind öffentliche Aufzeichnungen, aber sie sind keineswegs an Personen gebunden. Sie sind vielmehr an lange Zahlenketten gebunden, die wir als _öffentliche Schlüssel_ bezeichnen und die im Detail in <<ch02>> behandelt werden. Der Autohersteller hat seinen öffentlichen Schlüssel auf seiner Webseite, in Zeitungen und im Rahmen seiner Werbung veröffentlicht. Deshalb kann jeder nachvollziehen, dass der Eigentumsübergang an den neuen Besitzer vollzogen worden ist. Die neue Eigentümerin kann beweisen, dass sie das Fahrzeug besitzt, indem sie nachweist, dass sie im Besitz des privaten Schlüssels ist, der zu dem öffentlichen Schlüssel gehört, an den der Hersteller die Zahlung geleistet hat

source: The new owner can sell the car to someone else and transfer ownership by sending the same bitcoins she got from the manufacturer to the new owner’s public key. The general public can follow the car’s ownership from the manufacturer through every owner’s public key up to the current owner.
de_de: Die neue Eigentümerin kann das Auto jemand anderem verkaufen und den Eigentumsübergang dadurch einleiten, dass sie dieselben bitcoins, die der Hersteller an sie geschickt hatte, nun an den neuen Besitzer schickt. Die Öffentlichkeit kann den Eigentumsverhältnissen des Autos folgen, vom Hersteller über alle öffentlichen Schlüssel der zwischenzeitlichen Eigentümer folgt, bis sie beim aktuellen Besitzer landet.

source: Proof of existence
de_de: Existenzbeweis

source: Using the same technique to store data in a Bitcoin payment to transfer ownership of a car, you can prove that a document existed prior to a certain point in time.
de_de: Mit derselben Technik des Abspeicherns kleiner Datenmengen in einer Bitcoin Zahlung kann man auch den Beweis führen, dass ein Dokument vor einem bestimmten Zeitpunkt X existiert hat.

source: A digital document has a _fingerprint_: a cryptographic hash that anyone can calculate from that document. Creating a different document with the same fingerprint is practically impossible. This fingerprint can be attached to a Bitcoin payment. Where the money goes is irrelevant; the important thing is that the fingerprint is recorded in the Bitcoin blockchain. You “anchor” the document in the blockchain.
de_de: Ein digitales Dokument besitzt einen _Fingerabdruck_: einen kryptografischen Hash, den jeder aus dem Dokument errechnen kann. Ein Dokument zu erzeugen, das denselben Hash ergibt, ist praktisch unmöglich. Dieser Fingerabdruck kann irgendeiner Bitcoin Zahlung hinzugefügt werden. Wohin das Geld geht, ist dabei unwichtig; das Wichtige ist, dass der Fingerabdruck in der Blockchain aufgezeichnet ist. Du “verankerst” das Dokument in der Blockchain.

source: Bitcoin payments are public records, so anyone can verify that the document existed before the time of the payment by taking the document’s fingerprint and comparing it to the fingerprint stored in the blockchain.
de_de: Bitcoin Zahlungen sind öffentliche Aufzeichnungen, also kann jeder prüfen, dass das Dokument bereits vor dem Zeitpunkt existiert hat, zu dem die Zahlung getätigt wurde, indem er den Fingerabdruck des Dokuments berechnet und mit dem in der Blockchain gespeicherten Fingerabdruck vergleicht.

source: How is Bitcoin valued?
de_de: Wie wird Bitcoin bewertet?

source: As you read in the <<speculation>>, a bitcoin’s price can fluctuate dramatically. But where does this price come from? Several Bitcoin exchanges exist, most of them internet-based. They resemble stock markets, where users wanting to sell bitcoins are matched with users wanting to buy bitcoins.
de_de: Wie in <<speculation>> erklärt, kann der Preis von bitcoin dramatisch fluktuieren. Aber woher kommt der Preis? Es gibt mehrere Bitcoin Exchanges, die meisten davon sind internetbasiert. Sie ähneln Aktienmärkten, auf denen Benutzer, die bitcoins verkaufen wollen, mit denen verbunden werden, die welche kaufen wollen.

source: Different markets can have different market prices depending on the supply and demand in that market. For example, in countries such as Venezuela, where the government tries to hinder the Bitcoin market, the supply is low. But the demand is high because people want to escape their hyperinflating currency. These factors drive the Bitcoin price up in that market compared to, for example, the US and European markets, where people can trade more freely.
de_de: Auf verschiedenen Märkten können sich unterschiedliche Marktpreise ergeben, abhängig von Angebot und Nachfrage auf dem jeweiligen Markt. Zum Beispiel ist das Angebot von bitcoins in Märkten wie Venezuela, wo die Regierung den Bitcoin Markt zu unterdrücken versucht, gering. Andererseits ist die Nachfrage aber hoch, weil die Bevölkerung der Hyperinflation ihrer Währung zu entrinnen versucht. Diese Faktoren treiben den Bitcoin Preis in diesem Markt im Vergleich zu beispielsweise dem US-amerikanischen oder europäischen Markt hoch.

source: When not to use Bitcoin
de_de: Wann sollte man Bitcoin nicht verwenden?

source: Bitcoin is nice and all, but it’s not suitable for all financial activity. At least, not yet.
de_de: Bitcoin ist schön und gut, aber es ist nicht für alle Finanzaktivitäten geeignet. Jedenfalls noch nicht.

source: Tiny payments
de_de: Niederwertige Zahlungen

source: A Bitcoin transaction should usually include a processing fee. This fee isn’t related to the amount sent but to how big the transaction is in bytes. This is because the Bitcoin network’s cost for processing a transaction depends mostly on how big (in bytes) the transaction is. High-value transactions aren’t bigger (in bytes) than low-value transactions, so the fee is about the same for both kinds of transactions. The fee required for a transaction also depends on supply and demand for available space in the blockchain. The blockchain can’t handle more than roughly 12 MB of transactions per hour, which means miners sometimes have to prioritize transactions. Paying a higher fee will probably give your transaction a higher priority.
de_de: Eine Bitcoin Transaktion enthält normalerweise eine Transaktionsgebühr. Diese Gebühr hängt nicht von der Höhe des gesendeten Betrages ab, sondern von der Grösse der Transaktion in Bytes. Denn die Kosten des Bitcoin Netzwerkes für das Abarbeiten einer Transaktion hängt im Wesentlichen davon ab, wie gross (in Bytes) die Transaktion ist. Transaktion über hohe Beträge sind nicht unbedingt grösser (in Bytes) als solche über geringe Beträge, also ist die Gebühr für beide ungefähr gleich hoch. Sie hängt ausserdem von Angebot und Nachfrage in Bezug auf Platz in der Blockchain ab. Die Blockchain kann nicht mehr als ca. 12 MB an Transaktionen pro Stunde bearbeiten, was bedeutet, dass die Miner manchmal Transaktionen priorisieren müssen. Eine höhere Gebühr gibt einer Transaktion ziemlich sicher eine höhere Priorität.

source: If the fee is a significant share of the actual payment you want to make, it isn’t economically viable to pay with ordinary Bitcoin transactions (see <<fee-feasibility>>).
de_de: Wenn die Gebühr einen erheblichen Teil der Zahlung ausmacht, die du leisten willst, ist es unökonomisch, mit normalen Bitcoin Transaktionen zu zahlen (siehe <<fee-feasibility>>).

source: Feasibility of different fee levels
de_de: Wirtschaftlichkeit verschiedener Gebührenstufen

source: | Amount to transfer | Fee | Fee % | Feasible | 2 BTC | 0.003 BTC | 0.15% | Yes | 0.002 BTC | 0.001 BTC | 50% | Probably not | 0.001 BTC | 0.005 BTC | 500% | No
de_de: | Transferbetrag | Gebühr | Gebühr % | Wirtschaftlich | 2 BTC | 0.003 BTC | 0.15% | Ja | 0.002 BTC | 0.001 BTC | 50% | Eher nein | 0.001 BTC | 0.005 BTC | 500% | Nein

source: But promising emerging technologies are being built on top of Bitcoin. One example is the Lightning Network, which allows for cheap, instantaneous micropayments of tiny fractions of a bitcoin. Using the Lightning Network, you could potentially pay just 100 satoshis (where 1 satoshi = 0.00000001 BTC) at a fee of as little as 1 satoshi.
de_de: Aber vielversprechende Technologien entstehen gerade auf Basis von Bitcoin. Ein Beispiel ist das Lightning Netzwerk, das billige, sofortige Mikrozahlungen von winzigen Bruchteilen eines bitcoins erlaubt. Mit dem Lightning Netzwerk kann man sinnvoll Beträge von 100 Satoshis bezahlen (wobei 1 Satoshi, 0,00000001 BTC entspricht), mit einer Gebühr von nur einem Satoshi.

source: Instant payments
de_de: Sofortzahlungen

source: Bitcoin payments take time to confirm. The recipient sees the payment immediately but shouldn’t trust the payment until the Bitcoin network confirms it, which typically happens within 20 minutes. Trusting an unconfirmed transaction can be risky; the sender can _double spend_ the bitcoins by sending the same bitcoins in another transaction to another Bitcoin address—for example, the sender’s.
de_de: Bitcoin Zahlungen benötigen Zeit zur Bestätigung. Der Empfänger sieht die Zahlung zwar sofort, sollte ihr aber nicht vertrauen, bis das Bitcoin Netzwerk sie bestätigt hat, was normalerweise innerhalb von 20 Minuten geschieht. Einer unbestätigten Zahlung zu vertauen ist riskant; der Absender kann die bitcoins _doppelt ausgeben_, indem er dieselben bitcoins in einer weiteren Transaktion an eine andere Bitcoin Adresse schickt–zum Beispiel an seine eigene.

source: The confirmation time can add friction in brick-and-mortar shops because customers don’t want to wait 20 minutes before getting their coffee. This might not be a big issue in some online shops, where the shop can wait 20 minutes before sending the goods to the customer; but some online services, such as pay-per-view, could find the confirmation time problematic.
de_de: Die nötige Zeit zur Bestätigung kann bei herkömmlichen Läden zu Reibung führen, weil Kunden ungern 20 Minuten warten wollen, bevor sie ihren Kaffee bekommen. Das mag bei manchen online Shops kein Problem sein, wo der Händler 20 Minuten abwarten kann, bevor er die Ware versendet; aber für einige online Dienste, zum Beispiel Video-on-Demand, könnte sich die Bestätigungszeit als problematisch erweisen.

source: This limitation can also be fixed by systems built on top of Bitcoin—for example, the Lightning Network—especially when the payment amount is small.
de_de: Diese Einschränkung kann ebenfalls durch Systeme oberhalb von Bitcoin–zum Beispiel das Lightning Netzwerk–ausgemerzt werden, besonders wenn die Beträge gering sind.

source: Savings you can’t afford to lose
de_de: Ersparnisse, deren Verlust man nicht verschmerzen kann

source: Bitcoin is probably the most secure money there is, but it’s still in its infancy. Things _could_ go bad with Bitcoin, as in the following scenarios:
de_de: Bitcoin ist wahrscheinlich das sicherste Geld, das es gibt, aber es befindet sich immer noch in der Anfangsphase. Die Sache _könnte_ noch schiefgehen, wie in den folgenden Szenarien:

source: Bitcoin security
de_de: Bitcoin Sicherheit

source: You are in charge of the security of your bitcoins. Only you. Be careful!
de_de: Du bist Herr über deine bitcoins. Nur du. Pass gut drauf auf!

source: You lose your private keys: the secrets you must have to spend your money.
de_de: Du verlierst deine privaten Schlüssel: die geheimen Daten, die du zum Ausgeben deiner bitcoins brauchst.

source: Your private keys are stolen by some bad guy.
de_de: Deine privaten Schlüssel werden von einem Bösewicht gestohlen.

source: The government in your location tries to crack down on Bitcoin users by imprisonment or other means of force.
de_de: Deine Regierung versucht gegen Bitcoin Benutzer durchzugreifen, indem es sie einsperrt oder anderweitig mit Gewalt vorgeht.

source: The price of Bitcoin swings down dramatically due to rumors or speculation.
de_de: Der Preis von Bitcoin sackt aufgrund von Gerüchten oder Spekulation dramatisch ab.

source: Software bugs make Bitcoin insecure.
de_de: Software Bugs machen Bitcoin unsicher.

source: Weaknesses arise in the cryptography Bitcoin uses.
de_de: Es tauchen Schwächen in der Kryptografie von Bitcoin auf.

source: Although all these risks are _possible_, most of them are unlikely. This list is somewhat ordered with the most likely at the top. Always weigh the risks before putting money on the line, and select your security measures accordingly. This book will help you understand the risks and how to secure your money.
de_de: Obwohl all diese Risiken _möglich_ sind, sind die meisten unwahrscheinlich. Diese Liste ist grob nach der Eintrittswahrscheinlichkeit geordnet, mit dem wahrscheinlichsten Szenario oben. Schätze selber immer die Risiken ab, bevor du Geld einsetzt, und such dir die geeigneten Sicherungsmassnahmen dazu aus. Dieses Buch wird dir helfen, die Risiken und Sicherungsmassnahmen für dein Geld zu verstehen.

source: Other cryptocurrencies
de_de: Andere Kryptowährungen

source: This book will cover Bitcoin, but several other so-called _crypto­currencies_ exist, and new ones pop up all the time. Cryptocurrencies other than Bitcoin are often referred to as _alt-coins_, meaning _alternative coins_. I’ll list a few alt-coins along with their purpose and market capitalization, or _market cap_ (<<altcoins-table>>). The market cap is the product of the money supply (number of coins) and the current market price per coin. Note that the market cap will most likely have changed a lot by the time you read this. I include this information only to give you a glimpse of Bitcoin’s position relative to other cryptocurrencies.
de_de: Dieses Buch behandelt Bitcoin, aber es existieren diverse andere sogenannte _Kryptowährungen_, und neue tauchen ständig auf. Andere Kryptowährungen als Bitcoin werden oft als _Altcoins_ bezeichnet, was für _alternative Coins_ steht. Ich werde einige Altcoins auflisten zusammen mit ihrem Zweck und ihrer Marktkapitalisierung (<<altcoins-table>>). Die Marktkapitalisierung ist das Produkt aus Geldmenge (Anzahl Coins) und dem aktuellen Marktpreis pro Coin. Die Marktkapitalisierung der Coins wird sich sehr wahrscheinlich erheblich geändert haben, wenn du diese Zeilen liest. Ich nehme diese Information nur auf, um dir einen Eindruck von Bitcoins Position relativ zu anderen Kryptowährungen zu geben.

source: Market capitalization of a few cryptocurrencies as of 11 November 2018
de_de: Marktkapitalisierung einiger Kryptowährungen Stand 11. November 2018

source: | Currency | Purpose | Market cap (billions of dollars) | image:{imagedir}/bitcoin-logo.png[role="smallheight"] | Global money; included for reference | 111 | image:{imagedir}/ethereum-logo.png[role="smallheight"] | Running software on a decentralized abstract computer | 22.4 | image:{imagedir}/monero-logo.png[role="smallheight"] | Privacy | 1.7 | image:{imagedir}/zcash-logo.png[role="smallheight"] | Privacy | 0.8 | image:{imagedir}/namecoin-logo.png[role="smallheight"] | Naming system; complements the domain name system (DNS) | 0.008
de_de: | Währung | Zweck | Marktkapitalisierung (Milliarden Dollar) | image:{imagedir}/bitcoin-logo.png[role="smallheight"] | Globale Geldmenge; zu Referenzzwecken | 111 | image:{imagedir}/ethereum-logo.png[role="smallheight"] | Programme auf einem dezentralen abstrakten Computer ausführen | 22.4 | image:{imagedir}/monero-logo.png[role="smallheight"] | Geheimhaltung | 1.7 | image:{imagedir}/zcash-logo.png[role="smallheight"] | Geheimhaltung | 0.8 | image:{imagedir}/namecoin-logo.png[role="smallheight"] | Namenssystem; ergänzt das Domain Name System (DNS) | 0.008

source: I encourage you to look up these cryptocurrencies, because they all provide interesting new features beyond Bitcoin. Hundreds of other alt-coins exist. Some, such as those in the table, provide unique features that aren’t available in Bitcoin, and others provide little to nothing innovative. Some alt-coins may even be outright scams. Stay vigilant.
de_de: Ich ermutige dich, dir diese Kryptowährung anzuschauen, denn sie haben alle interessante Eigenschaften jenseits von Bitcoin. Hunderte weiterer Altcoins existieren. Einige davon, so wie die in der Tabelle, bieten einzigartige Eigenschaften an, die es in Bitcoin nicht gibt, und andere bieten wenig bis gar nichts Neues. Einige Altcoins können auch direkter Betrug sein. Sei vorsichtig.

source: Anyone can create an alt-coin by taking existing cryptocurrency software and modifying it to their needs.
de_de: Jeder kann eine Altcoin erzeugen, indem er eine existierende Kryptowährung nimmt und an seine Bedürfnisse anpasst.
