Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: Let’s say Sheila wants to start an alt-coin, Wowcoin. She takes the Bitcoin software and changes the maximum money supply to 11,000,000, instead of Bitcoin’s 21,000,000 coins. When she starts Wowcoin, Sheila will be lonely because no one else is using her alt-coin. If she wants Wowcoin to have some real value, she must convince other people to begin using it. If she’s not providing anything innovative, she’s going to have a hard time getting other people on board, because they’re pretty happy with what Bitcoin already provides. Everybody else is using Bitcoin, so why would you use Wowcoin? Think of it as starting a new internet that you call Wownet. People on Wownet won’t be able to use services on the internet. Conversely, people on the internet won’t be able to use your service if you’re on Wownet. So why would anyone use Wownet? We call this the _network effect_ (see <<network-effect>>)—people tend to go where other people are.
de_de: Sagen wir, Sheila möchte eine Altcoin machen, Wowcoin. Sie nimmt die Bitcoin Software und ändert die maximale Geldmenge auf 11.000.000 statt Bitcoins 21.000.000 Coins. Wenn sie Wowcoin startet, wird Sheila ziemlich allein sein, denn niemand sonst benutzt ihre Altcoin. Um Wowcoin Wert einzuhauchen, muss sie andere Leute davon überzeugen, es ebenfalls zu benutzen. Wenn sie nichts innovatives bietet, wird es schwierig sein, Leute mit an Bord zu bekommen, denn die sind eigentlich ganz glücklich mit dem, was Bitcoin bietet. Jeder sonst benutzt Bitcoin, warum sollte man also jetzt Wowcoin verwenden? Stell es dir so vor, wie wenn du dein eigenes Internet starten würdest, das du Wownet nennen könntest. Die Leute im Wownet können nicht die Dienste des Internet benutzen. Und die Leute im Internet könnten umgekehrt auch nicht die Dienste des Wownet benutzen. Warum würde also überhaupt irgend jemand Wownet benutzen? Wir nennen dies den _Netzwerk Effekt_ (siehe <<network-effect>>)–Leute neigen dazu, dorthin zu gehen, wo schon andere Leute sind.

source: Network effect
de_de: Netzwerkeffekt

source: Although some interesting alt-coins are out there, it’s hard to tell which of these will survive long-term. Also, picking one or a few alt-coins to cover in this book would be an arbitrary choice. Consequently, I focus solely on Bitcoin.
de_de: Obwohl es ein paar interessante Altcoins gibt ist es schwer zu sagen, welche davon langfristig überleben werden. Ausserdem wäre es ziemlich willkürlich, eine oder einige Altcoins herauszupicken, um sie in diesem Buch zu behandeln. Daher konzentriere ich mich lieber ganz auf Bitcoin.

source: Summary
de_de: Zusammenfassung

source: Bitcoin is global, borderless money that anyone with an internet connection can use.
de_de: Bitcoin ist globales, grenzüberschreitendes Geld, das jeder benutzen kann, der über einen Internetzugang verfügt.

source: Many different actors use Bitcoin, including savers, merchants, and traders for various purposes, such as payments, remittances, and savings.
de_de: Viele verschiedene Akteure benutzen Bitcoin, unter anderem Sparer, Händler und Spekulanten, für die verschiedensten Zwecke, wie Zahlungen, Auslandstransfers und Geldanlagen.

source: A network of computers, the Bitcoin network, verifies and keeps records of all payments.
de_de: Ein Netzwerk von Computern, das Bitcoin Netzwerk, verifiziert und speichert alle Zahlungen.

source: A transaction goes through the following steps: send transaction, verify transaction, add transaction to the blockchain, and notify the recipient and sender wallets.
de_de: Eine Transaktion macht folgende Schritte durch: Transaktion senden, Transaktion überprüfen, Transaktion an die Blockchain anhängen, und die Wallets der Sender und Empfänger benachrichtigen.

source: Bitcoin solves problems with inflation, borders, segregation, and privacy by providing limited supply, decentralization, and borderlessness.
de_de: Bitcoin löst Probleme mit Inflation, Grenzen, Ausgrenzung und Datenschutz durch begrenztes Angebot, Dezentralisierung und Grenzenlosigkeit.

source: Several alternative cryptocurrencies exist apart from Bitcoin, such as Ethereum, Zcash, and Namecoin.
de_de: Diverse alternative Kryptowährungen existieren neben Bitcoin, wie Ethereum, Zcash und Namecoin.

source: A (crypto)currency becomes more useful as more users use it. This is called the network effect.
de_de: Eine (Krypto)währung wird nützlicher, je mehr Benutzer sie hat. Dies nennt man Netzwerkeffekt.

source: Cryptographic hash functions and digital signatures
de_de: Kryptografische Hashfunktionen und digitale Signaturen

source: This chapter covers
de_de: Dieses Kapitel behandelt

source: Creating a simple money system: cookie tokens
de_de: Ein einfaches Geld erschaffen: Keksgutscheine

source: Understanding cryptographic hash functions
de_de: Verstehen von kryptografischen Hashfunktionen

source: Authenticating payments using digital signatures
de_de: Authentifizierung von Zahlungen durch digitale Signaturen

source: Keeping your secrets secret
de_de: Geheimhaltung deiner Geheimnisse

source: I’ll start this chapter by setting the stage for the rest of this book. We’ll look at a simple payment system that we can improve on using Bitcoin technologies. By the time we get to <<ch08>>, this simple system will have evolved into what we call Bitcoin.
de_de: In diesem Kapitel setze ich zunächst den Rahmen für das Buch. Wir schauen uns ein einfaches Zahlungssystem an, das wir mit Bitcoin Technologien verbessern können. Wenn wir bei <<ch08>> ankommen, wird dieses System sich zu dem entwickelt haben, was wir Bitcoin nennen.

source: The second part of this chapter will teach you what you need to know about cryptographic hash functions. These are so important to Bitcoin that you really need to understand them before learning anything else. You’ll see how a cryptographic hash function can be used to verify that a file hasn’t changed since a previous point in time.
de_de: Der zweite Teil des Kapitels gibt dir das nötige Rüstzeug aus dem Bereich kryptografischer Hashfunktionen. Diese sind für Bitcoin so wichtig, dass du sie wirklich verstehen musst, bevor du irgendetwas anderes über Bitcoin lernst. Du wirst verstehen, wie eine kryptografische Hashfunktion verwendet werden kann, um zu überprüfen, dass eine Datei gegenüber einem früheren Zeitpunkt unverändert geblieben ist.

source: The rest of the chapter will solve the problem of the _imposter_: a bad guy claiming to be someone else to pay money from that someone’s account. We solve this problem by introducing digital signatures (<<fig0201>>) into the simple system.
de_de: Der Rest des Kapitels wird das Problem des _Betrügers_ behandeln: eines Bösewichts, der vorgibt, jemand anderes zu sein, um aus dessen Konto heraus Zahlungen zu leisten. Wir lösen dieses Problem, indem wir digitale Signaturen (<<fig0201>>) in das System einführen.

source: Digital signatures in Bitcoin
de_de: Digitale Signaturen in Bitcoin

source: The cookie token spreadsheet
de_de: Das Keksgutschein-Kalkulationsblatt

source: Suppose there’s a cafe in the office where you work. You and your coworkers use a spreadsheet to keep track of _cookie tokens_ (<<fig0202>>), which use the symbol CT. You can exchange cookie tokens for cookies in the cafe.
de_de: Angenommen, es gibt ein Café in dem Büro, in dem du arbeitest. Du und deine Kollegen benutzen ein Kalkulationsblatt, um über Keksgutscheine, oder _Cookie Tokens_, Buch zu führen (<<fig0202>>), die das Symbol CT benutzen. Du kannst Cookie Tokens im Café gegen Kekse eintauschen.

source: Bitcoin, the currency
de_de: Bitcoin, die Währung

source: A cookie token corresponds to a bitcoin, the currency unit of Bitcoin. Bitcoin got its first price point 2010 when someone bought two pizzas for 10,000 BTC. That money would get you 6,000,000 pizzas as of November 2018.
de_de: Ein Cookie Token entspricht einem bitcoin, der Währungseinheit von Bitcoin. Bitcoin bekam seinen ersten Preis im Jahr 2010, als jemand zwei Pizzen für 10.000 bitcoins kaufte. Mit diesem Geld hätte man im November 2018 ganze 60.000.000 Pizzen kaufen können.

source: The cookie token spreadsheet has a column for the sender, a column for the recipient, and a column for the number of cookie tokens transferred. New cookie token transfers are appended at the end of the spreadsheet.
de_de: Das Cookie Token Kalkulationsblatt, oder Spreadsheet, hat eine Spalte für den Absender, eine für den Empfänger, und eine für die Anzahl Tokens, die übertragen werden. Neue Cookie Token Transfers werden ans Ende des Spreadsheets angefügt.

source: Lisa stores this spreadsheet on her computer. It’s shared read-only for everybody on the office network to open and watch, except Lisa. Lisa is very trustworthy. Everybody trusts her. She has full access to do whatever she likes with the spreadsheet. You and all the others can only view the spreadsheet by opening it in read-only mode.
de_de: Lisa speichert dieses Spreadsheet auf ihrem Computer. Sie gibt den Kollegen im Büronetzwerk Lesezugriff, sodass jeder es öffnen und anschauen kann, ausser Lisa. Lisa ist sehr vertrauenswürdig. Jeder vertraut ihr. Sie hat vollen Zugriff auf das Spreadsheet und kann alles damit tun, was sie will. Du und die anderen können es aber nur ansehen, indem sie es im Read-Only-Modus öffnen.

source: Whenever Alice wants a cookie, she asks Lisa, who sits right next to the cafe, to transfer 10 CT from Alice to the cafe. Lisa knows who Alice is and can verify in the spreadsheet that she owns enough cookie tokens; she’ll search for “Alice” in the spreadsheet, sum all the amounts with Alice’s name in the To column, and subtract all the amounts with Alice’s name in the From column. <<fig0203>> shows the complete search result; three transfers involve Alice.
de_de: Immer wenn Alice einen Keks will, bittet sie Lisa, die direkt neben dem Café sitzt, 10 CT von Alice zum Café zu übertragen. Lisa weiss, wer Alice ist, und kann im Spreadsheet überprüfen, dass diese genug Tokens besitzt; sie sucht einfach nach “Alice” im Spreadsheet, zählt alle Beträge mit Alices Namen in der Spalte AN zusammen und zieht davon alle Beträge ab, bei denen “Alice” in der VON Spalte steht. <<fig0203>> zeigt das komplette Suchresultat; drei Transfers involvieren Alice.

source: Lisa calculates Alice’s balance. The sum of her received cookie tokens is 100, and the sum of her withdrawn cookie tokens is 30. Alice’s balance is 70 CT.
de_de: Lisa berechnet Alices Saldo. Die Summe ihrer erhaltenen Cookie Tokens ist 100, und die Summe der ausgegebenen Cookie Tokens ist 30. Alices Kontostand ist also 70.

source: Lisa calculates that Alice has 70 CT, enough for Alice to pay 10 CT to the cafe. She _appends_ a row at the end of the spreadsheet (<<fig0204>>).
de_de: Lisa berechnet, dass Alice 70 CT hat, was ausreicht, um 10 CT an das Café zu bezahlen. Folgender Eintrag wird an das Spreadsheet _angehängt_ (<<fig0204>>).

source: Lisa adds Alice’s payment for a cookie. The payment is appended last in the cookie token spreadsheet.
de_de: Lisa fügt Alices Zahlung für einen Keks hinzu. Die Zahlung wird als letzter Eintrag dem Cookie Token Spreadsheet angehängt.

source: The cafe sees this new row in the spreadsheet and hands a cookie over to Alice.
de_de: Das Café sieht diese neue Zeile im Kalkulationsblatt und reicht Alice einen Keks.

source: Earn them
de_de: Verdiene sie

source: You can also get cookie tokens as part of your salary.
de_de: Du kannst auch Keksgutscheine als Teil deines Gehalts bekommen.

source: When you run out of cookie tokens, you can buy tokens for dollars from someone who is willing to sell you some—possibly Anne or the cafe—at a price you both agree on. Lisa will then add a row to the spreadsheet accordingly.
de_de: Wenn du keine Cookie Tokens mehr hast, kannst du dir Tokens für Dollars von irgendjemandem kaufen, der dir welche verkaufen will–wahrscheinlich Anne vom Café–zu einem einvernehmlichen Preis. Lisa hängt dann eine entsprechende Zeile an das Spreadsheet an.

source: Lisa has promised never to remove or change anything in the spreadsheet, just add to it. What happens in the spreadsheet, stays in the spreadsheet!
de_de: Lisa hat versprochen, niemals irgendetwas im Spreadsheet zu entfernen oder abzuändern. Was im Spreadsheet geschieht, verbleibt im Spreadsheet!

source: Lisa, who is performing valuable work to secure this money system, is rewarded with 7,200 newly minted cookie tokens per day (<<fig0205>>). Every day, she adds a new row to the spreadsheet that creates 7,200 new cookie tokens with Lisa as the recipient.
de_de: Lisa, die die wertvolle Arbeit der Absicherung des Geldsystems leistet, wird täglich mit 7.200 frisch erzeugten Tokens belohnt (<<fig0205>>). Jeden Tag hängt sie eine neue Zeile an das Spreadsheet an, die 7.200 neue Cookie Tokens mit Lisa als Empfänger enthält.

source: Lisa is rewarded with cookie tokens.
de_de: Lisa wird mit Cookie Tokens belohnt.

source: Money supply curve
de_de: Geldmengenkurve

source: Bitcoin uses the same schedule for issuance as the cookie token spreadsheet. All new bitcoins are created as rewards to the nodes securing the Bitcoin ledger—the blockchain—just as Lisa is rewarded for securing the cookie token spreadsheet.
de_de: Bitcoin benutzt das gleiche Verfahren zur Gelderzeugung wie das Cookie Token Spreadsheet. Alle neuen bitcoins werden als Vergütung an die Nodes ausgeschüttet, die den Bitcoin Ledger–die Blockchain–absichern, genau wie Lisa für das Absichern des Cookie Token Spreadsheets belohnt wird.

source: This is how all the cookie tokens in the spreadsheet are created. The first row in the spreadsheet is a reward row—like the one in the spreadsheet just shown—that creates the very first 7,200 CT ever. The plan is that Lisa is rewarded with 7,200 CT per day during the first four years, and then the reward is halved to 3,600 CT/day for the next four years, and so on until the reward is 0 CT/day.
de_de: So werden alle Cookie Tokens im Spreadsheet erzeugt. Die erste Zeile im Spreadsheet ist die Belohnungszeile–wie die im gerade gezeigten Spreadsheet–die die ersten 7.200 CT überhaupt erzeugt hatte. Der Plan ist, dass Lisa in den ersten vier Jahren jeden Tag mit 7.200 CT belohnt wird, und sich danach die Belohnung auf 3.600 CT/Tag halbiert und so weiter, bis die Belohnung 0 CT/Tag beträgt.

source: Don’t worry, for now, about what happens when the reward approaches 0—that’s far in the future. We’ll discuss that in <<ch07>>. This reward halving makes the total money supply—the total number of cookie tokens in circulation—approach 21 million CT, but it will never exceed 21 million.
de_de: Mach dir im Moment keine Sorgen über das, was passiert, wenn die Belohnung auf 0 fällt–das liegt in ferner Zukunft. Wir diskutieren das in <<ch07>>. Diese Halbierung der Belohnung lässt den gesamten Geldvorrat–die gesamte Anzahl Cookie Tokens, die zirkulieren–gegen 21 Millionen CT konvergieren, aber es wird nie mehr als 21 Millionen CT geben.

source: What Lisa does with the new cookie tokens she earns is up to her. She can buy cookies or sell the cookie tokens. She can also save them for later. The spreadsheet system works well, and everybody eats a healthy number of cookies.
de_de: Was Lisa mit den neuen Cookie Tokens tut, die sie verdient, ist ihre Sache. Sie kann davon Kekse kaufen oder sie kann die Cookie Tokens verkaufen. Sie kann sie auch für später aufheben. Das Spreadsheet System funktioniert gut, und jeder isst eine anständige Menge Kekse.

source: Lisa basically performs the same work as miners in the Bitcoin network. She verifies payments and updates the ledger, the cookie token spreadsheet. <<tab0201>> clarifies how the concepts in the spreadsheet correspond to concepts in Bitcoin.
de_de: Lisa übernimmt im Grunde dieselbe Aufgabe wie die Miner im Bitcoin Netzwerk. Sie überprüft Zahlungen und aktualisiert den Ledger, das Cookie Token Spreadsheet. <<tab0201>> stellt klar, wie die Konzepte im Spreadsheet mit den Konzepten in Bitcoin korrelieren.

source: How key ingredients of the cookie token system and the Bitcoin system relate
de_de: Wie Schlüsselfunktionen im Cookie Token System und im Bitcoin System sich zueinander verhalten

source: | Cookie tokens | Bitcoin | Covered in | 1 cookie token | 1 bitcoin | <<ch02>> | The spreadsheet | The blockchain | <<ch06>> | A row in the spreadsheet | A transaction | <<ch05>> | Lisa | A miner | <<ch07>>
de_de: | Cookie Tokens | Bitcoin | Behandelt in | 1 Cookie Token | 1 bitcoin | <<ch02>> | Das Spreadsheet | Die Blockchain | <<ch06>> | Eine Zeile im Spreadsheet | Eine Transaktion | <<ch05>> | Lisa | Ein Miner | <<ch07>>

source: This table will follow us throughout the book. It describes differences between the cookie token system and Bitcoin. I’ll delete rows from it as I introduce various Bitcoin stuff. For example, the row “The spreadsheet” will be deleted in <<ch06>>, when we use a blockchain to store transactions. I’ll also add a few rows as I introduce new concepts for the cookie token system that differ from those in Bitcoin.
de_de: Diese Tabelle wird uns durch das ganze Buch begleiten. Sie beschreibt Unterschiede zwischen dem Cookie Token System und Bitcoin. Ich werde Zeilen daraus löschen, wenn ich diverse Bitcoin Sachen bespreche. Zum Beispiel wird die Zeile “Das Spreadsheet” in <<ch06>> gelöscht, wenn wir eine Blockchain benutzen, um Transaktionen zu speichern. Ich werde auch ein paar Zeilen hinzufügen, wenn ich neue Konzepte für das Cookie Token System hinzufüge, die von denen in Bitcoin abweichen.

source: At the end of <<ch08>>, this table will contain only the first row, mapping 1 cookie token to 1 bitcoin. This will mark the end of this cookie token example, and from that point, we’ll talk only about Bitcoin itself.
de_de: Am Ende von <<ch08>> wird diese Tabelle nur noch die erste Reihe enthalten, in der 1 Cookie Token auf 1 bitcoin abgebildet wird. Das bezeichnet das Ende des Cookie Token Beispiels, und von da an sprechen wir nur noch von Bitcoin selbst.

source: <<tab0202>> is your starting point for learning how Bitcoin works, which we can call version 1.0 of the cookie token spreadsheet system.
de_de: <<tab0202>> ist dein Startpunkt zum Lernen, wie Bitcoin funktioniert, was wir als Version 1.0 des Cookie Token Spreadsheet Systems bezeichnen können.

source: |Version|Feature|How
de_de: |Version|Feature|Wie

source: 2+|image:{commonimagedir}/new.png[role="gbnew"]1.0
de_de: 2+|image:{commonimagedir}/new.svg[role="gbnew"]1.0

source: |Simple payment system |Relies on Lisa being trustworthy and knowing everyone’s face |Finite money supply |7,200 new CT rewarded to Lisa daily; halves every four years
de_de: |Einfaches Bezahlsystem |Vertraut auf Lisas Integrität und ihre Kenntnis aller Mitarbeiter |Begrenzte Geldmenge |Lisa wird täglich mit 7,200 neuen CT belohnt; halbiert sich alle vier Jahre

source: We’ll add a lot of fancy stuff to this system and release a new version in every chapter. For example, at the end of this chapter, we’ll release version 2.0, which uses digital signatures to solve the problem of imposters. Every chapter will take us closer to the end result: Bitcoin. But please be aware that this isn’t at all how Bitcoin evolved in reality—I’m just using this made-up system to help explain each important topic in isolation.
de_de: Wir werden an dieses System eine Menge cooles Zeug dranbauen und in jedem Kapitel eine neue Version freigeben. Zum Beispiel geben wir am Ende dieses Kapitels die Version 2.0 heraus, die mit digitalen Signaturen das Problem des Betrugs löst. Jedes Kapitel bringt uns näher an das Endresultat: Bitcoin. Aber sei dir bitte klar darüber, dass sich Bitcoin nicht wirklich auf diese Weise entwickelt hatte–ich benutze dieses ausgedachte System lediglich als Hilfsmittel, um jedes wichtige Thema für sich selbst isoliert zu erklären.

source: Cryptographic hashes
de_de: Kryptografische Hashfunktionen

source: Cryptographic hashes are used everywhere in Bitcoin. Trying to learn Bitcoin without knowing what cryptographic hashes are is like trying to learn chemistry without knowing what an atom is.
de_de: Kryptografische Hashes werden in Bitcoin überall verwendet. Zu versuchen, Bitcoin zu lernen, ohne zu wissen, was kryptografische Hashes sind, ist wie zu versuchen Chemie zu lernen, ohne zu wissen, was ein Atom ist.

source: You can think of a cryptographic hash as a fingerprint. A person will produce the same fingerprint of her left thumb every time it’s taken, but it’s extremely hard to find another person with the same left thumb fingerprint. The fingerprint doesn’t disclose any information about the person other than that particular fingerprint. You can’t know what math skills or eye color the person has by looking at this fingerprint.
de_de: Man kann sich einen kryptografischen Hash wie einen Fingerabdruck vorstellen. Der Fingerabdruck des linken Daumens einer Person sieht immer gleich aus, egal wer oder wo man ihn nimmt, aber es ist äusserst schwierig, jemand anderen zu finden, der denselben linken Daumenabdruck hat. Der Fingerabdruck gibt keinerlei Informationen über die Person preis ausser dem Fingerabdruck selbst. Man kann von dem Fingerabdruck nicht auf die mathematischen Fähigkeiten oder die Augenfarbe der zugehörigen Person schliessen.

source: Digital information also has fingerprints. This fingerprint is called a _cryptographic hash_. To create a cryptographic hash of a file, you send the file into a computer program called a _cryptographic hash function_. Suppose you want to create a cryptographic hash—a fingerprint—of your favorite cat picture. <<fig0206>> illustrates this process.
de_de: Digitale Informationen besitzen ebenfalls Fingerabdrücke. Einen solchen Fingerabdruck bezeichnet man als _kryptografischen Hash_. Um den kryptografischen Hash einer Datei zu erzeugen, schickst du die Datei an ein Computerprogramm namens _kryptografische Hashfunktion_. Nehmen wir einmal an, du möchtest den kryptografischen Hash–einen Fingerabdruck– von deinem Lieblings-Katzenbild erzeugen. <<fig0206>> illustriert diesen Vorgang.

source: Creating a cryptographic hash of a cat picture. Input is the cat picture and output is a big number of 32 bytes.
de_de: Erzeugen des kryptografischen Hashes von einem Katzenbild. Eingabe ist das Katzenbild und Ausgabe ist eine grosse, 32 Byte lange Zahl.

source: A _bit_ is the smallest unit of information in a computer. It can take either of two different values: 0 or 1. Like a lightbulb, it can be either on or off. A _byte_ is 8 bits that together can take 256 different values. We often use _hexadecimal_, or _hex_, encoding when we display numbers in this book. Each byte is printed as two hex digits each in the range 0–f, where a = 10 and f = 15.
de_de: Ein _Bit_ ist die kleinste Informationseinheit in einem Computer. Es kann einen von zwei Werten annehmen: 0 oder 1. Wie eine Glühbirne kann es entweder an sein oder aus. Ein _Byte_ ist eine Gruppe von 8 Bits, die zusammen 256 Werte repräsentieren können. Wir verwenden oft _hexadezimale_ oder _Hex_ Darstellung, wenn wir Zahlen in diesem Buch darstellen. Dabei wird jedes Byte als zwei Hex Ziffern dargestellt, jede im Bereich von 0–f, wobei a = 10 und f = 15 entspricht.
