Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: This step is easy because we already discussed it in <<the-network-protocol>>. Selma enters the normal mode of operation. From now on, she’ll participate in block propagation and transaction propagation, and verify every transaction and block coming in (<<fig0837>>).
de_de: Dieser Schritt ist einfach, denn wir haben ihn bereits in <<the-network-protocol>> besprochen. Selma beginnt den Normalbetrieb. Von nun an wird sie bei der Block- und Transaktionsverbreitung mitmachen und jede einkommende Transaktion verifizieren (<<fig0837>>).

source: Selma is now running a full-blown full node.
de_de: Selma hat jetzt einen ausgewachsenen Full Node.

source: Selma is finally an active part of the Bitcoin peer-to-peer network.
de_de: Selma ist endlich ein aktiver Teil des Bitcoin Peer-to-Peer Netzwerks.

source: Running your own full node
de_de: Betrieb eines eigenen Full Nodes

source: Online instructions
de_de: Online Anleitungen

source: More detailed instructions for all major OSs are available at <<web-install>>.
de_de: Detailliertere Instruktionen für alle grösseren Betriebssysteme findest du auf <<web-install>>.

source: This section will walk you through setting up your own Bitcoin Core full node on a Linux OS. It’s intended for readers comfortable with the Linux OS and command line.
de_de: Dieser Abschnitt führt dich durch das Aufsetzen deines eigenen Bitcoin Full Nodes auf einem Linux OS. Es richtet sich an Leser, die sich mit Linux und der Kommandozeile auskennen.

source: You’ve seen how a Bitcoin full node is downloaded, started, and synchronized in theory. This section will help you install your own full node.
de_de: Du hast gesehen, wie in der Theorie ein Bitcoin Full Node heruntergeladen, gestartet und synchronisiert wird. Dieser Abschnitt hilft dir, deinen eigenen Full Node zu installieren.

source: This section requires that you
de_de: Dieser Abschnitt setzt voraus, dass du

source: Have a computer with at least 2 GB of RAM running a Linux OS.
de_de: Einen Computer mit mindestens 2 GB RAM und einem Linux OS hast

source: Have lots of available disk space. As of this writing, about 210 GB is needed.
de_de: Eine Menge freien Platz auf der Festplatte hast, etwa 210 GB werden benötigt.

source: Have an internet connection without a limited data plan.
de_de: Eine Internetverbindung ohne eingeschränkten Datenvolumen.

source: Know how to start and use a command-line terminal.
de_de: Weisst, wie man zu einer Kommandozeile kommt und wie man sie bedient.

source: If you don’t have a Linux OS, you can still use these instructions; but you’ll have to install the version of Bitcoin Core that’s appropriate for your system, and the commands will look different. I suggest that you visit <<web-install>> to get up-to-date instructions for your non-Linux OS.
de_de: Wenn du kein Linux OS hast, kannst du diese Anweisungen trotzdem benutzen; aber du musst die Version von Bitcoin Core installieren, die zu deinem Betriebssystem passt, und die Kommandos werden anders aussehen. Ich schlage vor, du gehst auf <<web-install>> um aktuelle Anweisungen für dein nicht-Linux OS zu bekommen.

source: The general process for getting your own node running is as follows:
de_de: Im allgemeinen ist der Prozess, um seinen eigenen Node aufzusetzen, folgender:

source: Download Bitcoin Core from https://bitcoincore.org/en/download.
de_de: Lade Bitcoin Core von https://bitcoincore.org/en/download herunter.

source: Verify the software.
de_de: Verifiziere die Software.

source: Unpack and start.
de_de: Entpacke und starte sie.

source: Wait for the initial blockchain download to finish.
de_de: Warte, bis der Initial Blockchain Download fertig ist.

source: Downloading Bitcoin Core
de_de: Bitcoin Core downloaden

source: To run your own full Bitcoin node, you need the software program to run. In this example, you’ll download Bitcoin Core from <<web-download>>. As of this writing, the latest version of Bitcoin Core is 0.17.0. Let’s download it:
de_de: Um deinen eigenen Bitcoin Full Node zu betreiben, musst du das Softwareprogramm laufen lassen. In diesem Beispiel lädst du Bitcoin Core von <<web-download>> herunter. Zum Zeitpunkt des Schreibens ist die jüngste Version von Bitcoin Core 0.17.0. Laden wir sie herunter:

source: As the filename bitcoin-0.17.0-x86_64-linux-gnu.tar.gz indicates, the command downloads version 0.17.0 for 64-bit (x86_64) Linux (linux-gnu). By the time you read this, new versions of Bitcoin Core will probably have been released. Consult <<web-download>> to get the latest version of Bitcoin Core. Also, if you use another OS or computer architecture, please select the file that’s right for you.
de_de: Wie der Dateiname bitcoin-0.17.0-x86_64-linux-gnu.tar.gz andeutet, lädt das Kommando die Version 0.17.0 für 64-bit (x86_64) Linux (linux-gnu). Zu der Zeit, wo du dies hier liest, sind wahrscheinlich schon neuere Versionen von Bitcoin Core freigegeben worden. Schaue auf <<web-download>> nach, um die jüngste Version von Bitcoin Core zu bekommen. Und falls du ein anderes Betriebssystem oder eine andere Computerarchitektur benutzt, dann suche bitte die richtige Datei für dich aus.

source: Verifying the software
de_de: Verifizieren der Software

source: This section is hard and requires a fair amount of work on the command line. If you just want to install and run the Bitcoin Core software for experimental purposes, you can skip this section and jump to <<unpack-and-start>>. If you aren’t using it for experimental purposes, please understand the risks explained earlier in this chapter in <<step-1>> before skipping this step.
de_de: Dieser Abschnitt ist schwierig und verlangt eine ganze Menge Arbeit auf der Kommandozeile. Wenn du die Bitcoin Core Software nur zum experimentieren installieren und laufen lassen willst, kannst du diesen Abschnitt überspringen und zu <<unpack-and-start>> springen. Wenn du es nicht nur zum experimentieren nimmst, dann verstehe bitte zunächst die Risiken die weiter vorne in diesem Kapitel unter <<step-1>> besprochen wurden, bevor du weiterspringst.

source: This section will show you how to verify that the downloaded .tar.gz file hasn’t been tampered with in any way. This file is digitally signed by the Bitcoin Core team’s private key. The verification process involves the following steps:
de_de: Dieser Abschnitt zeigt dir, wie du verifizieren kannst, dass die heruntergeladene .tar.gz Datei nicht irgendwie verfälscht worden ist. Die Datei ist mit dem private Key des Bitcoin Core Teams signiert worden. Der Überprüfungsprozess besteht aus den folgenden drei Schritten:

source: Download the signature file.
de_de: Lade die Signaturdatei herunter

source: Verify that the hash of the .tar.gz file matches the hash in the message part of the signature file.
de_de: Verifiziere, dass der Hash der .tar.gz Datei zum Hash im Message Teil der Signaturdatei passt.

source: Download the Bitcoin Core team’s public key.
de_de: Lade den public Key des Bitcoin Core Teams herunter.

source: Install the public key as trusted on your computer.
de_de: Installiere den public Key als vertrauenswürdig auf deinem Computer.

source: Verify the signature.
de_de: Verifiziere die Signatur.

source: Let’s get started.
de_de: Fangen wir an.

source: Downloading the signature file
de_de: Herunterladen der Signaturdatei

source: To verify that your downloaded Bitcoin Core package is actually from the Bitcoin Core team, you need to download the signature file named SHA256SUMS.asc. <<fig0838>>, repeated from <<step-1>>, explains how the SHA256SUMS.asc file is designed.
de_de: Um zu prüfen, dass dein heruntergeladenes Bitcoin Paket tatsächlich vom Bitcoin Core Team stammt, muss du die Signaturdatei namens SHA256SUMS.asc herunterladen. <<fig0838>>, wiederholt von <<step-1>>, erklärt den Aufbau der SHA256SUMS.asc Datei.

source: Download the signature file SHA256SUMS.asc from the same server you downloaded the program from:
de_de: Lade die Signaturdatei SHA256SUMS.asc von demselben Server, von dem du das Programm geladen hast:

source: This file will be used to verify that the downloaded .tar.gz file is signed by the Bitcoin Core team. Note that this file is for version 0.17.0 only. If you use another version of Bitcoin Core, please select the correct signature file at <<web-download>>.
de_de: Die Datei wird benutzt, um zu überprüfen, dass das geladene .tar.gz File vom Bitcoin Core Team signiert wurde. Beachte, dass diese Datei nur für Version 0.17.0 gilt. Wenn du eine andere Version von Bitcoin Core benutzt, dann hol dir die passende Signaturdatei von <<web-download>>.

source: The following listing shows what the contents of this file look like (the actual hashes have been shortened):
de_de: Das folgende Listing zeigt, wie der Inhalt der Datei aussieht (die eigentlichen Hashes sind abgekürzt worden):

source: The signed message in the upper part of the file lists several files along with their respective SHA256 hashes. The listed files are installation packages for all OSs and architectures for which Bitcoin Core is released. The lower part of the file is the signature of the message in the upper part. The signature commits to the entire message and thus to all the hashes and files listed in the message.
de_de: Die signierte Message im oberen Teil der Datei listet mehrere Dateien zusammen mit ihren jeweiligen SHA256 Hashes auf. Die aufgezählten Dateien sind Installationspakete für alle Betriebssysteme und Architekturen, für die Bitcoin Core freigegeben worden ist. Der untere Teil der Datei ist die Signatur der Message im oberen Teil. Die Signatur bindet sich an die gesamte Message und damit an alle Hashes und Dateien, die in der Message aufgelistet werden.

source: Verifying the hash of the downloaded file
de_de: Überprüfen des Hashes der heruntergeladenen Datei

source: The file you downloaded is named bitcoin-0.17.0-x86_64-linux-gnu.tar.gz so you expect that the SHA256 hash of that file matches `9d6b…5a4f` exactly. Let’s check:
de_de: Die Datei, die du heruntergeladen hast, heisst bitcoin-0.17.0-x86_64-linux-gnu.tar.gz, also erwartest du, dass der SHA256 Hash dieser Datei mit `9d6b…5a4f` übereinstimmt. Schauen wir mal nach:

source: This command calculates the SHA256 hash of your downloaded file. It does indeed match the hash in the SHA256SUMS.asc file. If they don’t match, then something is wrong, and you should halt the installation and investigate.
de_de: Das Kommando berechnet den SHA256 Hash deines heruntergeladenen Files. Er stimmt tatsächlich mit dem Hash in der Datei SHA256SUMS.asc überein. Wenn die beiden nicht übereinstimmen würden, dann würde irgendetwas nicht stimmen und du solltest mit der Installation aufhören und nachschauen, was da los ist.

source: Getting the Bitcoin Core signing key
de_de: Den Bitcoin Core Signier Key holen

source: To verify that the signature in the signature file was done using the Bitcoin Core signing key, you need the corresponding public key. As noted in <<step-1>>, you should convince yourself about what fingerprint the Bitcoin Core key has and then download that key from any source.
de_de: Um zu prüfen, dass die Signatur in der Signaturdatei mit dem Bitcoin Core Key geleistet wurde, brauchst du den dazugehörigen public Key. Wie in <<step-1>> erwähnt, musst du nachschauen, welchen Fingerprint der Bitcoin Core Key besitzt, und dann diesen Key von irgendwo herunterladen.

source: You could, for example,
de_de: Du könntest zum Beispiel:

source: Get the fingerprint of the Bitcoin Core team’s key from https://bitcoincore.org, the official website of the Bitcoin Core team.
de_de: Den Fingerprint des Bitcoin Core Teams von https://bitcoincore.org holen, der offiziellen Webseite des Bitcoin Core Teams.

source: Consult the book _Grokking Bitcoin_ to verify the fingerprint.
de_de: Im Buch _Bitcoin Begreifen_ nachschauen, um den Fingerprint zu prüfen.

source: Start by finding the Bitcoin Core team’s public key fingerprint on their website. You find the following fingerprint on the downloads page:
de_de: Fang damit an, dass du den Bitcoin Core Team public Key Fingerprint auf deren Webseite suchst. Du findest den folgenden Fingerprint auf der Download Seite:

source: Now, consult the book _Grokking Bitcoin_ to check if the fingerprint in that book matches the fingerprint from https://bitcoincore.org. Look in the <<step-1>> of <<ch08>> of that book. It says
de_de: Jetzt schau in das Buch _Bitcoin Begreifen_, um zu prüfen, dass der Fingerprint im Buch zu dem auf https://bitcoincore.org passt. Schau in <<step-1>> von <<ch08>>. Dort steht

source: This is the same fingerprint (although formatted slightly differently). The book and the website https://bitcoincore.org both claim that this key belongs to the Bitcoin Core team. Let’s not settle for that. You’ll also call a friend you trust and have her read the fingerprint to you:
de_de: Das ist derselbe Fingerprint (wenn auch etwas anders formatiert). Das Buch und die Webseite https://bitcoincore.org behaupten beide, dass dieser Key zum Bitcoin Core Team gehört. Verlassen wir uns aber nicht darauf. Du rufst ausserdem einen Freund an und lässt dir den Fingerprint vorlesen:

source: *You:* “Hello, Donna! What’s the fingerprint of the current Bitcoin Core signing key?”
de_de: *Du:* “Hallo, Donna! Wie lautet der Fingerprint des aktuellen Bitcoin Core Signatur Keys?”

source: *Donna:* “Hi! I verified that key myself a few months ago, and I know the fingerprint is `01EA 5486 DE18 A882 D4C2 6845 90C8 019E 36C2 E964`.”
de_de: *Donna:* “Hi! Ich habe den selbst erst vor ein paar Monaten verifiziert und ich weiss, dass der Fingerprint `01EA 5486 DE18 A882 D4C2 6845 90C8 019E 36C2 E964`. ist”

source: *You:* “Thank you, it matches mine. Goodbye!”
de_de: *Du:* “Danke, das stimmt mit meinem überein. Tschüss!”

source: *Donna:* “You’re welcome. Goodbye!”
de_de: *Donna:* “Bitteschön. Tschüss!”

source: Donna’s statement further strengthens your trust in this key. You think you’ve collected enough evidence that this is, in fact, the correct key.
de_de: Donnas Aussage verstärkt dein Vertrauen in diesen Key. Jetzt glaubst du, genügend Beweise dafür zu haben, dass dies in der Tat der korrekte Key ist.

source: Let’s start downloading the key. To do this, you can use a tool called gpg, which stands for GnuPG, which in turn stands for Gnu Privacy Guard. This program conforms to a standard called OpenPGP (Pretty Good Privacy). This standard specifies how keys can be exchanged and how to do encryption and digital signatures in an interoperable way.
de_de: Fangen wir damit an, den Key herunterzuladen. Um dies zu tun, kannst du ein Tool namens gpg benutzen, was für GnuPG steht, was wiederum eine Abkürzung für Gnu Privacy Guard ist. Dieses Programm entspricht einem Standard namens OpenPGP (Pretty Good Privacy). Dieser Standard spezifiziert, wie Keys ausgetauscht werden können, und wie Verschlüsselung und digitale Signaturen in kompatibler Weise zu erledigen sind.

source: GnuPG is available on most Linux computers by default. To download a public key with a certain fingerprint, you run the following `gpg` command:
de_de: GnuPG ist auf den meisten Linux Computern per Default installiert. Um einen public Key mit einem bestimmten Fingerprint zu laden, gibst du das folgende `gpg` Kommando ein:

source: Depending on the version of gpg you use, the output can vary. This command downloads the public key from any available key server and verifies that the downloaded public key in fact has the fingerprint that you requested. The owner of this key is “Wladimir J. van der Laan (Bitcoin Core binary release signing key).”
de_de: Je nachdem, welche Version von gpg du benutzt, kann der Output variieren. Dieses Kommando lädt den public Key von einem verfügbaren Key Server und verifiziert, dass der geladene public Key tatsächlich den Fingerprint besitzt, den du angefordert hast. Der Besitzer des Keys ist “Wladimir J. van der Laan (Bitcoin Core binary release signing key).”

source: The prior command downloads the key into gpg and adds it to your list of known keys. But the output of this command mentions “no ultimately trusted keys found.” This means this key isn’t signed by any key that you trust. You’ve only imported the key. In gpg, keys can sign other keys to certify that the signed key is legit.
de_de: Der vorangegangene Befehl lädt den Key in gpg und fügt ihn deiner Liste bekannter Keys hinzu. Aber im Output des Befehls steht “no ultimately trusted keys found,” also “keine ultimativ vertrauenswürdigen Keys gefunden.” Dies bedeutet, dass dieser Key nicht von irgendeinem Key, dem du vertraust, signiert worden ist. Du hast den Key nur importiert. In gpg können Keys andere Keys signieren, um deren Legitimität zu bezeugen.

source: Signing the public key as trusted on your computer
de_de: Signiere den public Key auf deinem Computer als vertrauenswürdig

source: You’ve verified that the key belongs to the Bitcoin Core team and installed that key onto your system using gpg.
de_de: Du hast verifiziert, dass der Key zum Bitcoin Core Team gehört und ihn mittels gpg auf deinem System installiert.

source: You’ll now sign that key with a private key that you own. You do this to remember this key as trusted. The Bitcoin Core team will probably release new versions of Bitcoin Core in the future. If GnuPG remembers this public key as trusted, you won’t have to go through all these key-verification steps again when you upgrade.
de_de: Du wirst jetzt diesen Key mit einem private Key signieren, der dir gehört. Das tust du, um dir zu merken, dass du diesem Key vertraust. Das Bitcoin Core Team wird wahrscheinlich künftig weitere Versionen von Bitcoin Core freigeben. Wenn GnuPG sich diesen public Key als vertrauenswürdig merkt, musst du nicht mehr durch all diese Key-Verifikations-Schritte gehen, wenn du einen Upgrade installierst.

source: Create a key of your own.
de_de: Erzeuge deinen eigenen Key.

source: Sign the Bitcoin Core public key with your own private key.
de_de: Signiere den Bitcoin Core public Key mit deinem eigenen private Key.

source: GnuPG lets you create a key of your own with the following command:
de_de: GnuPG lässt dich mit folgendem Befehl einen eigenen Key erzeugen:

source: Note: Use "gpg --full-generate-key" for a full featured key generation dialog.
de_de: Hinweis: Gib "gpg --full-generate-key" ein und du bekommst einen vollständigen Key-Erzeugungs-Dialog.

source: GnuPG needs to construct a user ID to identify your key.
de_de: GnuPG muss eine Benutzer ID konstruieren, um deinen Key zu identifizieren.

source: GnuPG will ask for your name and email address. Answer these questions; they’ll be used to identify your key:
de_de: GnuPG fragt nach deinem Namen und deiner Mailadresse. Beantworte diese Fragen, denn sie dienen zur Identifizierung deines Keys:

source: Continue by pressing O (capital letter “oh”). You then need to select a password with which to encrypt your private key. Choose a password, and make sure you remember it.
de_de: Mach weiter, indem du O drückst (den Grossbuchstaben “oh”). Dann musst du dir ein Passwort ausdenken, mit dem der private Key verschlüsselt wird. Such das Passwort aus, und sorge dafür, dass du es nicht vergisst oder verlierst.

source: Key generation might take a while, because it takes time to generate good random numbers for your key. When it’s finished, you should see output like this:
de_de: Die Key Erzeugung kann eine Weile dauern, weil es etwas Zeit braucht, für den Key gute Zufallszahlen zu erzeugen. Wenn es fertig ist, solltest du einen Output wie diesen sehen:

source: You now have a key of your own that you’ll use to sign keys that you trust. Let’s sign the Bitcoin Core team key:
de_de: Jetzt hast du einen eigenen Key, mit dem du Keys signieren kannst, denen du vertraust. Signieren wir den Bitcoin Core Team Key:

source: Enter `y`. You’ll be prompted for your private key password. Enter it, and press Enter. The Bitcoin Core key should now be regarded as trusted by gpg. This will simplify the process when you upgrade your node in the future.
de_de: Gib `y` ein. Dann wirst du nach dem Passwort des private Keys gefragt. Gib es ein und drücke Enter. Der Bitcoin Core Key sollte jetzt von gpg als vertrauenswürdig eingestuft worden sein. Das vereinfacht den Ablauf, wenn du künftig einen Upgrade der Node Software einspielen willst.

source: Let’s look at your newly signed key:
de_de: Schauen wir uns den neu signierten Key einmal an:

source: The word to look for is `full` in square brackets. This means gpg, and you, fully trust this key.
de_de: Das Wort, das wir suchen, ist `full` in eckigen Klammern. Das bedeutet, dass gpg und du, ihr beide dem Key vollständig vertraut.

source: Verifying the signature
de_de: Verifizieren der Signatur

source: It’s time to verify the signature of the SHA256SUMS.asc file:
de_de: Es ist Zeit, die Signatur der SHA256SUMS.asc Datei zu verifizieren:

source: It says that the signature is `Good` and that it’s signed with a key that you fully trust, `[full]`.
de_de: Da steht, dass die Signatur `Good` ist und mit einem Schlüssel signiert ist, dem du voll und ganz vertraust, `[full]`.

source: To summarize, you’ve done the following:
de_de: Zusammenfassend hast du Folgendes getan:

source: Downloaded Bitcoin Core and the signature file
de_de: Bitcoin Core und die Signaturdatei heruntergeladen

source: Verified that the hash of the .tar.gz file matches the stated hash in SHA256SUMS.asc
de_de: Überprüft, ob der Hash der Datei .tar.gz mit dem in SHA256SUMS.asc angegebenen Hash übereinstimmt

source: Downloaded a public key and verified that it belongs to Bitcoin Core
de_de: Einen public Key heruntergeladen und überprüft, ob er zu Bitcoin Core gehört

source: Signed that key with your own private key so GnuPG and you remember that the Bitcoin Core key is legit
de_de: Den Key mit deinem eigenen private Key signiert, damit GnuPG und du sich merken, dass der Bitcoin Core Key legitim ist

source: Verified the signature of the SHA256SUMS.asc file
de_de: Die Signatur der Datei SHA256SUMS.asc verifiziert

source: When you later upgrade the program, you can skip several of these steps. The process will then be
de_de: Wenn du das Programm später upgraden willst, kannst du mehrere dieser Schritte überspringen. Der Prozess beschränkt sich dann auf diese Schritte

source: Download Bitcoin Core and the signature file.
de_de: Bitcoin Core und die Signaturdatei herunterladen.

source: Verify that the hash of the .tar.gz file matches the stated hash in SHA256SUMS.asc.
de_de: Prüfen, dass der Hash der .tar.gz Datei mit dem Hash in SHA256SUMS.ac übereinstimmt.

source: Verify the signature of the SHA256SUMS.asc file.
de_de: Die Signatur der SHA256SUMS.asc Datei überprüfen.

source: Unpacking and starting
de_de: Auspacken und starten

source: Let’s unpack the software:
de_de: Packen wir die Software aus:

source: This will create a directory called bitcoin-0.17.0. Go into the directory bitcoin-0.17.0/bin, and have a look:
de_de: Das erzeugt ein Verzeichnis namens bitcoin-0.17.0. Gehe in das Verzeichnis bitcoin-0.17.0/bin und schau dich um:

source: Here you have several executable programs:
de_de: Hier hast du mehrere ausführbare Programme:

source: bitcoin-cli is a program you can use to extract information about the node you’re running as well as manage a built-in wallet that’s shipped with Bitcoin Core.
de_de: bitcoin-cli ist ein Programm, mit dem sowohl man Informationen über den Node, der auf dem Computer läuft, herauskriegen kann, als auch das eingebaute Wallet verwalten kann, das bei Bitcoin Core mitgeliefert wird.

source: bitcoind is the program to use if you want to run the node in the background without a graphical user interface (GUI).
de_de: Das Programm bitcoind benutzt man, wenn man den Node im Hintergrund ohne grafische Benutzerschnittstelle (GUI) laufen lassen will.
