Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: Lisa is now doing the exact same tasks as a Bitcoin miner, which is why we remove Lisa from the table as well. The shared folder will be the last bit of the cookie token system we’ll take care of. That’s for the next chapter.
de_de: Lisa erledigt exakt dieselben Arbeiten wie ein Bitcoin Miner, weshalb wir Lisa ebenfalls aus der Tabelle entfernt haben. Der Shared Folder wird das letzte Stück vom Cookie Token System sein, dessen wir uns annehmen. Das kommt im nächsten Kapitel.

source: It’s time to release a shiny new version of the cookie token system (<<tab0706>>).
de_de: Es ist Zeit, eine schillernde neue Version des Cookie Token Systems vorzustellen (<<tab0706>>).

source: 2+|image:{commonimagedir}/new.png[role="gbnew"]7.0
de_de: 2+|image:{commonimagedir}/new.svg[role="gbnew"]7.0

source: | Censorship-resistant | Multiple miners, “Lisas,” enabled by proof of work | Anyone can join the mining race | Automatic difficulty adjustments
de_de: | Zensurresistent | Multiple Miner, “Lisas,” ermöglicht durch Proof of Work | Jeder darf beim Mining mitmachen | Automatische Difficulty Anpassungen

source: | Prevent Lisa from deleting transactions | Signed blocks in a blockchain | Fully validating nodes | Download and verify the entire blockchain | Lightweight wallet saves data traffic | Bloom filters and merkle proofs
de_de: | Hindert Lisa am Löschen von Transaktionen | Signierte Blöcke in einer Blockchain | Voll validierende Nodes | Lädt und verifiziert die gesamte Blockchain | Lightweight Wallet spart Daten | Bloom Filter und Merkle Proofs

source: | Spend multiple “coins” in one payment | Multiple inputs in transactions | Anyone can verify the spreadsheet | Make the signatures publicly available in the transactions | Sender decides criteria for spending the money | Script programs inside transactions
de_de: | Mehrere “Coins” in einer Zahlung | Mehrere Inputs in Transaktionen | Jeder kann das Spreadsheet überprüfen | Signaturen in Transaktionen öffentlich einsehbar | Sender legt Kriterien für das Ausgeben fest | Script Programme in Transaktionen

source: In what way was Lisa a central authority in <<ch06>>?
de_de: Inwiefern war Lisa eine zentrale Autorität in <<ch06>>?

source: Why would the possibility of censoring transactions decrease with multiple miners, or “Lisas”?
de_de: Warum sollte die Möglichkeit der Zensur von Transaktionen bei mehreren Minern, oder “Lisas,” abnehmen?

source: Drawing random numbers worked quite well, but we abandoned this idea. Why was the idea naive?
de_de: Zufallszahlen zu ziehen funktionierte ganz gut, aber wir haben die Idee verworfen. Warum war die Idee naiv?

source: How do you check if a proof of work is valid?
de_de: Wie prüft man die Gültigkeit eines Proof of Work?

source: How does a miner generate a valid proof of work?
de_de: Wie erzeugt ein Miner einen validen Proof of Work?

source: What is meant by _strongest chain_?
de_de: Was bedeutet _Stärkste Chain_?

source: What does it mean when a miner has the hashrate 100 Mhash/s?
de_de: Was bedeutet es, wenn ein Miner eine Hashrate von 100 MHash/s hat?

source: A retarget period has just ended, and the last 2,016 blocks took 15 days to produce. Will the target increase or decrease?
de_de: Eine Retarget-Periode ist gerade zu Ende gegangen, und die Produktion der letzten 2.016 Blöcke dauerte 15 Tage. Wird das Ziel zunehmen oder abnehmen?

source: At what percentage of the hashrate can you be certain to pull off a double spend, if you’re willing to try indefinitely?
de_de: Bei welchem Prozentsatz der Hashrate kann man sich sicher sein, einen Double Spend erfolgreich durchführen zu können, wenn du bereit bist, es beliebig lang zu probieren?

source: Suppose a big block and a small block are created at the same time. Why is the big block less likely to become part of the strongest chain compared to the small block?
de_de: Angenommen ein grosser Block und ein kleiner Block werden gleichzeitig erzeugt. Warum ist es für den grossen Block weniger wahrscheinlich, in die Blockchain aufgenommen zu werden als für den kleinen?

source: Suppose the block rate suddenly doubles exactly in the middle of a retarget period. It goes from 6 blocks per hour to 12 blocks per hour, on average. No other changes happen during the retarget period. What will happen to the target after this period?
de_de: Angenommen die Block Rate verdoppelt sich plötzlich genau in der Mitte einer Retarget Periode. Sie springt von durchschnittlich 6 Blocks pro Stunde auf 12 Blocks pro Stunde. Sonst passieren keine weiteren Änderungen während der Retarget Periode. Was passiert mit dem Target nach Ablauf dieser Periode?

source: Suppose Selma has 52% of the total hashrate. She decides to change the retarget period of her software program from 2,016 blocks (two weeks) to 144 blocks (one day). No one else thinks this is a good idea, and they keep running the old software. What will happen after her next retarget period of one day when she adjusts her target? Will the rest of the miners and full nodes accept Selma’s blocks? Who will suffer from this situation?
de_de: Angenommen Selma besitzt 52% der Hashrate. Sie beschliesst, die Retarget Periode ihres Software Programms von 2.016 Blocks (zwei Wochen) auf 144 Blocks (ein Tag) zu ändern. Niemand sonst hält das für eine gute Idee, und sie lassen weiter ihre alte Software laufen. Was passiert nach ihrer nächsten Retarget Periode von einem Tag, wenn sie ihr Target neu justiert? Wird der Rest der Miner und Full Nodes Selmas Blocks akzeptieren? Wer wird unter dieser Situation leiden?

source: Why would a miner choose not to confirm a transaction that pays a very small transaction fee?
de_de: Warum würde ein Miner entscheiden, eine Transaktion nicht zu bestätigen, die eine sehr kleine Transaction Fee zahlt?

source: Having multiple miners avoids a central authority that can censor transactions.
de_de: Mehrere Miner zu haben, vermeidet eine zentrale Autorität, die Transaktionen zensieren könnte.

source: Proof of work is used to select who gets to create a block.
de_de: Proof of Work wird benutzt, um zu finden, wer einen Block an die Blockchain hängen darf.

source: Proof of work enables anyone to start mining without asking for permission.
de_de: Proof of Work ermöglicht es jedem, zu minen, ohne um Erlaubnis zu fragen.

source: The target is automatically calibrated every 2,016 blocks to keep money creation at the predetermined rate.
de_de: Das Target wird automatisch alle 2.016 Blocks kalibriert, um die Geldausgabe auf der festgelegten Rate zu halten.

source: A transaction fee gives miners incentive to include the transaction in their block.
de_de: Eine Transaction Fee gibt den Minern einen Anreiz, die Transaktion in einen Block zu integrieren.

source: To keep the risk of double spends low, the recipient of cookie tokens, or bitcoins, selects how many confirmations are needed.
de_de: Um das Risiko von Double Spends niedrig zu halten, legt der Empfänger von Cookie Tokens, oder bitcoins, fest, wie viele Confirmations benötigt werden.

source: A miner gets as much in block rewards as it deserves. The more hashrate it puts into the system, the bigger share of the rewards it gets.
de_de: Ein Miner bekommt so viel in Block Rewards, wie er verdient. Je mehr Hashrate er in das System steckt, desto grösser wird sein Anteil an den Rewards.

source: The stronger a chain is—the more accumulated proof of work it has—the harder it is to rewrite that chain.
de_de: Je stärker eine Chain ist–je mehr gesammelten Proof of Work sie enthält–desto schwerer ist es, die Chain nachträglich zu ändern.

source: Peer-to-peer network
de_de: Peer-to-Peer Netzwerk

source: Removing the last central authority: the shared folder
de_de: Entfernen der letzten zentralen Autorität: der Shared Folder

source: Following a transaction in the peer-to-peer network
de_de: Verfolgen einer Transaktion im Peer-to-Peer Netzwerk

source: Leaving behind the silly cookie tokens
de_de: Abschied von den albernen Cookie Tokens

source: Bootstrapping the peer-to-peer network
de_de: Bootstrappen des Peer-to-Peer Netzwerks

source: Let’s talk about the elephant in the room: the shared folder. All blocks the miners produce must pass through the shared folder on their way to other full nodes and miners. This chapter will remove the central shared folder and replace it with a decentralized _peer-to-peer network_ (<<fig0801>>). The peer-to-peer network lets full nodes (including miners) send blocks directly to each other. When nodes can talk directly to each other, we no longer need a central point of authority for communication.
de_de: Reden wir mal Tacheles: Reden wir von dem Shared Folder, den alle von den Minern produzierten Blocks auf ihrem Weg zu den anderen Minern und Full Nodes passieren müssen. Dieses Kapitel wird den zentralen Share entfernen und ihn durch ein dezentralisiertes Netzwerk von Gleichen, ein sog. Peer-to-Peer Netzwerk, ersetzen (<<fig0801>>). Das Peer-to-Peer Netzwerk ermöglicht es den Full Nodes (einschliesslich Minern) sich einander die Blocks direkt zu schicken. Wenn Nodes direkt miteinander sprechen, brauchen wir zur Kommunikation keinen zentralen Autoritätspunkt mehr.

source: Another issue we haven’t talked much about is how wallets send transactions via email to the miners. When a new miner joins the system, all wallets need to update their miner list. Not cool. With this nice peer-to-peer network of nodes, wallets can broadcast their transactions to all miners without knowing who or where they are.
de_de: Ein weiteres Problem, von dem wir noch nicht gesprochen haben ist, wie Wallets Transaktionen via Mail an die Miner schicken. Wenn ein neuer Miner dem System beitritt, müssen alle Wallets ihre Miner-Liste aktualisieren. Nicht cool. Mit diesem schicken Peer-to-Peer Netzwerk von Nodes können Wallets ihre Transaktionen an alle Miner übermitteln, ohne zu wissen, wer oder wo diese sind.

source: Bitcoin’s peer-to-peer network
de_de: Bitcoins Peer-to-Peer Netzwerk

source: We’ll follow a transaction’s path through the network, both as an unconfirmed transaction and, eventually, as part of a mined block. The transaction will start in John’s wallet and end as a confirmed transaction in the blockchain with Bob’s wallet being notified about it.
de_de: Wir werden eine Transaktion auf ihrem Weg durch das Netzwerk betrachten, sowohl als unbestätigte Transaktion als auch, irgendwann später, als Teil eines produzierten Blocks. Die Transaktion wird in Johns Wallet anfangen und als bestätigte Transaktion in der Blockchain enden, wobei Bobs Wallet davon in Kenntnis gesetzt wird.

source: After following the transaction through the system, you’ll no longer need the cookie token system to help you understand Bitcoin. We’ll talk only about Bitcoin from that point forward. Practically no differences exist between the cookie token system and Bitcoin anymore, so it doesn’t make sense to keep talking about cookie tokens when, in fact, you want to learn about Bitcoin!
de_de: Nachdem wir die Transaktion durch das System begleitet haben, werden wir das Cookie Token System zum Verständnis von Bitcoin nicht mehr benötigen. Ab da werden wir nur noch von Bitcoin sprechen. Es existieren dann praktisch keine Unterschiede mehr zwischen dem Cookie Token System und Bitcoin, sodass es sinnlos ist, von Cookie Tokens zu reden, wenn wir doch eigentlich Bitcoin lernen wollen.

source: The last topic in this chapter will cover how a new node connects to and becomes part of the peer-to-peer network. This is far from trivial. How does it find nodes to connect to? How does it download the blockchain up to the latest block? We’ll sort all that out. Toward the end of the chapter, you’ll learn how to set up a full node of your own.
de_de: Das letzte Thema in diesem Kapitel behandelt, wie sich ein neuer Node mit dem Netzwerk verbindet und zu einem Teil desselben wird. Das ist alles andere als trivial. Wie findet er Nodes zum Verbinden? Wie lädt er die Blockchain bis zum jüngsten Block? All dies wird klargestellt. Gegen Ende des Kapitels lernst du dann, wie du deinen eigenen Node einrichtest.

source: The shared folder
de_de: Der Shared Folder

source: The shared folder administrator, Luke, is a central authority (<<fig0802>>). He ultimately gets to decide which blocks can be stored in the shared folder. He also gets to decide who can read from and write to the shared folder.
de_de: Der Administrator des Shares, Luke, ist eine zentrale Autorität (<<fig0802>>). Schlussendlich entscheidet er, welche Blocks im Share Folder gespeichert werden können. Er entscheidet auch darüber, wer Lese- und wer Schreibberechtigung auf dem Share hat.

source: The shared folder is a central point of authority.
de_de: Der Shared Folder ist ein zentraler Punkt der Machtbefugnis.

source: So far, we’ve assumed Luke is a totally neutral good guy—but what if he isn’t, or what if he’s forced by Acme Insurances to reject certain blocks? What’s the point of proof of work if the system can be censored at the block level? Proof of work made the _transactions_ censorship-resistant because it let users send their transactions to multiple miners. But the _blocks_ containing the transactions can still be censored by whoever has administrator privileges over the shared folder. Simply put, the system isn’t yet censorship-resistant. As long as a single entity can decide which blocks or transactions to allow, the system isn’t censorship-resistant.
de_de: Bisher hatten wir angenommen, das Luke ein völlig neutraler, netter Kerl ist–aber was, wenn nicht, oder was, wenn er durch die Acme Versicherung gezwungen wird, bestimmte Blocks abzulehnen? Wozu der Proof of Work, wenn das System auf der Blockebene zensiert werden kann? Proof of Work hat die _Transaktionen_ zensurfest gemacht, weil es Benutzern erlaubte, ihre Transaktionen an mehrere Miner zu schicken. Aber die _Blocks_, die die Transaktionen enthalten, können immer noch von jemandem zensiert werden, der Administratorrechte auf dem Share besitzt. Einfach gesagt, ist das System noch nicht zensurresistent. Solange irgendeine Einheit entscheiden kann, welche Blocks oder Transaktionen erlaubt sind, ist das System nicht zensurfest.

source: The shared folder poses yet another problem. Imagine that Rashid has created a 1 MB block and published it to the shared folder. Everyone watching the shared folder, all full nodes, will download Rashid’s block at the same time. If you have 100 full nodes, the total amount of data you need to send from the shared folder to the different nodes is 100 MB. This will cause _block propagation_—the transfer of a block from its creator to all other nodes—to be terribly slow. The more nodes, the slower the block propagation.
de_de: Der Shared Folder stellt ein weiteres Problem dar. Nimm an, Rashid hat einen 1 MB Block erzeugt und ihn auf den Share gelegt. Jeder, der den Share im Auge behält, also alle Full Nodes, werden Rashids Block auf einmal herunterladen. Wenn wir 100 Full Nodes haben, ist der Gesamtbedarf an Daten, der vom Share heruntergeladen werden muss, 100 MB. Das macht die Verteilung des Blocks vom Erzeuger zu allen anderen Nodes–die _Block Propagation_–entsetzlich langsam. Je mehr Nodes, desto langsamer die Block Propagation.

source: Let’s build a peer-to-peer network
de_de: Bauen wir ein Peer-to-Peer Netzwerk

source: What if the full nodes and miners could talk directly to each other instead of relying on the central shared folder? They could send the blocks directly to one another in a peer-to-peer network (<<fig0803>>).
de_de: Was wäre, wenn die Full Node und Miner direkt miteinander reden könnten, anstatt sich auf einen zentralen Share zu verlassen? Sie könnten sich die Blocks in einem Peer-to-Peer Netzwerk gegenseitig direkt schicken (<<fig0803>>).

source: In a peer-to-peer network, blocks are passed from one node to another, much as gossip spreads among people.
de_de: In einem Peer-to-Peer Netzwerk werden Blocks von einem Node zum nächsten geschickt, so wie sich Tratsch, oder _Gossip_, unter Menschen verbreitet.

source: Think of the peer-to-peer network as a large number of people. One person doesn’t know everyone else, but might know three people. When something interesting happens—for example, Rashid finds a block—he tells his three friends about it, who in turn tell all their friends, and so on until everybody knows about this new block. We call such networks _gossip networks_ for apparent reasons.
de_de: Stell dir das Peer-to-Peer Netzwerk wie eine grosse Menge Leute vor. Einer allein weiss nicht alles, kennt aber vielleicht drei Leute. Wenn etwas Interessantes passiert–zum Beispiel, dass Rashid einen Block findet–dann erzählt er seinen drei Freunden davon, die ihrerseits wiederum all ihren Freunden davon erzählen, und das geht so weiter, bis jeder von dem neuen Block weiss. Wir nennen solche Netzwerke aus einleuchtenden Gründen _Gossip Netzworks_.

source: To _relay_ a received block means to pass the block on to others.
de_de: Einen Block zu _relayen_ bedeutet, den Block an andere weiterzugeben.

source: Blocks can no longer be easily stopped. A node can choose not to pass a block on, or _relay_ it, to its peers, but the peers are connected to several other peers that will gladly relay the block to them. A single node can’t do much to censor information.
de_de: Blocks können jetzt nicht mehr einfach gestoppt werden. Ein Node kann sich entscheiden, einen Block nicht an seine Peers weiterzugeben, nicht zu _relayen_, aber die Peers sind noch mit mehreren anderen Peers verbunden, die ihnen den Block gerne geben. Ein einzelner Node kann nicht viel an Zensur ausrichten.

source: Suppose Rashid finds a block, and he wants to get this block out to all nodes. Rashid sends his block to Qi, Tom, and the cafe. For some reason, the cafe doesn’t forward the block to Lisa (<<fig0804>>). But Lisa has several peers in this network. She’s connected to Tom and Qi. Tom will tell Lisa about this new block and send it to her. The cafe can’t hide information from Lisa as long as she’s well-connected—that is, has many different peers.
de_de: Angenomen Rashid findet einen Block und er möchte diesen Block an alle Nodes verteilen. Rashid schickt seinen Block an Qi, To und das Café. Aus irgendeinem Grund leitet das Café den Block nicht an Lisa weiter (<<fig0804>>). Aber Lisa hat mehrere Peers in ihrem Netzwerk. Sie ist mit Tom und Qi vernetzt. Tom erzählt Lisa von diesem neuen Block und schickt ihn ihr. Das Café kann die Information nicht vor Lisa verbergen, solange diese gut verbunden ist–viele verschiedene Peers hat.

source: If the cafe refuses to relay a block to Lisa, someone else will do it.
de_de: Wenn das Café sich weigert, einen Block an Lisa weiterzuleiten, dann macht es jemand anders.

source: Now that you have this nice network, wallets can use it to get their transactions sent to miners. Then they won’t have to keep track of miner email addresses anymore. The transactions will be broadcast over the peer-to-peer network and reach all full nodes within seconds. This includes the miners, because they’re also full nodes. We covered this briefly in <<ch01>>, as repeated in <<fig0805>>.
de_de: Jetzt, wo wir dieses schicke Netzwerk haben, können die Wallets das benutzen, um ihre Transaktionen an die Miner zu schicken. Dann werden sie nicht mehr die Liste der Mail-Adressen der Miner pflegen müssen. Die Transaktionen werden über das Peer-to-Peer Netzwerk ausgestrahlt, oder _broadcast_ und erreichen innerhalb von Sekunden alle Full Nodes. Darunter auch die Miner, denn diese sind ebenfalls Full Nodes. Wir haben dies kurz in <<ch01>> behandelt und hier in <<fig0805>> nochmals dargestellt.

source: Transactions travel the peer-to-peer network just like blocks do. Wallets no longer need to know the miners.
de_de: Transaktionen durchqueren das Peer-to-Peer Netzwerk, genau wie Blocks dies tun. Wallets brauchen die Miner nicht mehr zu kennen.

source: The same thing goes here as for blocks: a single node can’t hinder transactions from spreading across the network. Another pleasant effect of using the peer-to-peer network for transactions is that a transaction’s recipient can be notified that the transaction is _pending_, or is about to be confirmed. We’ll look at how this works a bit later.
de_de: Hier gilt dasselbe wie für Blocks: ein einzelner Node kann Transaktionen nicht an einer Verbreitung über das Netzwerk hindern. Ein weiterer angenehmer Effekt der Benutzung des Peer-to-Peer Netzwerks für Transaktionen ist, dass der Empfänger einer Transaktion Bescheid bekommen kann, dass eine Transaktion aussteht, oder _pending_ ist, also auf Bestätigung durch Minen eines ihn enthaltenden Blocks wartet. Wir schauen uns später an, wie das funktioniert.

source: How do peers talk?
de_de: Wie reden Peers?

source: When you open a web page on https://bitcoin.org, your web browser will make a TCP connection to bitcoin.org, download a web page through that connection, and display it to you.
de_de: Wenn man eine Webseite auf https://bitcoin.org öffnet, baut der Web Browser eine TCP Verbindung zu bitcoin.org auf, lädt eine Web Page über diese Verbindung herunter und zeigt sie an.

source: Let’s look at how the communication between two peers happens. We’ll look specifically at how Tom connects to Lisa and how they communicate across their communication channel, called a Transmission Control Protocol (TCP) connection (<<fig0806>>).
de_de: Schauen wir uns an, wie die Kommunikation zwischen Peers geschieht. Wir betrachten konkret, wie Tom sich mit Lisa verbindet, und wie sie über ihren Kommunikationskanal miteinander reden, der als Transmission Control Protocol (TCP) Verbindung bezeichnet wird (<<fig0806>>).

source: Tom and Lisa communicate over the internet through a communication channel.
de_de: Tom und Lisa kommunizieren über das Internet durch einen Kommunikationskanal.

source: Suppose Tom’s node knows about Lisa’s node. I’ll explain in <<bootstrapping-the-network>> how Tom learns about other nodes. For now, let’s assume he has the _IP address_ and _port_ of Lisa’s node. He now wants to connect to Lisa’s node to communicate with it. All computers on the internet have an Internet Protocol (IP) address, which is how one computer can send information to another. A computer program that listens for incoming connections must listen on a specific port number of its computer’s IP address. Lisa’s computer has the IP address 142.12.233.96 and runs a cookie token program that listens for incoming connections on port 8333.
de_de: Angenommen, Toms Node kennt Lisas Node. In <<bootstrapping-the-network>> werde ich zeigen, wie Tom von anderen Nodes erfährt. Nehmen wir für den Moment an, dass er _IP Adresse_ und _Port_ von Lisas Node kennt. Jetzt möchte er sich mit Lisas Node verbinden, um mit ihr zu kommunizieren. Jeder Computer im Internet hat eine Internet Protocol (IP) Adresse; auf diese Weise können alle Computer Informationen zueinander schicken. Ein Computerprogramm, das nach eingehenden Verbindungen lauscht, führt ein _listen_ auf einer bestimmten Portnummer seiner IP Adresse aus. Lisas Computer hat die IP Adresse 142.12.233.96, und es läuft darauf ein Cookie Token Programm, das auf Port 8333 horcht.

source: Port 8333 is the default listening port in Bitcoin Core, the most widely used full node software.
de_de: Port 8333 ist der Default Listening Port in Bitcoin Core, der verbreitetsten Full Node Software.
