Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: Tom’s node connects to Lisa’s node through the IP address 142.12.233.96 and TCP port 8333. His node (computer program) starts by asking its operating system (OS) to initiate a connection to Lisa (<<fig0807>>). The OS sends a message to Lisa’s computer saying that Tom wants to talk to a computer program on Lisa’s port 8333. Her computer knows a program is listening on port 8333, so it sends back a “Sure, welcome” message. Tom’s computer acknowledges this by sending back an “OK, cool. Let’s talk …” message.
de_de: Toms Node verbindet sich mit Lisas Node über die IP Adresse 142.12.233.96 und den TCP Port 8333. Sein Node (Computerprogramm) fängt an, indem es sein Betriebssystem (OS für Operating System) um den Aufbau einer Verbindung zu Lisa bittet (<<fig0807>>). Das OS schickt eine Message an Lisa’s Computer, dass Tom mit einem Computerprogramm auf Lisas Port 8333 sprechen möchte. Ihr Computer weiss, dass ein Programm auf Port 8333 hört, schickt also eine “Gern, willkommen” Meldung. Tom’s Computer quittiert das indem er eine “OK, cool. Reden wir …” Message schickt.

source: Tom’s computer program sets up a TCP connection to Lisa’s computer program. After this, they can send and receive data between each other.
de_de: Toms Computerprogramm stellt eine TCP Verbindung mit Lisas Computer her. Danach können die beiden Daten miteinander austauschen.

source: The node software on Tom’s and Lisa’s computers wasn’t involved in this exchange—it was carried out by their OSs, such as Linux, Windows, or macOS. When the message sequence is finished, the OS hands the connection over to the node software. Lisa’s and Tom’s nodes can now speak freely to each other. Tom can send data to Lisa, and Lisa can send data to Tom over this communication channel, or _TCP connection_.
de_de: Die Node Software auf Toms und Lisas Computern war an diesem Austausch nicht beteiligt–er wurde durch ihre Betriebssysteme erledigt, wie Linux, Windows oder macOS. Wenn die Nachrichtenabfolge erledigt ist, reicht das OS die Verbindung an die Node Software weiter. Lisas und Toms Nodes können jetzt frei miteinander sprechen. Über den Kommunikationskanal, die _TCP Connection_, kann Tom Daten an Lisa senden, und Lisa kann Daten an Tom schicken.

source: The network protocol
de_de: Das Netzwerkprotokoll

source: Tom and Lisa can now send and receive data over a communi­cation channel. But if Tom’s node speaks a language that Lisa’s node doesn’t understand, the communication won’t be meaningful (<<fig0808>>). The nodes must have a common language: a _protocol_.
de_de: Tom und Lisa können jetzt über einen Kommunikationskanal Daten senden und empfangen. Aber wenn Toms Node eine Sprache spricht, die Lisas Node nicht versteht, ist die Kommunikation nicht sinnvoll (<<fig0808>>). Die Nodes müssen eine gemeinsame Sprache benutzen: ein _Protokoll_.

source: Lisa must be able to understand what Tom writes on the channel.
de_de: Lisa muss verstehen können, was Tom im Kanal schreibt.

source: The cookie token network protocol defines a set of message types that are allowed. A typical message in the cookie token (well, Bitcoin) network is the `inv` message (<<fig0809>>).
de_de: Das Cookie Token Netzwerk Protokoll definiert eine Menge erlaubter Nachrichtentypen. Eine typische Nachricht im Cookie Token (naja, Bitcoin) Netzwerk ist die `inv` Message (<<fig0809>>).

source: This is an abstraction
de_de: Es ist eine Abstraktion

source: Real network messages don’t look exactly like these; I provide an abstract view of the messages. The exact format of the network messages is out of the scope of this book.
de_de: Echte Netzwerkmessages sehen nicht genau so aus; ich stelle eine abstrakte Sicht auf die Messages dar. Das genaue Format der Netzwerknachrichten zu behandeln, würde den Umfang dieses Buches sprengen.

source: A typical network message
de_de: Eine typische Netzwerkmessage

source: A node uses the `inv`—short for _inventory_—message to inform other nodes about something it has. In <<fig0809>>, Tom’s node informs Lisa’s node that Tom has three things to offer Lisa: two transactions and a block. The message contains an ID for each of these items.
de_de: Ein Node benutzt die `inv`–kurz für _inventory_–Message, um andere Nodes über etwas zu informieren, was er besitzt. In <<fig0809>> informiert Toms Node Lisas Node, dass Tom Lisa drei Dinge anzubieten hat: zwei Transaktionen und einen Block. Die Message enthält eine ID für jedes dieser Objekte.

source: John sends the transaction
de_de: John schickt die Transaktion

source: Let’s follow a transaction through the network from start to end to see what network messages are being used. We’ll assume the peer-to-peer network is already set up. We’ll come back to how the network is _bootstrapped_ later in this chapter.
de_de: Folgen wir einer Transaktion vom Anfang bis zum Ende durch das Netzwerk, um zu sehen, welche Netzwerkmessages benutzt werden. Wir gehen von einem bereits etablierten Peer-to-Peer Netzwerk aus. Wir kommen später darauf zurück, wie das _Bootstrapping_ des Netzwerks vonstatten geht.

source: In <<lightweight-wallets>>, we said that wallets can connect to full nodes and get information about all block headers and transactions concerning them using bloom filters and merkle proofs (<<fig0810>>).
de_de: In <<lightweight-wallets>> hatten wir gesagt, dass Wallets sich mit Full Nodes verbinden und Informationen über alle Block Header und Transaktionen bekommen können (<<fig0810>>).

source: Lightweight wallets communicate with nodes using the Bitcoin network protocol.
de_de: Lightweight Wallets kommunizieren mit Nodes mit Hilfe des Bitcoin Protokolls.

source: I didn’t go into detail then about how this communication works. It uses the same protocol the nodes use when they communicate with each other. The wallets and the full nodes (including miners) all speak the same “language.”
de_de: Ich bin dort nicht ins Detail darüber gegangen, wie diese Kommunikation funktioniert. Sie benutzt dasselbe Protokoll, das die Nodes zur Kommunikation untereinander benutzen. Die Wallets und Full Nodes (einschliesslich der Miner) sprechen alle dieselbe “Sprache.”

source: Suppose John wants to buy a cookie from the cafe. John’s wallet is connected to Tom’s node with a TCP connection. He scans the payment URI from the cafe’s wallet. John’s wallet creates and signs a transaction. You know the drill. Then it’s time to send the transaction to Tom’s node (<<fig0811>>).
de_de: Angenommen John möchte einen Keks vom Café kaufen. Johns Wallet ist mit Toms Node über einen TCP Kommunikationskanal verbunden. Er scannt die Zahlungs-URI vom Wallet des Cafés. Johns Wallet erzeugt und signiert dann die Transaktion. Das kennst du ja schon. Dann ist es Zeit, die Transaktion an Toms Node zu schicken (<<fig0811>>).

source: The transaction is sent to Tom’s node through a TCP connection.
de_de: Die Transaktion wird über eine TCP Verbindung an Toms Node geschickt.

source: This happens in a three-step process. John’s wallet doesn’t just send the transaction unsolicited: it first informs Tom’s node that there’s a transaction to be fetched (<<fig0812>>).
de_de: Das geschieht in einem dreistufigen Prozess. Johns Wallet schickt die Transaktion nicht einfach ungefragt lost: es informiert zunächst Toms Node, dass eine Transaktion abgeholt werden kann (<<fig0812>>).

source: Tom’s node is informed about John’s transaction so that Tom can fetch it.
de_de: Toms Node wird über Johns Transaktion informiert, sodass Tom sie abholen kann.

source: The first message is an `inv` message, as described in the previous section. John’s wallet sends the `inv` to Tom’s full node. Tom checks if he already has the transaction. He doesn’t, because John’s wallet just created it and hasn’t sent it to anyone yet. Tom’s node wants to get this transaction, so he requests it with a `getdata` message that looks just like an `inv` message but with a different meaning: `getdata` means “I want this stuff,” whereas `inv` means “I have this stuff.”
de_de: Die erste Nachricht ist eine `inv` Message, wie im vorangegangenen Abschnitt erklärt. Johns Wallet schickt das `inv` an Toms Full Node. Tom schaut nach, ob er die Transaktion bereits hat. Er hat sie noch nicht, weil Johns Wallet sie gerade erst erzeugt und noch niemandem geschickt hat. Toms Node will diese Transaktion haben, also fordert er sie mit einer `getdata` Message an, die aussieht wie eine `inv` Message, aber mit einer anderen Bedeutung: `getdata` heisst “Ich will dieses Zeug,” wogegen `inv` heisst “Ich habe dieses Zeug.”

source: John’s wallet receives the `getdata` message and sends a `tx` message containing the entire transaction to Tom’s node. Tom will verify the transaction and keep it. He’ll also relay this transaction to his network neighbors.
de_de: Johns Wallet empfängt die `getdata` Message und schicht eine `tx` Message, in der die ganze Transaktion enthalten ist, an Toms Node. Tom wird die Transaktion verifizieren und behalten. Ausserdem wird er sie an seine Netzwerknachbarn relayen.

source: You might ask, “Why doesn’t John’s wallet send the entire transaction immediately? Why go through the hassle with `inv` and `getdata`?” This will become clear later, but it’s because nodes might already have the transaction; we save bandwidth by sending only transaction hashes instead of entire transactions.
de_de: Du fragst dich vielleicht, weshalb Johns Wallet die Transaktion nicht gleich komplett schickt. Warum der Quatsch mit `inv` und `getdata`? Das wird später klarer, aber es liegt daran, dass Nodes die Transaktion vielleicht schon haben; wir sparen Bandbreite, indem wir nur die Transaktions-Hashes anstelle der gesamten Transaktion schicken.

source: Tom forwards the transaction
de_de: Tom leitet die Transaktion weiter

source: If the transaction is valid, Tom’s node will inform his neighbors about it (<<fig0813>>) using an `inv` message, just like John’s wallet did when it informed Tom’s node about the transaction.
de_de: Wenn die Transaktion gültig ist, informiert Toms Node seine Nachbarn darüber mit einer `inv` Message (<<fig0813>>), genau wie Johns Wallet es getan hat, als es Toms Node über die Transaktion informiert hatte.

source: Tom forwards the transaction to his peers.
de_de: Tom leitet die Transaktion an seine Peers weiter.

source: The process is the same for these three message exchanges as the one John used when he first sent the transaction to Tom (<<fig0814>>). Lisa, Qi, and Rashid will get an `inv` message from Tom.
de_de: Der Prozess ist für diese drei Nachrichtenwechsel derselbe wie der, den John benutzt hat, als er die Transaktion zuerst an Tom geschickt hat (<<fig0814>>). Lisa, Qi und Rashid werden eine `inv` Message von Tom erhalten.

source: Tom’s node sends the transaction to Qi’s node using the familiar three-step process.
de_de: Toms Node schickt die Transaktion mit dem bekannten dreiteiligen Verfahren an Qis Node.

source: When Lisa, Qi, and Rashid have received the transaction, they too will inform their peers about it after they’ve verified it. Qi’s and Rashid’s nodes are a bit slower, so it takes them a while to verify the transaction; we’ll get back to them later.
de_de: Wenn Lisa, Qi und Rashid die Transaktion bekommen haben, werden auch sie ihre Peers darüber informieren, sobald sie sie verifiziert haben. Qis und Rashids Nodes sind ein wenig langsamer, also dauert es bei ihnen ein bisschen länger, die Transaktion zu überprüfen; wir kommen später auf die beiden zurück.

source: Lisa was quick to verify the transaction, so she’ll be the first of the three to relay it. She already knows that she received the transaction from Tom, so she won’t inform Tom’s node with an `inv` message. But Lisa doesn’t know that Qi already has the transaction, and she doesn’t know if the cafe has it. She’ll send an `inv` to those two nodes. The cafe’s node will send back a `getdata` because it hasn’t yet seen this transaction. Qi’s node already has this transaction and won’t reply with anything (<<fig0815>>). She’ll remember that Lisa has it, though.
de_de: Lisa war schnell mit dem überprüfen der Transaktion, also ist sie die erste beim relayen. Sie weiss bereits, dass sie die Transaktion von Tom bekommen hat, wird also Toms Node nicht mit einer `inv` Message informieren. Aber Lisa weiss nicht, dass Qi die Transaktion bereits hat, und sie weiss nicht, ob das Café sie hat. Sie sendet diesen beiden Nodes eine `inv` Nachricht. Der Nodes des Cafés wird ein `getdata` zurückschicken, weil er die Transaktion noch nicht gesehen hat. Qis Node hat die Transaktion bereits und wird überhaupt nicht antworten (<<fig0815>>). Sie merkt sich allerdings, dass Lisa die Transaktion hat.

source: Lisa’s node sends an `inv` to Qi’s node, but Qi’s node already has the transaction.
de_de: Lisas Node schickt ein `inv` an Qis Node, aber Qis Node hat die Transaktion bereits.

source: Qi has just finished verifying the transaction. She knows that Lisa’s node has it, so she doesn’t have to send an `inv` to Lisa’s node. But she doesn’t know if Rashid has it, so she sends an `inv` to Rashid’s node.
de_de: Qi hat gerade die Transaktion fertig geprüft. Sie weiss, dass Lisas Node sie schon hat, also braucht sie kein `inv` an Lisas Node zu schicken. Aber sie weiss nicht, ob Rashid sie hat, also schickt sie ein `inv` an Rashids Node.

source: Rashid’s was the slowest node when verifying John’s transaction, so when it’s time for him to send an `inv` to his neighbors, he’s already received an `inv` from Qi’s node. And he also knows from earlier that Tom already has the transaction. He’ll just send an `inv` to the cafe’s node, which will ignore the `inv` because it already has the transaction.
de_de: Rashids war der langsamste Node beim Verifizieren von Johns Transaktion, also hat er schon ein `inv` von Qis Node bekommen, als es für ihn Zeit ist, das `inv` zu seinen Nachbarn zu schicken. Und er weiss von früher, dass Tom die Transaktion bereits hat. Er schickt nur einen `inv` an den Node des Cafes, der das `inv` ignorieren wird, weil er die Transaktion bereits besitzt.

source: The cafe’s lightweight wallet is notified
de_de: Das Lightweight Wallet des Cafés wird benachrichtigt

source: I said earlier that a good thing about letting transactions travel the peer-to-peer network is that the recipient wallet can get a quick notification of the pending transaction. Let’s explore this now.
de_de: Ich hatte zuvor erwähnt, dass eine gute Sache daran, die Transaktionen durch das Peer-to-Peer Netzwerk wandern zu lassen, die ist, dass ein Empfänger-Wallet eine frühe Benachrichtigung über eine ausstehende Transaktion erhalten kann. Schauen wir uns das einmal genauer an.

source: The cafe’s full node has received the transaction and verified it. The cafe also has a lightweight wallet on a mobile phone that it uses to send and receive money. The cafe is concerned with security, so it configured this lightweight wallet to connect only the cafe’s own full node, its _trusted node_ (<<fig0816>>).
de_de: Der Full Node des Cafés hat die Transaktion erhalten und sie geprüft. Das Café hat auch ein Lightweight Wallet auf einem Mobiltelefon, das es zum Senden und Empfangen von Geld verwendet. Das Café macht sich Sorgen um die Sicherheit, also ist das Lightweight Wallet so konfiguriert, dass es sich nur mit dem Full Node des Cafés verbindet, seinem vertrauten Node oder _Trusted Node_ (<<fig0816>>).

source: The cafe’s lightweight wallet has a TCP connection to its own full node.
de_de: Das Lightweight Wallet des Cafés verfügt über eine TCP-Verbindung zu einem eigenen Full Node.

source: This common setup gives the cafe the complete security of a full node combined with the flexibility and mobility of a lightweight wallet. I described this setup in <<security-of-lightweight-wallets>>.
de_de: Dieses gängige Setup gibt dem Café die völlige Sicherheit eines Full Nodes, kombiniert mit der Flexibilität und Mobilität eines Lightweight Wallets. Ich habe dieses Setup in <<security-of-lightweight-wallets>> beschrieben.

source: The cafe’s full node has just verified John’s transaction. It now wants to inform its neighbors about this new transaction. It’s connected to Lisa’s node, Rashid’s node, and the cafe’s lightweight wallet. The full node already knows that Lisa’s and Rashid’s nodes have this transaction, so it doesn’t send an `inv` to those two nodes. The full node doesn’t know whether the wallet has the transaction, but it won’t immediately send an `inv` message to the wallet.
de_de: Der Full Node des Cafés hat gerade Johns Transaktion verifiziert. Er möchte nun seine Nachbarn über die neue Transaktion informieren. Er ist mit Lisas Node, Rashids Node und dem Lightweight Wallet des Cafés verbunden. Der Full Node weiss bereits, dass Lisas und Rashids Nodes diese Transaktion haben, schickt also kein `inv` an diese beiden Nodes. Der Full Node weiss nicht, ob das Wallet die Transaktion hat, aber es wird nicht sofort eine `inv` Message an das Wallet schicken.

source: The wallet is a lightweight wallet, which uses bloom filters, described in <<bloom-filters-obfuscate-addresses>>. The full node will test the transaction against the bloom filter and, if it matches, send an `inv` message to the wallet. If there’s no match, it won’t send an `inv` message.
de_de: Das Wallet ist ein Lightweight Wallet, das Bloom Filter benutzt, wie sie in <<bloom-filters-obfuscate-addresses>> beschrieben wurden. Der Full Node testet die Transaktion gegen den Bloom Filter, und wenn sie auf den Filter passt, schickt er eine `inv` Message an das Wallet. Wenn es nicht passt, schickt er keine `inv` Message.

source: John’s transaction is for the cafe, so the bloom filter will match the transaction, and the full node will send an `inv`. The wallet will request the actual transaction using `getdata`, as <<fig0817>> shows.
de_de: Johns Transaktion geht an das Café, also passt der Bloom Filter auf die Transaktion und der Full Node wird ein `inv` senden. Das Wallet wird die volle Transaktion mittels `getdata` anfordern, wie in <<fig0817>> dargestellt.

source: The cafe’s wallet gets John’s transaction from the cafe’s trusted node after the transaction is checked against the bloom filter.
de_de: Das Wallet des Cafes bekommt Johns Transaktion vom Trusted Node des Cafes, nachdem die Transaktion gegen den Bloom Filter geprüft wurde.

source: The wallet has now received the transaction. It can show a message to the cafe owner that a transaction is pending. The cafe owner has a choice: trust that the transaction—a so-called _0-conf transaction_—will be confirmed eventually, or wait until the transaction is confirmed. If the cafe accepts the 0-conf transaction, then it trusts that John has paid a high enough transaction fee and that the transaction won’t be double spent.
de_de: Das Wallet hat jetzt die Transaktion erhalten. Es kann dem Cafébesitzer eine Message anzeigen, dass eine Transaktion aussteht. Der Cafébesitzer hat nun die Wahl:darauf vertrauen, dass die Transaktion–eine sogenannte _0-conf Transaktion_–irgendwann bestätigt wird, oder warten bis sie bestätigt ist. Wenn das Café die 0-conf Transaktion akzeptiert, dann vertraut es darauf, dass John eine ausreichend hohe Transaction Fee bezahlt hat und dass die Transaktion nicht doppelt ausgegeben wird.

source: This time, the cafe decides that it needs to wait until the transaction is included in a valid block. This brings us to the next phase: including the transaction in a block in the blockchain.
de_de: Diesmal entscheidet das Café, dass es warten muss bis die Transaktion in einen gültigen Block Eingang gefunden hat. Dies bringt uns zur nächsten Phase: die Einbettung der Transaktion in einen Block in der Blockchain.

source: Including the transaction in a block
de_de: Einbetten der Transaktion in einen Block

source: Let’s recall some of the miners in this system. At the end of <<mitigating-miner-centralization>>, there were 10 different miners; but let’s go back in time and pretend Qi, Tom, Lisa, and Rashid are the only miners in this system right now.
de_de: Denken wir zurück an die Miner im System. Am Ende von <<mitigating-miner-centralization>> gab es 10 verschiedene Miner; aber drehen wir die Zeit zurück und tun so, als wären Qi, Tom, Lisa und Rashid zur Zeit die einzigen Miner im System.

source: The transaction reached all these miners during transaction propagation. John’s wallet used to send the transaction via email to all miners. Now, he sends it to any of the full nodes, and it propagates across the entire peer-to-peer network. Miners can choose to include John’s transaction in the blocks they’re mining. Suppose the transaction includes a transaction fee so that some or all miners are willing to include it, and that Rashid is the next miner to find a valid proof of work for his block, which happens to contain John’s transaction (<<fig0818>>).
de_de: Die Transaktion hat alle diese Miner im Rahmen der Transaction Propagation erreicht. Johns Wallet hat früher die Transaktion via Mail an alle Miner geschickt. Jetzt schickt er sie an irgendeinen Full Node, und sie pflanzt sich durch das gesamte Peer-to-Peer Netzwerk fort. Miner können wählen, Johns Transaktion in den Block, den sie gerade minen, zu integrieren. Angenommen, die Transaction Fee der Transaktion ist hoch genug, dass alle Miner gewillt sind, sie einzubetten, und dass Rashid als nächster Miner einen gültigen Proof of Work für seinen Block findet, der Johns Transaktion enthält (<<fig0818>>).

source: Rashid’s block containing John’s transaction
de_de: Rashids Block enthält Johns Transaktion

source: Rashid wants to get his block to the other miners as quickly as possible to minimize the risk of some other miner getting a block out before Rashid’s block.
de_de: Rashid möchte möglichst schnell seinen Block zu den anderen Minern bekommen und so das Risiko minimieren, dass ein anderer Miner vor Rashid einen Block propagiert.

source: This process is defined in BIP130, which replaces an old block-propagation mechanism that used `inv` messages.
de_de: Der Prozess ist in BIP130 definiert, der den alten Block Propagation Mechanismus ersetzt, der `inv` Messages verwendet hat.

source: He creates a `headers` message and sends it to all his peers: Tom, the cafe, and Qi. Rashid’s peers will send back a `getdata` message, and Rashid will reply with the actual block. The message exchange between Rashid and Qi will look like the one in <<fig0819>>.
de_de: Er erzeugt eine `headers` Message und schickt sie an alle seine Peers: Tom, das Café und Qi. Rashid Peers werden eine `getdata` Nachricht zurückschicken und Rashid wird darauf mit dem eigentlichen Block antworten. Der Nachrichtenaustausch zwischen Rashid und Qi wird aussehen wie der in <<fig0819>>.

source: Rashid’s node sends Rashid’s block to Qi’s node.
de_de: Rashids Node schickt Rashids Block zu Qis Node.

source: The actual block is sent in a `block` message containing the full block.
de_de: Der eigentliche Block wird in einer `block` Message verschickt, die den ganzen Block enthält.

source: Let’s continue the block propagation throughout the peer-to-peer network. Rashid has sent his block to Tom, the cafe, and Qi. Now, these three nodes will verify the block and, if it’s valid, send out `headers` messages to all their peers who might not already have it (<<fig0820>>).
de_de: Verfolgen wir weiter die Block Propagation durch das Peer-to-Peer Netzwerk. Rashid hat seinen Block an Tom geschickt, and das Café und an Qi. Jetzt prüfen diese drei Nodes den Block und verschicken, falls er gültig ist, `headers` Messages an alle ihre Peers, die den Block vielleicht noch nicht haben (<<fig0820>>).
