Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: We’ve talked about several types of payments. <<fig1030>> through <<fig1035>> summarize the most common ones.
de_de: Wir haben mehrere Zahlungsarten besprochen. Die Abbildungen <<fig1030>>–<<fig1035>> fassen die Häufigsten noch einmal zusammen.

source: p2pkh: address format `1<some base58 characters>`
de_de: p2pkh: Adressformat `1<some base58 characters>`

source: p2sh: address format `3<some base58 characters>`
de_de: p2sh: Adressformat `3<some base58 characters>`

source: p2wpkh: address format `bc1q<38 base32 characters>`
de_de: p2wpkh: Adressformat `bc1q<38 base32 characters>`

source: p2wsh: address format `bc1q<58 base32 characters>`
de_de: p2wsh: Adressformat `bc1q<58 base32 characters>`

source: p2wpkh nested in p2sh: address format `3<some base58 characters>`
de_de: p2wpkh eingebettet in p2sh: Adressformat `3<some base58 characters>`

source: p2wsh nested in p2sh: address format `3<some base58 characters>`
de_de: p2wsh eingebettet in p2sh: Adressformat `3<some base58 characters>`

source: Bitcoin blocks are limited to 1,000,000 bytes in size and 20,000 signature operations.
de_de: Bitcoin Blocks sind auf 1.000.000 Byte und 20.000 Signaturoperationen begrenzt.

source: Block size limit
de_de: Blockgrössen Limit

source: In 2010, the Bitcoin software was updated with a block size limit of 1,000,000 bytes. It isn’t totally clear why this was done, but most people think the limit was introduced to reduce the impact of certain denial of service (DoS) attacks. DoS attacks aim at stalling or crashing Bitcoin nodes so the network can’t function properly.
de_de: Im Jahr 2010 wurde die Bitcoin Software auf ein Blockgrössenlimit von 1.000.000 Bytes erweitert. Es ist nicht vollkommen klar weshalb dies geschah, aber die meisten nehmen an, dass die Begrenzung eingeführt wurde, um den Effekt bestimmter Denial-of-Service (DoS) Attacken zu verringern. DoS Attacken zielen darauf ab, Bitcoin Nodes zu verlangsamen oder abstürzen zu lassen, sodass das Netzwerk nicht ordentlich funktionieren kann.

source: One way to mess with the network is to create a very large block that takes 10 seconds to download on a good internet connection. This might seem fast enough, but uploading this block to five peers will take 50 seconds. This will cause the block to propagate very slowly across the peer-to-peer network, which will increase the risk of an unintended blockchain split. Unintended splits will resolve with time, as you saw in <<draw-lucky-numbers>>, but Bitcoin’s overall security will decrease during such splits.
de_de: Ein Weg, mit dem Netzwerk herumzupfuschen ist, einen sehr grossen Block zu erzeugen, der schon bei einer guten Internetverbindung 10 Sekunden zum Herunterladen braucht. Das mag schnell genug erscheinen, aber den Block an fünf Peers zu schicken würde 50 Sekunden dauern. Das führt dazu, dass sich der Block sehr langsam über das Peer-to-Peer Netzwerk verbreitet, was das Risiko eines unabsichtlichen Chain Splits vergrössert. Unabsichtliche Splits lösen sich im Laufe der Zeit von selbst, wie in <<draw-lucky-numbers>> gezeigt, aber die Sicherheit von Bitcoin verringert sich während solcher Splits.

source: Another potential problem with big blocks that attackers could exploit is that people with poor internet connections will be left out completely because they can’t keep up with the network, or they don’t have the required processing power, RAM, or disk storage space needed to run a full node. These people will need to switch to systems with less security, such as lightweight wallets, reducing the security of the whole network.
de_de: Ein weiteres potentielles Problem mit grossen Blocks, das Angreifer ausnutzen könnten, ist, dass Leute mit schlechter Internetverbindung völlig aussen vor bleiben, weil sie mit dem Netzwerk nicht mithalten können oder nicht das benötigte Mindestmass an Rechenleistung, RAM oder Massenspeicher zum Betrieb eines Full Nodes haben. Diese Leute werden auf Systeme umschwenken müssen, die weniger Sicherheit bieten, wie Lightweight Wallets, was die Sicherheit für das gesamte Netzwerk verringert.

source: Regardless of the reason, this limit is in place.
de_de: Egal weshalb, dieses Limit ist gesetzt.

source: Signature operations limit
de_de: Signatur-Operationslimit

source: The signature operations limit was put in place because signature-verification operations are relatively slow, especially in non-segwit transactions. An attacker could stuff a transaction with a tremendous number of signatures, causing verifying nodes to be busy verifying signatures for a long time. The limit of 20,000 such operations per block was somewhat arbitrarily chosen to prevent such an attack.
de_de: Die Begrenzung der Signaturoperationen wurde eingeführt, weil Signaturverifikationen relativ langsam sind, besonders in non-SegWit Transaktionen. Ein Angreifer könnte eine Transaktion mit einer ungeheuren Menge von Signaturen vollstopfen, was die verifizierenden Nodes dann für eine lange Zeit beschäftigt halten würde. Das Limit von 20.000 solcher Operationen pro Block wurde mehr oder weniger willkürlich getroffen, um eine solche Attacke zu verhindern.

source: Increasing the limits
de_de: Vergrössern der Limits

source: It will take a _hard fork_ to remove or increase these limits. A hard fork is a rule change that causes old nodes and new nodes to disagree on what the strongest valid blockchain is. We’ll examine forks and upgrades in <<ch11>>. For now, suppose new nodes decide that 8,000,000-byte blocks are OK. When a miner publishes a block that’s bigger than 1,000,000 bytes, new nodes will accept it, whereas old nodes won’t. A permanent blockchain split will occur, and we’ll effectively have two different cryptocurrencies.
de_de: Die Entfernung oder Vergrösserung solcher Limits benötigt eine _Hard Fork_. Eine Hard Fork ist eine Regeländerung, die zu Meinungsverschiedenheiten zwischen alten und neuen Nodes darüber führt, was die stärkste Chain ist. Wir betrachten Forks und Upgrades in <<ch11>>. Für den Moment, lass uns annehmen, dass neue Nodes beschliessen, dass 8.000.000 Bytes pro Block OK sind. Wenn ein Miner einen Block veröffentlicht, der grösser als 1.000.000 Byte ist, dann akzeptieren die neuen Nodes diesen, aber die alten Nodes tun dies nicht. Ein permanenter Chain Split würde passieren, und wir hätten im Effekt zwei Kryptowährungen.

source: Segwit offers an opportunity to somewhat increase both these limits without a hard fork.
de_de: SegWit bietet eine Gelegenheit, die Limits ohne eine Hard Fork zu erhöhen.

source: Increasing the block size limit
de_de: Erhöhen des Blockgrössenlimits

source: The old rule of 1,000,000 bytes remains, so old nodes can continue working as they used to. New nodes will count block size differently, but in a compatible way. Witness bytes will be counted with a “discount” compared to other bytes, such as the block header or transaction outputs. A new measurement, _block weight_, is put in place. A block’s maximum weight is 4,000,000 _weight units_ (WU; <<fig1036>>).
de_de: Die alte Regel von 1.000.000 Bytes bleibt, damit alte Nodes wie gewohnt weiterarbeiten können. Neue Nodes zählen die Blockgrösse anders, aber auf kompatible Art. Witness Bytes werden mit einem “Rabatt” gegenüber den anderen Bytes, wie Block Header oder Transaktion Outputs, gezählt. Eine neue Messgrösse, das Blockgewicht oder _Block Weight_, wird eingeführt. Das maximale Blockgewicht ist 4.000.000 Gewichtseinheiten oder _Weight Units_ (WU; <<fig1036>>).

source: Witness bytes and nonwitness bytes are counted differently. Witness bytes contribute less to the block weight and not at all to the traditional block size, the base block size.
de_de: Witness Bytes und nicht-Witness Bytes werden unterschiedlich gezählt. Witness Bytes tragen weniger zum Blockgewicht bei und überhaupt nicht zur bisherigen Blockgrösse, der Basis-Blockgrösse.

source: Let’s call the block excluding the witnesses the _base block_:
de_de: Nennen wir den Block ohne die Witnesses den Basisblock oder _Base Block_:

source: 1 byte of base block data is counted as 4 WU.
de_de: 1 Byte Base Block Daten zählt als 4 WU.

source: 1 byte of witness data is counted as 1 WU.
de_de: 1 Byte Witness Daten zählt als 1 WU.

source: The effect is that the old 1,000,000-byte block size limit remains because the new rule and the old rule are effectively the same on the base block. But the more segwit is used, the more data can be moved from the base block to the witnesses, which allows for a bigger total block size.
de_de: Der Effekt ist, dass das alte 1.000.000 Byte Block Limit bleibt, weil die neuen und die alten Regeln bezüglich des Basis Blocks gleich sind. Aber je mehr SegWit benutzt wird, desto mehr Daten können aus dem Basis Block in die Witnesses verschoben werden, was eine grössere Gesamtblockgrösse erlaubt.

source: Suppose the witnesses in a block account for ratio stem:[r] of the data in a block. The maximum block weight is 4,000,000, and a total block size stem:[T] gives
de_de: Angenommen die Witnesses in einem Block machen das Verhältnis stem\:[r] der Daten in einem Block aus. Das maximale Blockgewicht ist 4.000.000 und die gesamte Blockgrösse stem\:[T] ergibt sich aus:

source: Inserting various values of stem:[r] into this formula gives different maximum total block sizes, as <<tab1002>> shows.
de_de: Einsetzen von Werten für stem:[r] in diese Formel ergibt verschiedene maximale Gesamtblockgrössen, wie <<tab1002>> zeigt.

source: Maximum block sizes for different ratios of witness data
de_de: Maximale Blockgrössen für verschiedene Verhältnisse von Witness Daten

source: | stem:[r] (witness bytes/total bytes) | Max total block size (bytes) | 0 | 1,000,000 | 0.1 | 1,081,081 | 0.3 | 1,290,323 | 0.5 | 1,600,000 | 0.6 | 1,818,182 | 0.7 | 2,105,263 | 0.8 | 2,500,000
de_de: | stem:[r] (Witness Bytes/Gesamt Bytes) | Max Gesamtblockgrösse (Bytes) | 0 | 1.000.000 | 0,1 | 1.081.081 | 0,3 | 1.290.323 | 0,5 | 1.600.000 | 0,6 | 1.818.182 | 0,7 | 2.105.263 | 0,8 | 2.500.000

source: As the relative amount of witness data increases in the block, we can squeeze in more transactions. The effect is an actual maximum block size increase.
de_de: Wenn die relative Witness Datenmenge im Block zunimmt, können wir mehr Transaktionen hineinstopfen. Der Effekt ist eine echte Zunahme der Blockgrösse.

source: The witness discount is implemented for several reasons:
de_de: Der Witness Rabatt wurde aus verschiedenen Gründen implementiert:

source: The signature scripts and witnesses don’t go into the UTXO set. Data that goes into the UTXO set has higher costs because the UTXO set should preferably be stored in RAM for fast transaction verification.
de_de: Das Signatur Script und die Witnesses landen nicht im UTXO Set. Daten, die in das UTXO Set eingehen, haben höhere Kosten, weil das UTXO Set zur schnellen Verifikation der Transaktionen vorzugsweise im RAM gespeichert wird.

source: It gives wallet developers, exchanges, and smart contract developers more incentive to make fewer outputs, which reduces the UTXO set’s size. For example, an exchange can choose to consolidate its many outputs into a few outputs.
de_de: Es gibt Wallet Entwicklern, Exchanges und Smart Contract Entwicklern einen höheren Anreiz, weniger Outputs zu erzeugen, was die Grösse des UTXO Sets verringert. Zum Beispiel könnte eine Exchange wählen, ihre vielen Outputs zu wenigen Outputs zu konsolidieren.

source: The witnesses don’t have to be sent to a lightweight wallet.
de_de: Die Witnesses brauchen nicht an Lightweight Wallets geschickt zu werden.

source: Increasing the signature operations limit
de_de: Vergrössern der Grenze für Signaturoperationen

source: Because we’re increasing the block size with segwit, we also need to increase the number of allowed signature operations; allowing more transaction data per block should imply that we also need to allow more signature operations. We can increase the limit in the same manner as we increased the block size limit.
de_de: Weil wir die Blockgrösse mit SegWit vergrössern, müssen wir auch die Anzahl erlaubter Signaturoperationen erhöhen; mehr Transaktionsdaten pro Block sollte implizieren, dass wir auch mehr Signaturoperationen erlauben müssen. Wir können das Limit auf dieselbe Weise erhöhen, wie wir das Blockgrössenlimit erhöht haben.

source: We increase the number of allowed signature operations from 20,000 to 80,000 and count each legacy signature as four operations and each segwit operation as one operation. We count a segwit signature operation less than a legacy operation because the former is more efficient, as discussed in <<new-hashing-algorithm>>.
de_de: Wir erhöhen die Anzahl erlaubter Signaturoperationen von 20.000 auf 80.000 und zählen jede herkömmliche Signatur als vier Operationen und jede SegWit Operation als eine Operation. Eine SegWit Signaturoperation zählt weniger als eine herkömmliche Operation, weil diese effizienter ist, wie in <<new-hashing-algorithm>> besprochen.

source: This will have the same effect as the block size increase. If a block contains only legacy inputs, the old limit of 20,000 actual operations remains. If the block contains only segwit inputs, the new limit of 80,000 actual operations is in effect. Any combination of legacy and segwit inputs in a block will result in a limit somewhere between 20,000 and 80,000 actual signature operations.
de_de: Das wird denselben Effekt haben wie die Blockgrössenerweiterung. Enthält ein Block nur herkömmliche Inputs, bleibt das alte Limit von 20.000 Operationen. Wenn der Block nur aus SegWit Transaktionen besteht, ist das Limit effektiv 80.000 Operationen. Jede Kombination von herkömmlichen und SegWit Inputs führt zu einer Grenze irgendwo zwischen 20.000 und 80.000 tatsächlichen Signaturoperationen.

source: This chapter has walked through segregated witness, which solves some problems:
de_de: Dieses Kapitel hat SegWit durchgenommen, was einige Probleme löst:

source: _Transaction malleability_—A txid might change without changing the effect of its transaction. This can cause broken links between transactions, making the child transaction invalid.
de_de: _Transaction Malleability_, _Transaktions-Umformbarkeit_—Eine txid könnte sich ändern, ohne den Effekt der Transaktion zu verändern. Das könnte zu kaputten Verbindungen zwischen Transaktionen führen, womit die Child Transaktion ungültig wird.

source: _Inefficient signature verification_—As the number of inputs doubles in a transaction, the time to verify the transaction increases quadratically. This is because both the transaction’s size and the number of signatures to verify doubles.
de_de: _Ineffizient Signaturverifikation_—Wenn sich die Anzahl Inputs in einer Transaktion verdoppelt, nimmt die zur Verifikation dieser Transaktion benötigte Zeit quadratisch zu. Das liegt daran, dass sich sowohl die Transaktionsgrösse als auch die Anzahl Signaturen verdoppelt.

source: _Wasted bandwidth_—Lightweight wallets must download the transactions, including all signatures, to be able to verify the merkle proof, but the signature data is useless to them because they don’t have the spent outputs to verify against.
de_de: _Bandbreitenverschwendung_–Lightweight Wallets müssen die Transaktionen einschliesslich aller Signaturen herunterladen, um den Merkle Proof verifizieren zu können, aber die Signaturdaten sind nutzlos für sie, weil sie nicht die ausgegebenen Outputs kennen, gegen die sie prüfen müssten.

source: _Hard to upgrade_—There is limited room for script language upgrades. A handful of ``OP_NOP``s are left, and you can’t change an `OP_NOP` however you please. If the new operator behavior succeeds, it must behave exactly as an `OP_NOP`.
de_de: _Schwierige Upgrades_–Es gibt wenig Raum für Upgrades der Script Sprache. Eine Handvoll ``OP_NOP``s sind noch übrig, und man kann einen `OP_NOP` nicht nach Belieben abändern. In den Fällen, in denen der neue Operator erfolgreich ist, muss er sich genau wie `OP_NOP` verhalten.

source: By moving signature data out of the base transaction, that data will no longer be part of the txid.
de_de: Durch das Verschieben der Signaturdaten aus der Basistransaktion heraus, sind diese Daten nicht mehr Teil der txid.

source: If the signature is malleated, it won’t affect the txid. Unconfirmed chains of transactions become unbreakable.
de_de: Wenn die Signatur umgeformt wird, betrifft das nicht mehr die txid. Unbestätigte Verkettungen von Transaktionen werden unzerbrechlich.

source: A new signature-hashing algorithm is used that makes the verification time grow _linearly_ with the number of inputs. The old signature-hashing algorithm hashes the entire transaction for each signature.
de_de: Ein neuer Signatur-Hashing-Algorithmus wird benutzt, der für ein _lineares_ Anwachsen der für die Verifikation benötigten Zeit bei wachsender Anzahl Inputs sorgt. Der alte Signatur-Hashing-Algorithmus hasht die gesamte Transaktion für jede Signatur.

source: Signatures in witnesses will hash the transaction only once.
de_de: Signaturen in Witnesses hashen die Transaktion nur einmal.

source: The intermediate hash is reused for each signature, which greatly reduces the total amount of hashing.
de_de: Der Zwischenhash wird für jede Signatur wiederverwendet, was den Gesamtaufwand für das Hashen stark verringert.

source: The bandwidth that lightweight wallets require decreases because they don’t have to download the witnesses to verify that a transaction is included in a block. They can use the per-transaction savings to increase their privacy by decreasing their bloom filter size or to reduce data traffic with preserved privacy.
de_de: Die Bandbreite, die Lightweight Wallets brauchen, verringert sich, weil sie die Witnesses nicht herunterladen müssen, um zu verifizieren, dass die Transaktion Teil eines Blocks ist. Sie können die Ersparnisse pro Transaktion zur Verbesserung ihrer Privacy verwenden, indem sie ihren Bloom Filter verkleinern, oder bei gleichbleibender Privacy ihren Datenverbrauch verringern.

source: The witness version in the pubkey script allows for future upgrades of the script language. These upgrades can be arbitrarily complex with no restrictions on functionality.
de_de: Die Witness Version im Pubkey Script erlaubt zukünftige Upgrades der Script Sprache. Diese Upgrades können beliebig komplex werden, ohne Einschränkungen der Funktionalität.

source: New rules apply for blocks containing segwit transactions. An output in the coinbase transaction must commit to all the block’s witnesses.
de_de: Neue Regeln gelten für Blocks, die SegWit Transaktionen enthalten. Ein Output in der Coinbase Transaktion muss sich an alle Witnesses des Blocks binden.

source: Old nodes will still work because they aren’t aware of the commitment in the coinbase transaction. This let us introduce segwit without disrupting, or splitting, the blockchain into two separate cryptocurrencies.
de_de: Alte Nodes funktionieren weiter, weil sie von dem Commitment in der Coinbase Transaktion nichts wissen. Das lässt uns SegWit einführen, ohne die Blockchain in zwei verschiedene Kryptowährungen aufzuspalten.

source: What part of the transaction is the cause for transaction malleability?
de_de: Welcher Teil der Transaktion ist der Grund für die Transaction Malleability?

source: Why is transaction malleability a problem?
de_de: Warum ist Transaction Malleability ein Problem?

source: Why do we say that legacy transaction verification time increases quadratically with the number of inputs?
de_de: Warum sagen wir, dass die Zeit zur Verifikation herkömmlicher Transaktionen mit der Anzahl Inputs quadratisch wächst?

source: Why do lightweight wallets need the signatures of a legacy transaction to verify that it’s included in a block?
de_de: Warum brauchen Lightweight Wallets die Signaturen einer herkömmlichen Transaktion, um zu verifizieren, dass sie Teil eines Blocks ist?

source: Suppose you want to add a new feature to Bitcoin’s Script language, and you want to redefine the behavior of `OP_NOP5`. What’s important to think about when you design the new behavior to avoid a blockchain split (because not all nodes will upgrade simultaneously)?
de_de: Angenommen, du willst ein neues Feature zu Bitcoin Script hinzufügen, und du möchtest dazu das Verhalten von `OP_NOP5` neu definieren. Woran musst du unbedingt denken, wenn du das neue Verhalten entwirfst, um einen Blockchain Split zu verhindern (denn nicht alle Nodes werden gleichzeitig upgraden)?

source: Which of the following are segwit addresses? What kind of segwit addresses are they?
de_de: Welche der folgenden sind Segwit Adressen? Um welche Art von Segwit Adresse handelt es sich?

source: What’s the witness version used for? The witness version is the first number in a segwit output—for example, `00` in
de_de: Wofür wird die Witness Version benutzt? Die Witness Version ist die erste Zahl in einem SegWit Output–zum Beispiel die `00` in

source: Explain how a segwit transaction is valid according to an old node that knows nothing about segwit. This is what the old node sees:
de_de: Erläutere, wie eine SegWit Transaktion für einen alten Node gültig ist, der nichts von SegWit weiss. Das hier sieht der alte Node:

source: Explain how a segwit transaction is verified by a new node that knows about segwit. This is what it sees:
de_de: Erkläre, wie eine SegWit Transaktion von einem neuen Node verifiziert wird, der SegWit kennt. Der Node sieht das hier:

source: Suppose you want to upgrade the Bitcoin system. You want the witness commitment to commit to the transaction fees in the block, in addition to the witness root hash, by making a merkle tree of all transaction fees. Suggest how the fee merkle root could be committed to in the block without breaking compatibility with old nodes. You don’t have to think about future upgradability after this change, because that’s more complex. Use the following figure as a hint:
de_de: Angenommen, du willst das Bitcoin System upgraden. Du möchtest, dass sich das Witness Commitment zusätzlich zum Witness Root Hash auch an die Transaction Fees bindet, indem du einen Merkle Tree aller Transaction Fees baust. Schlage vor, wie man sich an den Fee Merkle Root im Block binden könnte, ohne die Kompatibilität mit alten Nodes zu verlieren. Du brauchst zukünftige Upgrades hierbei nicht zu berücksichtigen, denn das wäre zu komplex. Benutze die folgende Abbildung als Hinweis:

source: How would old nodes and new nodes verify blocks that contain the commitment in the previous exercise?
de_de: Wie würden alte und neue Nodes Blocks verifizieren, die das Commitment aus der vorangegangenen Übung enthalten?

source: Segwit moves signature script data out of transactions to solve transaction malleability issues.
de_de: SegWit löst Signatur Script Daten aus den Transaktionen heraus, um Probleme mit Transaktions-Umformbarkeit, oder Transaction Malleability, zu lösen.

source: Segwit uses a new signature-hashing algorithm that makes transaction verification faster. This helps nodes stay up to date with less resources.
de_de: SegWit führt einen neuen Signatur-Hashing-Algorithmus ein, der die Verifikation von Transaktionen schneller macht. Das hilft Nodes dabei, mit weniger Ressourcen auf dem aktuellen Stand zu bleiben.

source: Lightweight wallets get better privacy with preserved data traffic by not downloading witness data.
de_de: Lightweight Wallets bekommen bessere Privacy mit eingespartem Datenvolumen, weil sie keine Witnessdaten mehr herunterladen müssen.

source: The witness version byte of the pubkey script makes upgrading the script language easier.
de_de: Das Witness Versionsbyte des Pubkey Scripts macht Upgrades der Scriptsprache einfacher.
