Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: You want a safe, easy way to back up private keys. You’ve created an HD wallet to generate any number of private keys from a single seed. What’s the minimum Rita needs to back up to restore all keys in her wallet, should she lose it? Right: the seed (and the tree structure, see margin). As long as her seed is safe, she can always re-create all her keys.
de_de: Du willst einen sicheren, einfachen Weg, um private Keys zu sichern. Du hast ein HD Wallet erzeugt, um eine beliebige Menge an private Keys aus einem einzelnen Seed herzuleiten. Was muss Rita mindestens sichern, um alle Keys in ihrem Wallet zurückzugewinnen, wenn sie das Wallet verliert? Richtig: den Seed (und die Baumstruktur, siehe Rand). Solange sie den Seed sicher verwahrt, kann sie immer alle ihre Keys regenerieren.

source: Suppose Rita’s 128-bit (16-byte) seed is
de_de: Angenommen, Ritas 128 Bit (16 Byte) Seed ist

source: It’s a lot easier to write these 32-hex digits on a piece of paper than it would be to write her eight private keys. But the biggest win is that Rita can write this down once and lock it in a safe. As long as that paper is safe, her wallet is safe from accidental loss. She can even create new keys from the same seed without having to make another backup.
de_de: Es ist viel einfacher, diese 32 Hexziffern auf Papier aufzuschreiben als ihre acht private Keys. Aber der grösste Gewinn ist, dass Rita das einmal aufschreiben und dann in den Safe tun kann. Solange das Papier sicher aufbewahrt ist, ist ihr Wallet sicher gegenüber versehentlichem Verlust. Sie kann sogar neue Key aus demselben Seed erzeugen, ohne ein weiteres Backup anfertigen zu müssen.

source: But it’s still difficult to write this down without any typos. What if Rita makes a typo and then loses her wallet? She won’t be able to restore any of her keys! You need something even simpler that’s more compatible with how humans work.
de_de: Aber es ist immer noch schwierig, das ohne Tippfehler abzuschreiben. Was ist, wenn Rita einen Tippfehler macht und dann ihr Wallet verliert? Sie würde ihre Keys nicht wiederherstellen können! Man braucht etwas noch Einfacheres, das noch kompatibler mit der Arbeitsweise von Menschen ist.

source: Mnemonic sentences
de_de: Mnemonische Sätze

source: Most Bitcoin wallets use mnemonic sentences for backup. This is standardized in BIP39. Before that, wallets typically used password-protected files with all keys, which caused a lot of headache.
de_de: Die meisten Bitcoin Wallets benutzen mnemonische Sätze als Backup. Diese sind in BIP39 standardisiert. Vorher benutzten Wallets typischerweise passwortgeschützte Dateien mit allen Keys, was für eine Menge Kopfschmerzen gesorgt hat.

source: Recall that the seed is a sequence of bits. For example, Rita’s seed is 128 bits long. What if you could encode those bits in a more human-friendly way? You can!
de_de: Erinnere dich daran, dass ein Seed eine Abfolge von Bits ist. Zum Beispiel ist Ritas Seed 128 Bit lang. Was, wenn man das auf menschenfreundlichere Art codieren könnte? Man kann!

source: Rita’s wallet can display the seed as a sequence of 12 English words, called a _mnemonic sentence_:
de_de: Ritas Wallet kann den Seed als Abfolge von 12 englischen Wörtern darstellen, die als _mnemonic sentence_ oder _mnemonischer Satz_ (Merksatz) bezeichnet werden:

source: This mnemonic sentence encodes the seed in a human-readable way. It’s much more approachable to write down 12 words than it is to write down cryptic hex code. If Rita loses her wallet, she can install the wallet app on another phone and restore the seed from those 12 words. Rita can regenerate all her private keys from that seed.
de_de: Dieser mnemonische Satz codiert den Seed auf eine menschenlesbare Art. Es ist viel zugänglicher, 12 Wörter hinzuschreiben, als kryptischen Hexcode. Wenn Rita ihr Wallet verliert, kann sie die Wallet App auf einem anderen Telefon installieren und den Seed aus diesen 12 Wörtern regenerieren.

source: Encoding a seed into a mnemonic sentence
de_de: Codieren des Seeds in einen mnemonischen Satz

source: We’re going to explore how this encoding works. It’s really fun, but if you think this section goes too deep, you can accept the previous paragraph and skip to <<extended-public-keys>>.
de_de: Wir untersuchen, wie diese Codierung funktioniert. Es ist wirklich spassig, aber wenn dir dieser Abschnitt zu tief geht, dann kannst du einfach den letzten Abschnitt glauben und vorwärts springen zu <<extended-public-keys>>.

source: The encoding starts with the random seed, as shown in <<fig0414>>. The seed is hashed with SHA256, and the first 4 bits of the hash—in this case, `0111`—are appended to the seed. Those 4 bits act as a checksum. You then arrange the bits into 12 groups of 11 bits, where each group encodes a number in the range 0 to 2047. Eleven bits can encode 2^11^ = 2,048 different values, remember?
de_de: Das Codieren beginnt mit dem Zufalls-Seed, wie in <<fig0414>> gezeigt. Der Seed wird mit SHA256 gehasht, und die ersten 4 Bits des Hashes–in diesem Fall `0111`–werden an den Seed angehängt. Diese 4 Bits dienen as Checksum. Dann arrangieren wir die Bits in 12 Gruppen zu 11 Bit, wobei jede Gruppe eine Zahl im Bereich 0 bis 2047 codiert. Elf Bits können 2^11^ = 2,048 verschiedene Werte darstellen, erinnerst du dich?

source: Encoding a random seed as a 12-word mnemonic sentence. The seed is checksummed, and every group of 11 bits is looked up in a word list of 2,048 words.
de_de: Codieren eines Zufalls-Seeds als 12-Wort mnemonic sentence. Der Seed wird mit Checksum versehen und zu jeder Gruppe von 11 Bit wird in einer Liste von 2048 Wörtern ein Wort nachgeschlagen.

source: The 12 numbers are looked up in a standardized word list of 2,048 words numbered from 0 to 2047. You can find this list in BIP39 from <<web-bips>>; it contains commonly used English words. After looking up all 12 numbers, the result is the mnemonic sentence.
de_de: Die 12 Zahlen werden in einer standardisierten Wortliste aus 2048 Wörtern nachgeschaut, die von 0 bis 2047 durchnumeriert ist. Du findest diese Liste in BIP39 auf <<web-bips>>; sie enthält gängige englische Wörter. Nachdem du alle 12 Zahlen dort nachgeschaut hast, besitzt du den mnemonic sentence.

source: The sentence doesn’t mean anything in particular. It’s 12 random words, just like the hex-encoded seed is 32 random hex digits.
de_de: Der Satz bedeutet nichts besonderes. Es sind einfach 12 zufällige Wörter, so wie der hex-codierte Seed auch aus 32 zufälligen Hexziffern besteht.

source: Rita’s wallet shows the mnemonic sentence to her, and she writes the 12 words down on a piece of paper. She puts the paper in a safe place and gets on with her life.
de_de: Ritas Wallet zeigt ihr den mnemonic sentence, und sie schreibt die 12 Wörter auf ein Stück Papier. Sie legt das Papier in einen Safe und kümmert sich wieder um ihren Alltag.

source: Decoding a mnemonic sentence into a seed
de_de: Decodieren eines mnemonic sentence zu einem Seed

source: The next day, Rita drops her phone into the ocean, and it disappears into the deep. She lost her wallet! But Rita isn’t very concerned. She buys a new phone and installs the wallet app. She instructs her app to restore from a backup. The wallet asks her for her mnemonic sentence. She writes
de_de: Am nächsten Tag fällt Rita das Telefon ins Meer und verschwindet in der Tiefe. Sie hat ihr Wallet verloren! Aber Rita macht sich keine grossen Sorgen. Sie kauft ein neues Telefon und installiert die Wallet App. Sie wählt die Funktion zum Restaurieren des Seeds aus einem Backup. Das Wallet bittet um den mnemonic sentence. Sie schreibt

source: into the wallet app. The app decodes the sentence by reversing the encoding process; Rita can regenerate her keys from the decoded seed, as <<fig0415>> shows.
de_de: in die Wallet App. Die App decodiert den Satz, indem sie den Codierprozess umkehrt. Rita kann ihre Keys aus dem decodierten Seed regenerieren, wie <<fig0415>> zeigt.

source: Decoding a mnemonic sentence into the seed
de_de: Decodieren eines mnemonic sentence in einen Seed

source: The decoding uses the 4-bit checksum to make sure it’s correct. If Rita accidentally writes the last word as `deposit` instead of `depend`, the checksum check will _probably_ fail because she wrote the wrong word at the end. If she types `depends` instead of `depend`, the decoding will definitely fail because there’s no word `depends` in the word list.
de_de: Das Decodieren benutzt die 4 Bit Checksum, um sicherzustellen, dass alles stimmt. Wenn Rita versehentlich als letztes Wort `deposit` anstelle von `depend` schreibt, wird die Checksum _wahrscheinlich_ nicht passen, weil sie das falsche Wort am Ende geschrieben hatte. Wenn sie `depends` statt `depend` schreibt, wird das Decodieren definitiv scheitern, weil es das Wort `depends` in der Wortliste gar nicht gibt.

source: The checksum is pretty weak—4 bits make only 16 possible checksums. A wrongly written mnemonic sentence, in which all words exist in the word list, would have a 1/16 probability of not being detected. This seems bad. But the probability that you’d write such a sentence is small, because your misspelled words have to exist in the word list. This reduces the risk of an invalid mnemonic sentence being restored.
de_de: Die Checksum ist ziemlich schwach–4 Bit ergeben nur 16 mögliche Checksums. Ein falsch geschriebener mnemonic sentence, in dem alle Wörter in der Wortliste vorkommen, hat daher eine 1/16 Wahrscheinlichkeit, nicht entdeckt zu werden. Das scheint ziemlich schlecht zu sein. Aber die Wahrscheinlichkeit, dass man solch einen Satz schreibt, ist ziemlich klein, denn die falsch geschriebenen Wörter müssten in der Wortliste vorkommen. Das verringert das Risiko eines ungültigen mnemonic sentence beim Wiederherstellen.

source: Rita created her wallet from a random 128-bit seed, which she backed up with a 12-word mnemonic sentence. Her wallet can create any number of private keys from that seed. She can organize them into different “accounts” as she pleases. Very nice. But HD wallets have another feature: you can create a tree of public keys and chain codes without knowing any of the private keys.
de_de: Rita hat ihr Wallet aus einem 128 Bit Seed erzeugt, den sie mit einem mnemonic sentence von 12 Worten gesichert hat. Ihr Wallet kann eine beliebige Anzahl an private Keys aus diesem Seed erzeugen. Sie kann diese nach Belieben in verschiedene “Konten” organisieren. Sehr schön. Aber HD Wallets haben noch ein weiteres Feature: Man kann einen Baum von public Key und Chain Codes erzeugen, ohne irgendeinen private Key zu kennen.

source: Suppose the cafe uses an HD wallet. It wants to start selling cookies on its website and delivering those cookies to coworkers’ cubicles.
de_de: Angenommen, der Cafébesitzer verwendet ein HD Wallet. Er möchte die Kekse auf seiner Webseite verkaufen und diese an die Cubicles der Kollegen liefern.

source: For privacy reasons, the web server needs to be able to present a new cookie token address for every sale, but where does it get the addresses? The cafe could create an xprv for an _online sales_ account in its HD wallet and put that xprv on the web server, as <<fig0416>> shows.
de_de: Aus Gründen der Privacy muss der Web Server für jeden erkauf eine neue Cookie Token Adresse anzeigen können, aber woher bekommt er die Adressen? Das Café könnte einen xprv für einen _Onlineverkauf_ Konto in seinem HD Wallet einrichten und den xprv auf den Web Server legen, wie in <<fig0416>> gezeigt.

source: The cafe copies its online sales xprv to the web server.
de_de: Das Café kopiert seinen Onlineverkauf xprv auf den Web Server.

source: The web server can now create new addresses as the orders pour in. Great! But what if Mallory, the gangster, gains access to the web server’s hard drive? She can steal all the money in any of the addresses in the online sales account. She can’t steal from any other addresses in the tree. For example, she can’t calculate any key in the _counter sales_ account because she doesn’t have access to the master xprv, which is needed to calculate the counter sales account key and all its children.
de_de: Der Web Server kann jetzt neue Adressen erzeugen, wenn Bestellungen eingehen. Toll! Aber was ist, wenn Mallory, die Gaunerin, sich Zugang zum Massenspeicher des Web Servers verschafft? Sie kann dann alles Geld in allen Adressen im Onlineverkauf Konto stehlen. Sie kann aber nicht von irgendeiner anderen Adresse im Baum stehlen. Zum Beispiel kann sie nicht irgendeinen Key im _Thekenverkauf_ Konto berechnen, weil sie keinen Zugang zum Master xprv hat, der benötigt wird, um Keys für das Thekenverkauf Konto und all dessen Children zu berechnen.

source: Typical web servers are prone to hacking attempts because they’re usually accessible from anywhere in the world. Storing money on the web server would probably attract a lot of hacking attempts. Sooner or later, someone would succeed in getting access to the web server’s hard drive, and steal the xprv.
de_de: Typische Web Server sind anfällig für Hackversuche, weil sie normalerweise von überall in der Welt aus zugänglich sind. Geld auf einem Web Server zu speichern, würde vermutlich eine Menge Hacker einladen. Früher oder später würde es jemandem gelingen, Zugang zum Massenspeicher des Web Servers zu erlangen und den xprv zu stehlen.

source: For this reason, the cafe wants to avoid having any private keys on the web server. Thanks to the HD wallet, this is possible by using xpubs (<<fig0417>>).
de_de: Aus diesem Grund möchte das Café vermeiden, private Keys auf dem Web Server liegen zu haben. Dank des HD Wallets ist dies durch Benutzung von xpubs möglich (<<fig0417>>).

source: An xpub consists of a public key and a chain code.
de_de: Ein xpub besteht aus einem public Key und einem Chain Code.

source: An xpub is similar to an xprv, but the xpub contains a public key and a chain code, whereas the xprv contains a private key and a chain code. An xprv shares the chain code with the xpub. You can create an xpub from an xprv, but you can’t create the xprv from the xpub. This is because public key derivation is a one-way function; a public key can be derived from a private key, but a private key can’t be derived from a public key.
de_de: Ein xpub ist ähnlich wie ein xprv, aber der xpub enthält einen public Key und einen Chain Code, wohingegen der xprv einen private Key und einen Chain Code enthält. Beide haben denselben Chain Code. Man kann einen xpub aus einem xprv erzeugen, aber nicht umgekehrt einen xprv aus einem xpub. Das liegt daran, dass die public Key Ableitungsfunktion eine Einbahnfunktion ist; ein public Key kann von einem private Key abgeleitet werden, aber ein private Key nicht umgekehrt von einem public Key.

source: The cafe puts the xpub `M/1` on the web server. By convention, we use `M` to denote an xpub path and `m` to denote an xprv path. `M/1` and `m/1` have the same chain code, but `M/1` doesn’t have the private key, only the public key. You can create the whole xpub tree from the master xpub (<<fig0418>>), which means you can generate any and all addresses without any private key. You can create addresses, but not spend money from those addresses.
de_de: Das Café legt den xpub `M/1` auf den Web Server. Per Konvention benutzen wir `M`, um einen xpub Pfad zu bezeichnen und `m` für einen xprv Pfad. `M/1` und `m/1` haben denselben Chain Code, aber `M/1` hat nicht denselben private Key, nur den public Key. Man kann den gesamten xpub Baum aus dem Master xpub erzeugen (<<fig0418>>), was bedeutet, man kann alle und jede Adresse ohne irgendeinen private Key erzeugen. Man kann Adressen erzeugen, aber von diesen Adressen kein Geld ausgeben.

source: Generating the tree of xpubs from the master xpub. The general pattern is the same as when generating xprvs, but the child-derivation function differs.
de_de: Erzeugung des Baums von xpubs aus dem Master xpub. Das allgemeine Muster ist dasselbe wie beim Generieren von xprvs, aber die Child-Ableitungsfunktion ist eine andere.

source: This looks exactly like when you generated the tree of xprvs. The difference is that you have no private keys. As <<fig0419>> shows, the xpubs are generated differently than the xprvs. Please compare this to the xprv derivation.
de_de: Das sieht genauso aus wie vorher, als du den Baum aus xprvs erzeugt hast. Der Unterschied ist, dass du keine private Keys hast. Wie <<fig0419>> zeigt, werden die xpubs anders erzeugt als die xprvs. Bitte vergleiche dies mit der Ableitung von xprvs.

source: Xpub derivation. The private key addition from the xprv derivation is replaced by public key “addition.”
de_de: Xpub Ableitung. Die Addition des private Keys bei der xprv Ableitung wird durch “Addition” des public Keys ersetzt.

source: xprv derivation
de_de: xprv Ableitung

source: This resembles xprv derivation. The difference is what you do with the left 256 bits of the 512-bit hash. To calculate the child public key, you treat the left 256 bits as if they were a private key and derive a public key from them. This public key is then added to the parent public key using the special _public key addition_ operation. The result is the child public key. Let’s compare the child public key derivation to the child private key derivation (<<fig0420>>) from the point after generating the left 256 bits of the HMAC-SHA256 hash.
de_de: Dies ähnelt der xprv Herleitung. Der Unterschied liegt in dem, was mit den linken 256 Bit des 512 Bit Hashes geschieht. Um den Child public Key zu berechnen, behandelt man die linken 256 Bit so, als wären sie ein private Key, und leitet einen public Key aus ihnen ab. Dieser public Key wird dann mittels der _public Key Addition_ zum Parent public Key addiert. Das Ergebnis ist der Child public Key. Vergleichen wir einmal die Child public Key Ableitung mit der Child private Key Ableitung (<<fig0420>>) ab dem Punkt nach der Erzeugung der linken 256 Bit des HMAC-SHA512 Hashes.

source: The plus on the private side has a corresponding plus on the public side. The parent private key plus some value is the child private key. The parent public key plus the public key derived from the same value is the child public key.
de_de: Das Plus auf der private Seite hat ein korrespondierendes Plus auf der public Seite. Der Parent private Key plus irgendein Wert ergibt den Child private Key. Der Parent public Key plus der public Key, der von demselben Wert abgeleitet wurde, ergibt den Child public Key.

source: Normal addition is used for the private key. You add a 256-bit number to the parent private key to get the child private key. But to keep the result within 256-bit numbers, you use addition _modulo_ 2^256^.
de_de: Für den private Key wird die normale Addition benutzt. Man addiert eine 256 Bit Zahl zum Parent private Key, um den Child private Key zu erhalten. Aber um das Ergebnis im Bereich der 256 Bit Zahlen zu halten, benutzt man Addition _modulo_ 2^256^.

source: The addition used to derive the child public key isn’t exactly what most people (including me) are used to. For now, let’s just say this addition works. We’ll dig deeper into that in <<public-key-math>>.
de_de: Die Addition, die zum Ableiten des Child public Key benutzt wird, ist nicht gerade das, was die meisten Leute (mich eingeschlossen) gewöhnt sind. Wir gehen in <<public-key-math>> näher darauf ein.

source: Deriving hardened private keys
de_de: Ableiten von gehärteten private Keys

source: This section is challenging. If you had a hard time understanding xprv derivation and xpub derivation, I suggest skipping this section and jumping to <<public-key-math>>. You don’t need this section to understand the rest of this book.
de_de: Dieser Abschnitt ist anspruchsvoll. Wenn du es schwierig fandest, xprv Ableitung und xpub Ableitung zu verstehen, schlage ich vor, dass du diesen Abschnitt überspringst und direkt zu <<public-key-math>> springst. Du brauchst diesen Abschnitt nicht, um den Rest des Buches zu verstehen.

source: This section will explain how to prevent a potential security issue with normal xprv derivation.
de_de: Dieser Abschnitt erklärt, wie man ein Sicherheitsproblem mit der normalen xprv Ableitung verhindern kann.

source: The cafe’s online business works well. People are ordering cookies like crazy! The online sales account grows, with a new public key for every order. The xpub for the online sales account sits on the web server, and the xprv is present only in the cafe’s wallet (and in a locked-away mnemonic sentence).
de_de: Das Online Geschäft des Cafés läuft prima. Die Leute bestellen Kekse wie verrückt! Das online Verkaufskonto wächst, mit einem neuen public Key für jede Bestellung. Der xpub für die online Verkäufe liegt auf dem Web Server, und der xprv liegt nur im Wallet des Cafés (und in einem weggeschlossenen mnemonic sentence).

source: Suppose Mallory somehow steals the private key `m/1/1`, which contains only 10 CT. This might seem harmless because that private key has so little money in it. But it could be worse than that. If Mallory has also managed to get the xpub for the online sales account from the web server, she can _calculate the online sales xprv_, as <<fig0421>> shows.
de_de: Angenommen Mallory stiehlt irgendwie den private Key `m/1/1`, der nur 10 CT enthält. Dann mag das zwar harmlos aussehen, weil dieser private Key so wenig Geld kontrolliert. Aber es könnte schlimmer sein als das. Falls es Mallory ausserdem schafft, den xpub vom online Verkaufskonto des Web Servers zu stehlen, dann kann sie den _xprv des online Verkaufskontos ausrechnen_, wie man in <<fig0421>> sieht.

source: Mallory has stolen the private key `m/1/1` from the cafe and the parent xpub from the web server. She can now steal all the money in the online sales account.
de_de: Mallory hat den private Key `m/1/1` vom Café gestohlen und den Parent xpub vom Web Server. Jetzt kann sie das gesamte Geld im online Verkaufskonto stehlen.

source: Remember how the xprv derivation function used normal addition to calculate a child private key from a parent private key?
de_de: Weisst du noch, wie die xprv Ableitungsfunktion normale Addition benutzt, um einen Child private Key aus einem Parent private Key zu berechnen?

source: \text{"m/1"} + \text{"left half hash of index 1"}=\text{"m/1/1"}
de_de: \text{"m/1"} + \text{"linker halber Hash von Index 1"}=\text{"m/1/1"}

source: You can write this just as well as
de_de: Das kann man auch schreiben als

source: \text{"m/1/1"}-\text{"left half hash of index 1"}=\text{"m/1"}
de_de: \text{"m/1/1"}-\text{"linker halber Hash von Index 1"}=\text{"m/1"}

source: Mallory has everything she needs to calculate the left-half hash for any child index of `M/1` she pleases, but she doesn’t know which index her stolen private key has, so she starts testing with index 0:
de_de: Mallory hat alles, was sie braucht, um die linke Hashhälfte für jeden beliebigen Child Index von `M/1` zu berechnen, den sie will, aber sie weiss nicht, welchen Index ihr gestohlener private Key hat, also beginnt sie bei Index 0:

source: \text{"m/1/1"} - \text{"left half hash of index 0"} = \text{"a private key"}
de_de: \text{"m/1/1"} - \text{"linker halber Hash von Index 0"} = \text{"ein private Key"}

source: She derives the public key from this private key and notices that it doesn’t match `M/1`, so `0` wasn’t the correct index. She then tries index `1`:
de_de: Sie leitet den public Key von diesem private Key ab und stellt fest, dass es nicht zu `M/1` passt, also war `0` nicht der korrekte Index. Sie probiert dann Index `1`:

source: \text{"m/1/1"} - \text{"left half hash of index 1"} = \text{"another private key"}
de_de: \text{"m/1/1"} - \text{"linker halber Hash von Index 1"} = \text{"noch ein private Key"}
