Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: The checksum used in Bech32 will detect up to four character errors with 100% certainty. If there are more character errors, the probability of detection failure is less than one in a billion. This is a major improvement to the 4-byte checksum in base58check, which doesn’t provide any guarantee.
de_de: Die von Bech32 verwendete Checksumme stellt bis zu 4 Zeichenfehler mit 100% Wahrscheinlichkeit fest. Wenn es mehr Zeichenfehler gibt, beträgt die Wahrscheinlichkeit, das nicht festzustellen, weniger als eins zu einer Milliarde. Das ist eine erhebliche Verbesserung zu der 4 Byte Checksumme in base58check, die keinerlei Garantien bietet.

source: Your segwit address consists of two parts. The first two characters, `bc` (short for bitcoin) is the _human-readable part_. The `1` is a delimiter between the human-readable part and the _data part_, which encodes the actual information that Amy will use to create the transaction output:
de_de: Deine SegWit Adresse besteht aus zwei Teilen. Die ersten beiden Zeichen, `bc` (kurz für bitcoin) sind der _menschenlesbare Teil_. Die `1` ist ein begrenzer zwischen dem menschenlesbaren Teil und dem _Datenteil_, der die eigentliche Information codiert, die Amy benuzten wird, um den Transaktionsoutput zu erzeugen.

source: A version, 0 in this case.
de_de: Eine Version, 0 in diesem Falle.

source: A _witness program_. In this case, the witness program is a PKH, `c8052b79…3176cba8`.
de_de: Ein _Witness Programm_. In diesem Fall ist das Witness Programm ein PKH, `c8052b79…3176cba8`.

source: We’ll explain what the witness program is a bit further on. Think about it as a PKH for now. The version and witness program aren’t directly extractable from the address because they’re encoded using bech32. You give the address `bc1qeqzj…ag6jdmkj` to Amy by showing her a QR code. She has a modern wallet that understands this address format, so she scans your address and extracts the version and witness program, as <<fig1012>> illustrates.
de_de: Wir klären ein bisschen später, was das Witness Programm ist. Stell es dir im Moment einfach als PKH vor. Die Version und das Witness Programm lassen sich aus der Adresse nicht direkt herausziehen, denn sie sind mittels bech32 codiert. Du gibst die Adresse `bc1qeqzj…ag6jdmkj` Amy, indem du ihr einen QR Code zeigst. Sie hat ein modernes Wallet, das dieses Adressformat versteht, also scannt sie deine Adresse und extrahiert Version und Witness Programm, wie <<fig1012>> illustriert.

source: Amy decodes the segwit address to get the witness version and the witness program.
de_de: Amy decodiert die SegWit Adresse, um die Witness Version und das Witness Programm zu erhalten.

source: Checksum
de_de: Checksumme

source: I won’t go into details on the checksum. I encourage the interested reader to read BIP173.
de_de: Ich gehe nicht in Details auf die Checksumme ein. Dafür ermuntere ich die Leser, sich BIP173 anzuschauen.

source: This occurs in multiple steps:
de_de: Dies geschieht in mehreren Schritten:

source: The human-readable part and the data part are separated.
de_de: Der menschenlesbare Teil und der Datenteil werden getrennt.

source: The data part of the address is converted, character by character, into numbers using a base32 lookup table. The first of these numbers is the witness version, `0`. The following numbers, except the last six, are the witness program. The last six numbers are the checksum.
de_de: Der Datenteil der Adresse wird mit Hilfe der bech32 Nachschlagetabelle Zeichen für Zeichen in Zahlen konvertiert. Die erste dieser Zahlen ist die Witness Version, `0`. Die folgenden Zahlen, bis auf die letzten sechs, sind das Witness Programm. Die letzten sechs Zahlen sind die Checksumme.

source: The checksum is verified; no errors were detected in this example.
de_de: Die Checksumme wird verifiziert; in diesem Beispiel werden keine Fehler festgestellt.

source: The witness program is rewritten by writing each number as a 5-bit number.
de_de: Das Witness Programm wird neu geschrieben, indem jede zahl als 5 Bit Zahl geschrieen wird.

source: The bits are rearranged in groups of 8 bits. Each such group represents a byte of the witness program.
de_de: Die Bits werden in Gruppen von 8 Bits neu angeordnet. Jede solche Gruppe repräsentiert ein Byte des Witness Programms.

source: Amy extracts the witness program as `c8052b7…3176cba8`.
de_de: Amy extrahiert das Witness Programm als `c8052b7…3176cba8`.

source: Amy creates a transaction with a new kind of pubkey script that you aren’t used to (<<fig1013>>).
de_de: Amy erzeugt eine Transaktion mit einer neuen Art von Pubkey Script, das du noch nicht gewöhnt bist (<<fig1013>>).

source: Amy sends 0.1 BTC to your segwit address. The pubkey script doesn’t contain any script operators, just data.
de_de: Amy schickt 0,1 BTC an deine SegWit Adresse. Das Pubkey Script enthält keine Script Operatoren, nur Daten.

source: She broadcasts this transaction on the Bitcoin network. The network will accept the transaction because it’s correctly signed in the old-fashioned way. Eventually, it will be confirmed in a block. Your wallet will acknowledge that you’ve received the money, and you’ll give the laptop to Amy.
de_de: Sie sendet diese Transaktion an das Bitcoin Netzwerk. Das Netzwerk wird die Transaktion akzeptieren, weil sie auf die herkömmliche Weise korrekt signiert ist. Irgendwann wird sie in einen Block eingebaut. Dein Wallet wird bestätigen, dass du das Geld bekommen hast, und du gibst Amy den Laptop.

source: Spending your segwit output
de_de: Ausgeben des Segwit outputs

source: Now that you’ve received your money, you want to spend it on a used popcorn machine. It costs only 0.09 BTC. It’s a bargain! Suppose the owner of the popcorn machine has the segwit address `bc1qlk34…ul0qwrqp`.
de_de: Jetzt wo du das Geld bekommen hast, möchtest du es für eine gebrauchte Popcorn Maschine ausgeben. Sie kostet nur 0,09 BTC. Es ist ein Schnäppchen! Nehmen wir an, der Besitzer der Popcorn Maschine hat die SegWit Adresse `bc1qlk34…ul0qwrqp`.

source: Your transaction sends the money to the popcorn machine owner’s segwit address and pays a 0.01 BTC transaction fee (<<fig1014>>). The input has an empty signature script; the signature data is instead added as a _witness field_ in the attached witness.
de_de: Deine Transaktion schickt das Geld an die SegWit Adresse des Besitzers der Popcorn Maschine und zahlt eine 0,01 BTC Transaktionsgebühr (<<fig1014>>). Der Input hat ein leeres Signatur Script; die Signaturdaten sind stattdessen als _Witness Feld_ im angehängten Witness eingetragen.

source: You create and broadcast a payment to the popcorn machine owner.
de_de: Du erzeugst und sendest eine Zahlung an den Popcornmaschinenbesitzer.

source: Had there been multiple inputs in this transaction, there would be multiple witness fields in the witness, one for each input. You can mix segwit inputs and legacy inputs, in which case the witness fields for the legacy inputs would be empty because their signatures are in the respective signature script, as they always were.
de_de: Wären mehrere Inputs in dieser Transaktion gewesen, gäbe es mehrere Witness Felder im Witness, eines für jeden Input. Du kannst SegWit Inputs und herkömmliche Inputs mischen, in diesem Fall sind die Witness Felder für die herkömmlichen Inputs leer, weil deren Signaturen im jeweiligen Signatur Script liegen, so wie sie das immer taten.

source: Verifying the segwit transaction
de_de: Verifizieren der SegWit Transaktion

source: You’ve sent your transaction for the popcorn machine to the Bitcoin peer-to-peer network for processing. Let’s see how an upgraded full node verifies this transaction before relaying it to other nodes (<<fig1015>>). Because it’s running the latest and greatest software, it knows how to deal with segwit transactions.
de_de: Du hast deine Transaktion für die Popcorn Maschine an das Bitcoin Peer-to-Peer Netzwerk zur Verarbeitung geschickt. Schauen wir, wie ein aktueller Full Node diese Transaktion verifiziert, bevor er sie an andere Nodes weiterleitet (<<fig1015>>). Weil er die letzte und tollste Softwareversion benutzt, weiss er, wie man mit SegWit Transaktionen umgehen muss.

source: A full node verifies your transaction’s witness. The pattern `00` followed by exactly 20 bytes gets special treatment.
de_de: Ein Full Node verifiziert den Witness deiner Transaktion, Das Muster `00` gefolgt von genau 20 Bytes erfährt eine Sonderbehandlung.

source: Remember p2sh
de_de: Kennst du noch p2sh

source: A segwit output is recognized by pattern matching, just like a p2sh output was in <<ch05>>.
de_de: Ein SegWit Output wird durch Mustererkennung festgestellt, genau so wie ein p2sh Output in <<ch05>>.

source: The full node, which knows about segwit, looks for a pattern in the pubkey script starting with a single version byte followed by a 2- to 40-byte witness program. In this case, the pattern matches, which means this is a segwit output.
de_de: Der Full Node, der SegWit kennt, sucht nach einem Muster im Pubkey Script, das mit einem einzelnen Versionsbyte beginnt und von einem 2- bis 40-Byte Witness Programm gefolgt wird. In diesem Fall passt das Muster, was bedeutet, es ist ein SegWit Output.

source: The next step for the full node is to understand what _kind_ of segwit output it is. As of this writing, there’s only one version of segwit output: version `00`. This version comes in two different flavors:
de_de: Der nächste Schritt für den Full Node ist, zu verstehen, welche _Art_ von SegWit Output es ist. Zum Zeitpunkt des Schreibens gibt es nur eine Version von SegWit Output: Version `00`. Diese Version kommt in zwei verschiedenen Geschmacksrichtungen:

source: _Pay-to-witness-public-key-hash (p2wpkh)_, identified by a 20-byte witness program, as in this example
de_de: _Pay-to-witness-public-key-hash (p2wpkh)_, gekennzeichnet durch ein 20 Byte Witness Programm, wie in diesem Beispiel

source: _Pay-to-witness-script-hash (p2wsh)_, identified by a 32-byte witness program. p2wsh will be explained later in this chapter.
de_de: _Pay-to-witness-script-hash (p2wsh)_, gekennzeichnet durch ein 32 Byte Witness Programm. p2wsh wird später in diesem Kapitel erklärt.

source: Why “witness program”?
de_de: Wieso “Witness Programm”?

source: It’s called a witness program because it can be regarded as a program of a weird language. In version `00`, the witness program is a single operator whose length defines its behavior.
de_de: Es wird als Witness Programm bezeichnet, da es als Programm einer seltsamen Sprache angesehen werden kann. In der Version "00" ist das Witness Programm ein einzelner Operator, dessen Länge sein Verhalten definiert.

source: In this case, we have the version byte `00` followed by exactly 20 bytes, which means this is a p2wpkh payment. If the version byte is unknown to the node, the node will immediately accept this input without further processing. This acceptance of unknown versions will become useful for future, forward-compatible upgrades of the script language. All segwit nodes will recognize version `00`.
de_de: In diesem Fall haben wir das Versionsbyte `00`, gefolgt von genau 20 Bytes, was bedeutet, dies ist eine p2wpkh Zahlung. Wenn dem Node das Versionsbyte unbekannt ist, akzeptiert er diesen Input sofort, ohne weitere Bearbeitung. Diese Akzeptanz unbekannter Versionen wird bei späteren, vorwärtskompatiblen Upgrades der Script Sprache nützlich sein. Alle SegWit Nodes erkennen Version `00`.

source: The p2wpkh is the simplest of the two types because it’s similar to the well-known p2pkh. Let’s look at how they both work:
de_de: Das p2wpkh ist der einfachste der beiden Typen, weil es ähnlich dem bekannten p2pkh ist. Schauen wir uns an, wie die beiden funktionieren:

source: _p2pkh_—The pubkey script contains the actual script that checks the signature in the signature script.
de_de: _p2pkh_—Das Pubkey Script enthält das eigentliche Script, welches die Signatur im Signatur Script überprüft.

source: _p2wpkh_—The actual script is a predetermined template, and the witness program _is_ the PKH to insert into the script template. The signature and the public key are taken from the witness.
de_de: _p2wpkh_—Das eigentliche Script ist eine vordefinierte Schablone, ein Template, und das Witness Programm _ist_ der PKH, der in die Schablone eingetragen wird. Die Signatur und der public Key werden dem Witness entnommen.

source: In the end, it’s seemingly the exact same program that is run for both of these two types. The difference is where the components come from. But other differences exist between segwit scripts and legacy scripts—for example, the meaning of `OP_CHECKSIG` has changed, as you’ll see in <<new-hashing-algorithm>>.
de_de: Am Ende ist es augenscheinlich genau dasselbe Programm, das für beide Typen abläuft. Der Unterschied liegt darin, woher die Komponenten kommen. Aber es gibt andere Unterschiede zwischen SegWit Scripts und herkömmlichen Scripts–zum Beispiel hat sich die Bedeutung von `OP_CHECKSIG` geändert, wie wir in <<new-hashing-algorithm>> sehen.

source: Why do p2wpkh at all when we’re running the exact same script program as in p2pkh? Recall that we want to solve transaction malleability. We do this by removing the signature data from the transaction inputs so no one can change the txid by making subtle changes to the signature script.
de_de: Warum überhaupt p2wpkh benutzen, wenn wir sowieso dasselbe Programm laufen lassen wie bei p2pkh? Denk daran, dass wir Transaction Malleability reparieren wollen. Wir tun dies, indem wir die Signaturdaten aus den Transaktion Inputs herausnehmen, sodass niemand die txid durch subtile Änderungen am Signatur Script verändern kann.

source: The full node has verified this transaction and sends it to its peers. There’s just one problem: one peer has no idea what segwit is. It’s an old node that hasn’t been upgraded for a while.
de_de: Der Full Node hat diese Transaktion verifiziert und schickt sie an seine Peers. Es gibt nur ein Problem: einer der Peers hat keine Ahnung, was SegWit ist. Es ist ein alter Node, der schon eine ganze Weile nicht aktualisiert wurde.

source: “Verifying” on old nodes
de_de: “Verifizieren” auf alten Nodes

source: An old node has just received your transaction and wants to verify it. Old nodes know nothing about segwit or that there are witnesses attached to transactions. The old node downloads the transaction as it always has, which is without the witness attachment. <<fig1016>> shows what the node sees.
de_de: Ein alter Node hat gerade deine Transaktion bekommen, und möchte sie verifizieren. Alte Nodes wissen nichts von SegWit, oder dass Witnesses an Transaktionen dranhängen. Der alte Node lädt die Transaktion so wie immer, also ohne den Witness-Anhang. <<fig1016>> zeigt, was der Node sieht.

source: An old node sees just two data items in the pubkey script and an empty signature script.
de_de: Ein alter Node sieht nur zwei Datenobjekte im Pubkey Script und ein leeres Signatur Script.

source: Because the node doesn’t know anything else, it creates the script program by taking the empty signature script and appending the pubkey script. The resulting program looks like this:
de_de: Weil der Node es nicht besser weiss, erzeugt er das Script Programm indem er das leere Signatur Script nimmt und das Pubkey Script daranhängt. Das resultierende Programm sieht so aus:

source: The node runs this program. The program puts two data items on the stack—first `00`, and then the `c805…cba8`. When it’s done, there’s nothing left to do but check whether the top item on the stack, `c805…cba8`, is `true`. Bitcoin defines anything that’s nonzero to be true, so this script will pass, and the transaction is authorized.
de_de: Der Node startet dieses Programm. Das Programm legt zwei Datenobjekte auf den Stack–zuerst `00` und dann `c805…cba8`. Wenn das fertig ist, ist nichts mehr zu tun als zu prüfen, ob das oberste Element des Stacks, `c805…cba8`, `true` ist. Bitcoin definiert alles, was nicht null ist, als true, also läuft dieses Script durch und die Transaktion ist autorisiert.

source: This doesn’t seem very secure. This is known as an _anyone-can-spend_, meaning anyone can create a transaction that spends the output. It requires no signature. You just have to create an input with an empty signature script to take the money.
de_de: Das wirkt nicht besonders sicher. Es ist bekannt als _anyone-can-spend_, was bedeutet, dass jeder eine Transaktion erzeugen kann, die den Output ausgibt. Es bedarf keiner Signatur. Man muss nur einen Input mit einem leeren Signatur Script erzeugen, um sich das Geld zu holen.

source: Nonstandard transactions
de_de: Nonstandard Transaktionen

source: A node that doesn't recognize the spent script type normally doesn't relay the transaction. It's considered nonstandard. This relay policy reduces the risk that a transaction that uses the segwit output as an anyone-can-spend ends up in a block.
de_de: Ein Node, der den ausgebenden Script Typ nicht kennt, leitet die Transaktion normalerweise nicht weiter. Sie wird als nicht standardkonforme Transaktion betrachtet. Diese Relay Policy verringert das Risiko, dass eine Transaktion, die den SegWit Output als anyone-can-spend verwendet, in einem Block landet.

source: In <<ch11>>, we’ll talk about how to deploy upgrades like segwit safely. For now, you can assume that 95% of the hashrate (miners) run with segwit. If a transaction uses your output as an anyone-can-spend, and a non-segwit miner includes it in a block, then this block will be rejected by 95% of the hashrate and consequently excluded from the strongest chain. The miner will lose its block reward.
de_de: In <<ch11>> besprechen wir, auf welche Weise Upgrades wie SegWit sicher ausgerollt werden können. Für den Moment kannst du annehmen, dass 95% der Hashrate (Miner) mit SegWit laufen. Wenn eine Transaktion deinen Output als anyone-can-spend verwendet und ein non-SegWit Miner sie in einen Block einbaut, dann wird dieser Block von 95% der Hashrate abgelehnt und daher aus der stärksten Chain ausgeschlossen. Der Miner verliert seinen Block Reward.

source: Including your segwit transaction in a block
de_de: Einbindung der SegWit Transaktion in einen Block

source: Your segwit transaction has propagated through the network, and all nodes have verified it along the way. Now, a miner wants to insert the transaction into a new block. Suppose the miner runs modern software and thus knows about segwit. Let’s look at how it’s included in the block (<<fig1017>>).
de_de: Deine SegWit Transaktion hat sich über das Netzwerk verbreitet und alle Nodes haben sie auf dem Weg verifiziert. Jetzt will ein Miner die Transaktion in einen neuen Block einfügen. Angenommen, der Miner benutzt moderne Software und weiss daher von SegWit. Schauen wir, wie die Transaktion in den Block eingetragen wird (<<fig1017>>).

source: Your segwit transaction gets included in a block. The block commits to the witnesses by putting the witness commitment into an output of the coinbase transaction.
de_de: Deine SegWit Transaktion wird in einen Block integriert. Der Block bindet sich an den Witness, indem er das Witness Commitment in einen Output der Coinbase Transaktion legt.

source: The block is built as before, but with one important difference. A new block rule is introduced in segwit: if there are segwit transactions in the block, the coinbase transaction must contain an output with a _witness commitment_. This witness commitment is the combined hash of the _witness root hash_ and a _witness reserved value_. The witness root hash is the merkle root of the _witness txids_ (_wtxids_) of all transactions in the block. The wtxid is the hash of the transaction _including the witness_, if there is one. An exception exists for the coinbase, whose wtxid is always defined as 32 zero bytes. The witness reserved value is dedicated for future system upgrades.
de_de: Der Block ist wie zuvor gebaut, aber mit einem wichtigen Unterschied. Eine neue Blockregel wird mit SegWit eingeführt: wenn es SegWit Transaktionen in dem Block gibt, dann muss die Coinbase Transaktion einen Output mit einem _Witness Commitment_ enthalten. Dieses Witness Commitment ist der kombinierte Hash vom _Witness Root Hash_ und einem _Reservierten Witness Wert_. Der Witness Root Hash ist der Merkle Root der _Witness txids_ (_wtxids_) aller Transaktionen in dem Block. Die wtxid ist der Hash der Transaktion _einschliesslich Witness_, wenn es einen gibt. Es gibt eine Ausnahme für die Coinbase, deren wtxid immer als 32 Nullbytes definiert ist. Der reservierte Witness Wert ist für zukünftige Systemerweiterungen vorgesehen.

source: The witness commitment is written in an `OP_RETURN` output (<<fig1018>>).
de_de: Das Witness Commitment wird in einen `OP_RETURN` Output geschrieben (<<fig1018>>).

source: The coinbase transaction’s witness contains the witness reserved value, and an `OP_RETURN` output contains the witness commitment.
de_de: Der Witness der Coinbase Transaktion enthält den reservierten Witness Wert, und ein `OP_RETURN` Output enthält das Witness Commitment.

source: The witness reserved value can be any value. But a full node verifying this block needs a way to know what that value is. If the node didn’t know the witness reserved value, it wouldn’t be able to reconstruct the witness commitment for comparison with the `OP_RETURN` output’s witness commitment. The coinbase transaction’s witness contains the witness reserved value so full nodes can verify the witness commitment.
de_de: Der reservierte Witness Wert kann ein beliebiger Wert sein. Aber ein Full Node, der den Block verifiziert, muss eine Methode haben, diesen Wert herauszufinden. Wenn der Node den reservierten Witness Wert nicht kennen würde, dann könnte er das Witness Commitment nicht rekonstruieren, um es mit dem `OP_RETURN` Output des Witness Commitments zu vergleichen. Der Witness der Coinbase Transaktion enthält den reservierten Witness Wert, damit Full Nodes das Witness Commitment verifizieren können.

source: Old nodes verifying the block
de_de: Alte Nodes verifizieren den Block

source: The block in <<fig1017>> is valid for new segwit-enabled full nodes, so it must also be valid for old nodes that don’t know what segwit is. An old node won’t download any witnesses from its peers because it doesn’t know they exist (<<fig1019>>).
de_de: Der Block in <<fig1017>> ist für neue, SegWit-fähige Full Nodes gültig, also muss er auch für alte Nodes gültig sein, die nicht wissen, was SegWit ist. Ein alter Node wird keine Witnesses von seinen Peers laden, weil er nicht weiss, dass es so etwas gibt (<<fig1019>>).

source: An old node verifies the block with your transaction. It won’t verify the signatures or the witness commitment.
de_de: Ein alter Node verifiziert den Block mit deiner Transaktion. Er wird weder die Signatur noch das Witness Commitment verifizieren.

source: This node will do what it’s always done—run the scripts of the transactions, which will look like spending anyone-can-spend outputs. That’s OK, move on. If some of the transactions in the block are non-segwit, those transactions will be fully verified.
de_de: Dieser Node macht das, was er immer gemacht hat–die Scripts der Transaktion ausführen, die genau so aussehen wie anyone-can-spend Outputs. Das ist in Ordnung, mach weiter. Wenn einige der Transaktionen in dem Block non-SegWit sind, werden diese Transaktionen vollständig verifiziert.

source: We’ve now gone full circle with your transaction to the popcorn machine owner, who hands over the machine to you.
de_de: Wir haben jetzt den Kreis mit deiner Transaktion an den Besitzer der Popcorn Maschine geschlossen, der die Maschine an dich übergibt.
