Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: This book is intended for technically interested people who want to understand Bitcoin on a deep technical level. The book doesn’t require any programming skills, but a basic understanding of some technical concepts is beneficial—for example, databases, computer networks, computer programs, and web servers. A little math background can be useful too, but it’s certainly not required.
de_de: Dieses Buch ist für technisch interessierte Leute gedacht, die Bitcoin auf einer tiefen technischen Ebene verstehen wollen. Es benötigt keine Programmierkenntnisse, aber ein grundlegendes Verständnis einiger technischer Konzepte ist hilfreich—zum Beispiel Datenbanken, Computernetzwerke, Computerprogramme und Web Server. Ein gewisser Mathehintergrund kann auch nützlich sein, ist aber sicher nicht notwendig.

source: How this book is organized: A roadmap
de_de: Wie dieses Buch aufgebaut ist: Eine Übersicht

source: This book consists of 11 chapters and 3 appendices:
de_de: Dieses Buch besteht aus 11 Kapiteln und 3 Anhängen:

source: <<ch01>> is an overview of Bitcoin. You’ll learn what Bitcoin is, why it matters, and roughly how it operates.
de_de: <<ch01>> ist ein Überblick über Bitcoin. Hier steht, was Bitcoin ist, warum es wichtig ist, und wie es ungefähr funktioniert.

source: <<ch02>> discusses cryptographic hash functions and digital signatures. These are the fundamental building blocks needed for the rest of this book. I also lay the groundwork for a fictive money system, the cookie token spreadsheet, that we’ll build on in chapters 2–8.
de_de: <<ch02>> bespricht kryptografische Hashfunktionen und digitale Signaturen. Dies sind die grundlegenden Bausteine für den Rest des Buches. Ich lege hier auch das Fundament für ein fiktives Geldsystem, das Keksgutschein-Kalkulationsblatt, das wir in den Kapiteln 2–8 bauen werden.

source: <<ch03>> covers addresses. When you send bitcoins, you send them to the recipient’s Bitcoin address. What are Bitcoin addresses, why are they needed, and how are they created and used?
de_de: <<ch03>> behandelt Adressen. Wenn man Bitcoins verschickt, so verschickt man sie an die Bitcoin Adresse des Empfängers. Was sind Bitcoin Adressen, wozu werden sie benötigt, und wie werden sie erzeugt und benutzt?

source: <<ch04>> goes through how a Bitcoin wallet keeps track of your secret keys and how multiple secret keys can be generated from a single huge random number called a seed. Backups are also discussed in detail.
de_de: <<ch04>> nimmt durch, wie ein Bitcoin Wallet deine privaten Schlüssel verwaltet und wie aus einer einzigen, riesigen Zufallszahl, dem Seed oder Samenkorn, viele private Schlüssel erzeugt werden können. Backups, also Datensicherungen, werden ebenfalls hier durchgenommen.

source: <<ch05>> explores the anatomy of a Bitcoin transaction and how transactions are digitally signed and processed.
de_de: <<ch05>> untersucht die Anatomie einer Bitcoin Transaktion und wie Transaktionen digital signiert und ausgeführt werden.

source: <<ch06>> discusses the blockchain: the database where transactions are stored. We walk through how the blockchain is structured and how it enables the use of so-called lightweight wallets.
de_de: <<ch06>> diskutiert die Blockchain: die Datenbank, auf der die Transaktionen gespeichert werden. Wir besprechen Schritt für Schritt, wie die Blockchain strukturiert ist und wie dies die Verwendung von sogenannten Light Wallets ermöglicht.

source: <<ch07>> covers proof of work, which is used to select who gets to add new transactions to the blockchain. This process, called mining, is what keeps your bitcoins secure in the blockchain.
de_de: <<ch07>> behandelt den Proof of Work Mechanismus, mit dem ausgehandelt wird, wer der Blockchain neue Transaktionen hinzufügen darf. Der dazugehörige Prozess, das Mining, sichert die Bitcoin in der Blockchain ab.

source: <<ch08>> explores the Bitcoin network. Bitcoin has no central point of control, and you’ll see how that’s possible with a peer-to-peer network. I also explain how to take active part in the Bitcoin network by running your own node.
de_de: <<ch08>> untersucht das Bitcoin Netzwerk. Bitcoin hat keine Kontrollzentrale, und wir werden feststellen, wie so etwas mit einem Peer-to-Peer Netzwerk möglich ist. Ich erkläre ausserdem, wie man durch Verwendung eines eigenen Nodes eine aktive Rolle im Bitcoin Netzwerk übernehmen kann.

source: <<ch09>> revisits transactions. We circle back to discover some bells and whistles that are important for various applications.
de_de: <<ch09>> betrachtet noch einmal Transaktionen. Wir kehren zurück, um einiges an Schnickschnack zu entdecken, der für diverse Anwendungen wichtig ist.

source: <<ch10>> introduces segregated witness. Bitcoin was upgraded with major improvements to transaction reliability, verification efficiency, and blockchain capacity in 2017, and this chapter gives you all the details.
de_de: <<ch10>> führt Segregated Witness ein. Bitcoin wurde 2017 mit grösseren Verbesserungen in Bezug auf Transaktionsrobustheit, Prüfeffizienz und Blockchainkapazität ausgerüstet, und dieses Kapitel enthält alle Details dazu.

source: <<ch11>> goes through soft forks and hard forks and how Bitcoin can be safely upgraded using a soft fork together with a careful deployment plan.
de_de: <<ch11>> geht durch Soft Forks und Hard Forks und bespricht, wie Bitcoin mittels eines Soft Forks und eines sorgfältigen Ausrollplanes sicher aufgerüstet werden kann.

source: I suggest that you read chapters 2–8, where we’ll build the cookie token system from the ground up, sequentially. Each chapter adds a technology to the system to solve a specific problem, and by chapter 8, we’ll have built Bitcoin. Chapters 9, 10, and 11 can be read out of order, but I recommend reading chapter 11 carefully, because it covers the essence of Bitcoin. If you get chapter 11, you’re grokking Bitcoin.
de_de: Ich schlage vor du liest die Kapitel 2–8, in denen wir das Keksgutschein-System von Grund auf bauen werden, der Reihe nach durch. In jedem Kapitel kommt etwas Technologie hinzu, um ein bestimmtes Problem zu lösen, und bis Kapitel 8 werden wir Bitcoin gebaut haben. Kapitel 9, 10 und 11 können ausser der Reihe gelesen werden, aber ich empfehle, Kapitel 11 sehr sorgfältig zu lesen, denn es behandelt die Essenz von Bitcoin. Wenn du Kapitel 11 verstehst, hast du Bitcoin begriffen.

source: I reuse some overview figures from <<ch01>> every now and then throughout the book to help you with orientation, both in chapter intros and embedded in the chapters. It’s easy to lose track of the big picture and the goal of the current topic; look for the periscope and section headers like “Where were we?”
de_de: Zur Erleichterung der Orientierung verwende ich im Buch ab und zu ein paar der Übersichtsgrafiken aus <<ch01>>, sowohl in den Kapiteleinführungen als auch innerhalb der Kapitel. Man verliert leicht den Überblick und das Ziel des aktuellen Themas. Achte auf das Periskopsymbol und auf Abschnittsüberschriften wie "wo waren wir?".

source: Each chapter, except <<ch01>>, contains exercises. They’re there for you to assess your skills. Each batch of exercises is divided into an easier section called “Warm up,” used for shorter fact checks; and a tougher section, “Dig in,” that requires more thinking. Some of the exercises in the “Dig in” sections are dreadfully difficult, so if you get stuck, please consult <<app2>> for answers.
de_de: Bis auf <<ch01>> enthält jedes Kapitel Übungen. Diese dienen dir zum Einschätzen deiner Kenntnisse. Jede Ladung Übungen besteht aus einem einfacheren Teil namens "Aufwärmen" für kürzere Faktenchecks, und einem schwierigen Teil "Reinhauen", der mehr Denken erfordert. Einige der Übungen unter "Reinhauen" sind fürchterlich schwierig. Wenn du also steckenbleiben solltest, dann schlag ruhig in <<app2>> die Antworten nach.

source: Code conventions
de_de: Code Konventionen

source: There’s not much code in this book. None, actually. But there are some Linux commands in <<ch08>> and <<app1>>. A command is prefixed by a dollar sign and a space, as follows:
de_de: Dieses Buch enthält nicht viel Code. Eigentlich gar keinen. Aber es gibt ein paar Linux Kommandos in <<ch08>> und <<app1>>. Ein Kommando wird von einem Dollarzeichen und einer Leerstelle wie folgt eingeleitet:

source: When a command is too long to fit on a single line, we break the line with a backslash `\` and indent the next line by four characters, as follows:
de_de: Sollte ein Kommando nicht auf eine Zeile passen, teilen wir die Zeile mit einem Backslash `\`auf und rücken die Folgezeile um vier Leerstellen ein, wie hier:

source: Backslashes can be used to write commands across multiple lines in most Linux command-line interpreters, so you can copy and paste such commands into your terminal. Lines of output from commands aren’t broken with backslashes; they’re instead wrapped as needed using a line break arrow as follows:
de_de: Mit Backslashes kann man in den meisten Linux Kommandosprachen mehrzeilige Kommandos schreiben, sodass du solche Zeilen einfach durch Copy-Paste in dein Terminal kopieren kannst. Ausgabezeilen von Kommandos werden nicht mit Backslashes aufgebrochen; sie werden stattdessen falls nötig mit einem Zeilenumbruch wie hier versehen:

source: Throughout the book, data is written in a `fixed-width` font: for example, `7af24c99`. I usually don’t explicitly write out what encoding is used (decimal numbers, hexadecimal strings, base64 strings, base58 strings, and so forth), because it’s often obvious from the context.
de_de: Im gesamten Buch werden Daten in einem `nichtproportionalen` Font dargestellt: Zum Beispiel `7af24c99`. Ich gebe normalerweise nicht an, welche Codierung benutzt wird (Dezimalzahlen, hexadezimale Strings, base64 Strings, base58 Strings und so weiter), weil es oft aus dem Zusammenhang hervorgeht.

source: liveBook discussion forum
de_de: liveBook Diskussionsforum

source: Purchase of _Grokking Bitcoin_ includes free access to a private web forum run by Manning Publications where you can make comments about the book, ask technical questions, and receive help from the author and from other users. To access the forum, go to https://livebook.manning.com/\#!/book/grokking-bitcoin/discussion. You can also learn more about Manning’s forums and the rules of conduct at https://livebook.manning.com/#!/discussion.
de_de: Der Kauf von _Bitcoin begreifen_ beinhaltet kostenfreien Zugriff auf ein privates Web Forum von Manning Publications, wo du Kommentare über das Buch schreiben kannst, technische Fragen stellen kannst und Hilfe vom Autor und anderen Lesern bekommen kannst. Um auf das Forum zuzugreifen, gehe auf https://livebook.manning.com/\#!/book/grokking-bitcoin/discussion. Du kannst auch mehr über Mannings Forums und die dort gültigen Verhaltensregeln lernen auf https://livebook.manning.com/#!/discussion.

source: Manning’s commitment to our readers is to provide a venue where a meaningful dialogue between individual readers, and between readers and the author can take place. It is not a commitment to any specific amount of participation on the part of the author, whose contribution to the forum remains voluntary (and unpaid). We suggest you try asking the author some challenging questions lest his interest stray! The forum and the archives of previous discussions will be accessible from the publisher’s website as long as the book is in print.
de_de: Mannings Selbstverpflichtung unseren Lesern gegenüber ist, einen Treffpunkt bereitzustellen, an dem ein sinnvoller Austausch zwischen einzelnen Lesern sowie zwischen Lesern und Autoren stattfinden kann. Es ist keine Verpflichtung zu einer bestimmten Mindestteilnahme durch den Autor, dessen Beitrag zu dem Forum freiwillig (und unbezahlt) ist. Wir schlagen vor, das Interesse des Autors mit herausfordernden, interessanten Fragen zu wecken. Das Forum und die Archive voriger Diskussionen werden auf der Verlags–Webseite zugreifbar bleiben, solange das Buch sich im Druck befindet.

source: Other author resources
de_de: Andere Ressourcen des Autors

source: If you have specific questions about Bitcoin that you didn’t find the answer to in this book, I recommend Bitcoin Stack Exchange (<<web-stackexchange>>), which is a platform for questions and answers where good answers are up-voted by readers.
de_de: Wenn du spezielle Fragen zu Bitcoin hast, zu denen du die Antworten in diesem Buch nicht finden konntest, empfehle ich Bitcoin Stack Exchange (<<web-stackexchange>>), eine Plattform für Fragen und Antworten, auf der gute Antworten von den Lesern hochgewählt werden.

source: I also recommend the Bitcoin Developer Reference (<<web-dev-ref>>), for more comprehensive documentation of Bitcoin.
de_de: Ich empfehle ausserdem die Bitcoin Developer Reference (<<web-dev-ref>>) als umfassendere Dokumentation von Bitcoin.

source: The Bitcoin Core source code (<<web-bitcoin-source>>) is the most accurate source of information. It’s the reference implementation of the Bitcoin protocol, and reading that source code is sometimes the only way to find answers to questions.
de_de: Der Bitcoin Core Quellcode (<<web-bitcoin-source>>) ist die genaueste Informationsquelle. Es ist die Referenz-Implementation des Bitcoin Protokolls und manchmal findet sich die einzige Antwort nur durch Lesen desselben.

source: If you want to search the contents of this book online, I recommend working with the source code available at <<web-book-source>>. It will be released at the latest 90 days after the book is published.
de_de: Wenn du den Inhalt dieses Buches online durchsuchen willst, empfehle ich die Nutzung des Quelltextes bei <<web-book-source>>. Er wird spätestens 90 Tage nach Veröffentlichung des Buches freigeschaltet.

source: About the author
de_de: Über den Autor

source: Kalle Rosenbaum has worked as a software developer for 20 years. His passion for Bitcoin began in 2013 and has continued uninterrupted. Kalle started a Bitcoin consultancy company in 2015 and has worked in the Bitcoin industry since then. He also writes a technical blog that explains various technical Bitcoin topics, such as block-propagation improvements, sidechains, and replace-by-fee. The purpose of the blog is to teach himself and let others benefit, too.
de_de: Kalle Rosenbaum hat 20 Jahre als Softwareentwickler gearbeitet. Seine Leidenschaft für Bitcoin begann 2013 und setzt sich ununterbrochen fort. Kalle gründete 2015 eine Bitcoin Consulting Firma und arbeitet seitdem in der Bitcoin Industrie. Er schreibt ausserdem einen technischen Blog, der diverse technische Themen von Bitcoin behandelt, zum Beispiel Verbesserungen in der Blockpropagation, Sidechains und Replace-by-Fee. Ziel dieses Blogs ist, sich Dinge selbst beizubringen und andere daran teilhaben zu lassen.

source: Introduction to Bitcoin
de_de: Einführung in Bitcoin

source: Getting to know Bitcoin
de_de: Bitcoin kennenlernen

source: Following a Bitcoin payment
de_de: Einer Bitcoin Zahlung folgen

source: Problems solved by Bitcoin
de_de: Probleme, die Bitcoin löst

source: The goal of this book is to teach you enough about Bitcoin to make informed decisions about how you can use it to improve your private life or business. My hope is that you’ll learn enough to make up your own mind whether you trust Bitcoin or not (with any luck, the former). To get you off the ground, I’m going to assume you know roughly what the following terms mean:
de_de: Das Ziel dieses Buches ist, dir genug über Bitcoin beizubringen, um informierte Entscheidungen darüber zu treffen, wie du mit Bitcoin dein privates Leben oder dein Geschäft verbessern kannst. Ich hoffe, dass du genug lernst, um selbst zu entscheiden, ob du Bitcoin traust oder nicht (mit etwas Glück ersteres). Um anfangen zu können gehe ich davon aus, dass dir die folgenden Begriffe einigermassen vertraut sind:

source: Computer program
de_de: Computerprogramm

source: Database
de_de: Datenbank

source: Computer network
de_de: Computernetzwerk

source: If you’re unsure of any of these terms, don’t worry. Either look them up or go ahead anyway—I think you’ll manage.
de_de: Wenn du dir bei einigen davon nicht sicher bist, mach dir keine Sorgen. Entweder lies erst etwas drüber, oder mach einfach hier weiter. Du wirst es schon schaffen.

source: What is Bitcoin?
de_de: Was ist Bitcoin?

source: Bitcoin or bitcoin?
de_de: Bitcoin oder bitcoin?

source: The system is named _Bitcoin_ with a capital B. The currency unit is called a _bitcoin_ with a lowercase b. Commonly used symbols for bitcoins are {btc}, BTC, and XBT. We’ll mostly use BTC in this book.
de_de: Das System heisst _Bitcoin_ mit grossem B. Die Währung heisst _bitcoin_ mit kleinem b. Häufig benutzte Symbole für bitcoins sind {btc}, BTC und XBT. Wir benutzen in diesem Buch meistens BTC.

source: Bitcoin is a digital cash system. It allows for people to move bitcoins, the currency unit of Bitcoin, between each other without using a bank or any other trusted third party. It resembles traditional bank notes and coins, but it’s purely digital and used over the internet. The Bitcoin currency isn’t tied to any specific _fiat currency_ like the US dollar or the Chinese renminbi; it has free-floating exchange rates against most fiat currencies. You can buy and sell bitcoins for fiat currencies online using one of several exchanges, such as kraken.com, bitstamp.net, or localbitcoins.com.
de_de: Bitcoin ist ein digitales Bargeldsystem. Es erlaubt Leuten bitcoins, die Währungseinheit von Bitcoin, untereinander auszutauschen ohne eine Bank oder sonstige zuverlässige Drittpartei zu benötigen. Es ähnelt traditionellen Banknoten oder Münzen, ist aber vollständig digital und wird über das Internet benutzt. Die Bitcoin Währung ist nicht an eine _Fiat Währung_ wie US Dollar oder chinesische Renminbi gebunden; es hat flexible Wechselkurse gegenüber den meisten Fiat Währungen. Man kann online auf sogenannten Exchanges oder Börsen, wie kraken.com, bitstamp.net oder localbitcoins.com, bitcoins gegen Fiat Währung kaufen und verkaufen.

source: No government or company controls Bitcoin. Instead, thousands of computers around the globe—the _Bitcoin network_, shown in <<actors>>—collectively keep the system working 24/7. You don’t need to register or sign up anywhere to use Bitcoin, you just need internet access and a computer program, like a mobile app, to use it.
de_de: Keine Regierung oder Firma kontrolliert Bitcoin. Stattdessen halten tausende von Computern überall auf der Welt–das sogenannte _Bitcoin Netzwerk_, siehe <<actors>> – kollektiv das System rund um die Uhr am Laufen. Du brauchst dich nirgendwo zu registrieren oder einzutragen, um Bitcoin zu benutzen. Du brauchst nur einen Internetzugang und ein Computerprogramm, etwa eine mobile App, um es zu benutzen.<<

source: The Bitcoin network and its ecosystem.
de_de: Das Bitcoin Netzwerk und sein Ökosystem

source: Anyone can use or participate in the Bitcoin network without special permission from a bank or similar institution. Thanks to Bitcoin’s _permissionless_ nature, a lot of Bitcoin-related technology has emerged over the years. We can roughly categorize participants in this Bitcoin ecosystem into several groups:
de_de: Jeder kann ohne besondere Genehmigung durch eine Bank oder sonstige Einrichtung am Bitcoin Netzwerk teilnehmen und es benutzen. Dank Bitcoins _erlaubnisfreier_ Natur ist über die Jahre allerhand an Bitcoin-bezogener Technologie entstanden. Wir können die Teilnehmer an diesem Ökosystem grob in verschiedene Gruppen einteilen:

source: Bitcoin doesn’t care
de_de: Bitcoin ist das egal

source: The Bitcoin network doesn’t distinguish between users. No user is more important than any other user. It doesn’t matter who they are or what they do; everyone participates on the same terms.
de_de: Das Bitcoin Netzwerk unterscheidet nicht zwischen Benutzern. Kein Benutzer ist wichtiger als irgendein anderer. Es ist egal, wer sie sind oder was sie tun; jeder nimmt zu den gleichen Bedingungen daran teil.

source: End users
de_de: Endbenutzer

source: People using Bitcoin for their day-to-day needs, such as savings, shopping, speculation, or salaries
de_de: Leute, die Bitcoin für ihre Alltagsaufgaben benutzen, wie sparen, einkaufen, spekulieren oder für Gehaltszahlungen.

source: Corporate users
de_de: Firmenbenutzer

source: Companies using Bitcoin to solve their business needs, such as paying wages internationally, or use cases similar to those of end users
de_de: Firmen, die mit Bitcoin geschäftliche Aufgaben lösen, zum Beispiel die Zahlung internationaler Gehälter oder ähnliche Anwendungsfälle wie Endbenutzer.

source: Merchants
de_de: Händler

source: For example, a restaurant or a bookstore accepting Bitcoin payments
de_de: Beispielsweise ein Restaurant oder eine Buchhandlung, die Zahlungen in bitcoin akzeptieren.

source: Bitcoin services
de_de: Bitcoin Dienstleister

source: Companies providing Bitcoin-related services to customers, such as topping up mobile phones, anonymization services, remittance services, or tipping services
de_de: Firmen, die ihren Kunden Bitcoin-bezogene Leistungen anbieten, etwa Auffüllen von Prepaid-Karten, Anonymisierungsdienste, Auslandsüberweisungen oder Spendendienste.

source: Exchanges
de_de: Exchanges oder Börsen

source: Commercial services people can use to exchange their local currency to and from bitcoins
de_de: Kommerzielle Dienste, mit denen Leute ihre lokale Währung in bitcoin konvertieren können und umgekehrt.

source: Protocols on top
de_de: Höhere Protokolle

source: Systems that operate “on top” of Bitcoin to perform certain tasks, such as payment network protocols, specialized tokens, and decentralized exchanges
de_de: Systeme, die auf Basis von Bitcoin bestimmte Fähigkeiten umsetzen, wie Zahlungsnetzwerk–Protokolle, spezialisierte Tokens und dezentrale Exchanges.

source: Bitcoin developers
de_de: Bitcoin Entwickler

source: People working, often for free, with the open source computer programs that participants of the Bitcoin network use
de_de: Leute arbeiten, häufig unbezahlt, an den Open Source Programmen, welche die Teilnehmer des Bitcoin Netzwerks benutzen.

source: The Bitcoin network’s job is to process Bitcoin payments, secure the ledger of who owns what from unauthorized modifications, and get new bitcoins into circulation at the predetermined rate. The network consists of thousands of computers around the world. We call these computers _Bitcoin nodes_, or just _nodes_. Any of the actors mentioned previously can also participate actively in the Bitcoin network by running their own Bitcoin node. You must run your own node if you don’t want to trust others to provide you with correct financial information.
de_de: Die Aufgabe des Bitcoin Netzwerkes ist es Bitcoin Zahlungen abzuarbeiten, die Buchhaltung darüber, wem was gehört, gegen nicht autorisierte Änderungen zu sichern, und mit der vorbestimmten Rate neue bitcoins in Umlauf zu bringen. Das Netzwerk besteht aus tausenden von Computern überall auf der Welt. Wir nennen diese Computer _Bitcoin Nodes_, also _Bitcoin Knoten_, oder einfach _Nodes_. Jeder der vorgenannten Akteure kann auch aktiv am Bitcoin Netzwerk teilnehmen, indem er einen eigenen Node betreibt. Du musst einen eigenen Node betreiben, wenn du dich nicht auf von Dritten gelieferte finanzielle Informationen verlassen willst.

source: The big picture
de_de: Der Überblick

source: The Bitcoin network is a network of computers running Bitcoin software. This network verifies and confirms payments between Bitcoin users.
de_de: Das Bitcoin Netzwerk ist ein Netzwerk von Computern, auf denen die Bitcoin Software läuft. Das Netzwerk prüft und bestätigt Zahlungen zwischen Bitcoin Benutzern.
