Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: Qi and Tom happen to send their `headers` messages to each other at the same time. This isn’t a problem; because they both have the block, they’ll ignore the `headers` received from peers. Lisa will request the block from one of her peers just like Qi requested the block from Rashid.
de_de: Qi und Tom schicken einander zufällig gleichzeitig ihre `headers` Messages. Das ist kein Problem; weil beide den Block haben, ignorieren sie die `headers` Message von Peers. Lisa wird den Block von einem ihrer Peers anfragen, genauso wie Qi den Block von Rashid angefordert hat.

source: All but Lisa have the block. Tom, the cafe, and Qi send `headers` messages.
de_de: Alle ausser Lisa haben den Block. Tom, das Café und Qi schicken `headers` Messages.

source: This concludes the propagation of this block—almost. The lightweight wallets need to be informed about the block.
de_de: Damit endet die Propagation dieses Blocks–fast. Die Lightweight Wallets müssen noch über den Block informiert werden.

source: Notifying wallets
de_de: Wallet Benachrichtigung

source: Tom’s node is connected to John’s wallet, so Tom sends a `headers` message to John. Likewise, the cafe’s full node sends a `headers` message to the cafe’s lightweight wallet. Tom’s and the cafe’s full nodes won’t test the block against the bloom filters in any way. They will send the `headers` message unconditionally, but the lightweight wallets won’t request the full blocks.
de_de: Toms Node ist mit Johns Wallet verbunden, also schickt Tom eine `headers` Message an John. Ebenso schickt der Full Node des Cafés eine `headers` Message an das Lightweight Wallet des Cafés. Die Full Nodes von Tom und dem Café testen den Block in keiner Weise auf Bloom Filter. Sie schicken die `headers` Message auf jeden Fall, aber das Lightweight Wallet wird den vollen Block nicht anfordern.

source: As you might recall from <<ch06>>, lightweight wallets don’t download the full blocks. Most of the time, John’s wallet is only interested in the block headers so it can verify the blockchain’s proof of work. But every now and then, transactions that are relevant to John’s wallet are in the blocks, and the wallet wants proof that those transactions are included in the block. To find out if there are any relevant transactions, he sends a `getdata` message to Tom, requesting a `merkleblock` message for the block.
de_de: Wie dir vielleicht noch aus <<ch06>> in Erinnerung ist, laden Lightweight Wallets die vollen Blocks nicht herunter. Meistens ist Johns Wallet nur an den Block Headern interessiert, damit es den Proof of Work überprüfen kann. Aber ab und zu sind Transaktionen in einem Block, die für Johns Wallet interessant sind, und das Wallet will den Beweis, dass die Transaktion wirklich in dem Block enthalten sind. Um herauszufinden, ob relevante Transaktionen vorliegen, schickt er eine `getdata` Message an Tom und fordert eine `merkleblock` Message für den Block an.

source: John gets a `merkleblock` message containing the block header and a partial merkle tree connecting his transaction ID (txid) to the merkle root in the block header (<<fig0821>>).
de_de: John bekommt eine `merkleblock` Message, die den Block Header und einen partiellen Merkle Tree enthält, der seine Transaktions-ID (txid) an den Merkle Root im Block Header bindet (<<fig0821>>).

source: Tom sends a `merkleblock` containing a merkle proof that John’s transaction is in the block.
de_de: Tom schickt einen `merkleblock` mit dem Merkle Proof, dass Johns Transaktion Teil des Blocks ist.

source: <<fig0822>> gives a little repetition from <<ch06>>.
de_de: <<fig0822>> ist eine kleine Wiederholung von <<ch06>>.

source: The `merkleblock` message contains a block header and a partial merkle tree.
de_de: Die `merkleblock` Message enthält einen Block Header und einen partiellen Merkle Tree.

source: John’s wallet will verify that
de_de: Johns Wallet wird verifizieren, dass

source: The block header is correct and has a valid proof of work.
de_de: Der Block Header korrekt ist und gültigen Proof of Work hat.

source: The merkle root in the header can be reconstructed using the partial merkle tree.
de_de: Der Merkle Root im Header mittels des partiellen Merkle Tree rekonstruiert werden kann.

source: The txid of John’s transaction is included in the partial merkle tree. He doesn’t care about the irrelevant transaction that’s used to obfuscate what belongs to John.
de_de: Die txid von Johns Transaktion ist in den partiellen Merkle Tree eingebunden. Um die irrelevanten Transaktionen, die ja nur vertuschen sollen, was zu John gehört, kümmert er sich nicht.

source: John’s wallet is now sure his transaction is contained in the new block. The wallet can display a message to John saying, “Your transaction has 1 confirmation.”
de_de: Johns Wallet ist jetzt sicher, dass sich seine Transaktion in dem neuen Block befindet. Das Wallet kann John eine Nachricht einblenden, die sagt “Deine Transaktion hat 1 Confirmation.”

source: The cafe’s lightweight wallet will be notified the same way.
de_de: Das Lightweight Wallet des Cafés wird auf die gleiche Weise benachrichtigt.

source: Because the cafe’s wallet uses a trusted node, privacy isn’t much of an issue (<<fig0823>>). The wallet can use a big bloom filter to reduce the number of irrelevant transactions, which in turn will reduce mobile data traffic. The sparser the bloom filter, the less extra obfuscation + traffic will be sent to the wallet.
de_de: Weil das Wallet des Cafés einen Trusted Node verwendet ist Privacy kein grosses Problem (<<fig0823>>). Das Wallet kann einen grossen Bloom Filter benutzen, um die Anzahl irrelevanter Transaktionen zu verringern, womit auch der Bedarf an Mobildaten sinkt. Je knapper der Bloom Filter, desto weniger Verschleierung + Datenverkehr wird an das Wallet geschickt.

source: The cafe requests a merkle block from its trusted full node.
de_de: Das Café fordert einen Merkle Block von seinem Trusted Full Node an.

source: The cafe’s owner feels comfortable handing the cookie over to John now. John eats his cookie. The deal is done.
de_de: Der Besitzer des Cafés kann John jetzt beruhigt den Keks übergeben. John isst ihn auf. Der Handel ist erledigt.

source: More confirmations
de_de: Mehr Confirmations

source: As time passes, more blocks will be mined by the miners. These blocks will all propagate the network and end up on every full node. The lightweight wallets will get merkle blocks to save bandwidth.
de_de: Im Laufe der Zeit werden von den Minern mehr Blocks produziert. Diese Blocks propagieren durch das Netzwerk und landen bei jedem Full Node. Die Lightweight Wallets bekommen Merkle Blocks, um Bandbreite zu sparen.

source: For each new block coming in, John’s transaction will be buried under more and more proof of work (<<fig0824>>). This makes John’s transaction harder and harder to double spend. For each new block, the transaction will get one more confirmation.
de_de: Für jeden neuen Block, der hereinkommt, wird Johns Transaktion unter mehr und mehr Proof of Work begraben (<<fig0824>>). Das macht Johns Transaktion schwerer und schwerer doppelt auszugeben. Mit jedem neuen Block bekommt Johns Transaktion eine weitere Confirmation.

source: As more blocks arrive, John’s transaction becomes safer and safer.
de_de: Je mehr Blocks ankommen, desto sicherer wird Johns Transaktion.

source: Leaving the cookie token system
de_de: Wir verlassen das Cookie Token System

source: I don’t think the cookie token system will add any more to your understanding of Bitcoin. It’s time to let go of the cookie tokens and start talking solely about Bitcoin. We’ve developed the cookie token system to a point where there are no differences from Bitcoin. <<tab0801>> shows the concept mapping table.
de_de: Ich glaube nicht, dass das Cookie Token System jetzt noch zum Verständnis von Bitcoin beiträgt. Es ist Zeit, das Cookie Token System loszulassen und zu beginnen, nur noch über Bitcoin zu sprechen. Wir haben das Cookie Token System bis zu einem Punkt weiterentwickelt, an dem es keine Unterschiede mehr zu Bitcoin gibt. <<tab0801>> zeigt die Konzept-Mapping-Tabelle.

source: The shared folder is ditched in favor of a peer-to-peer network.
de_de: Der Shared Folder wurde zugunsten des Peer-to-Peer Netzwerk verworfen.

source: | Cookie tokens | Bitcoin | Covered in | 1 cookie token | 1 bitcoin | <<ch02>> | *[.line-through]#The shared folder#* | *[.line-through]#The Bitcoin network#* | *[.line-through]#<<ch08>>#*
de_de: | Cookie Tokens | Bitcoin | Behandelt in | 1 Cookie Token | 1 bitcoin | <<ch02>> | *[.line-through]#Der Shared Folder#* | *[.line-through]#Das Bitcoin Netzwerk#* | *[.line-through]#<<ch08>>#*

source: The last cookie token concept that differs from Bitcoin, the shared folder, has been eliminated. Let’s look at how it all happened, in <<fig0825>>.
de_de: Das letzte Cookie Token Konzept, das sich von Bitcoin unterscheidet, der Shared Folder, wurde eliminiert. Schauen wir, wie sich alles entwickelt hat, in <<fig0825>>.

source: We’ll keep our friends at the office a while longer. John will probably have to buy a few more cookies, but he’ll use Bitcoin to do it.
de_de: Wir behalten unsere Freunde im Büro noch eine Weile. John wird vermutlich ein paar weitere Kekse kaufen müssen, aber er wird die jetzt mit bitcoins bezahlen.

source: The cookie token system’s evolution
de_de: Die Evolution des Cookie Token Systems

source: Bitcoin at a glance
de_de: Überblick über Bitcoin

source: The Bitcoin peer-to-peer network is huge. As of this writing:
de_de: Das Bitcoin Peer-to-Peer Netzwerk ist riesig. Zum Zeitpunkt des Schreibens:

source: There are about 10,000 publicly accessible full nodes.
de_de: Gibt es rund 10.000 öffentlich zugängliche Full Nodes.

source: Bitcoin’s money supply is about 17,400,000 BTC.
de_de: Beträgt Bitcoins Geldmenge rund 17.400.000 BTC.

source: Each bitcoin is worth around $6,500.
de_de: Ist jedes bitcoin rund $6.500 wert.

source: Bitcoin processes about 250,000 transactions per day.
de_de: Arbeitet Bitcoin etwa 250.000 Transaktionen pro Tag ab.

source: An estimate of 100,000 BTC, valued at $630 million, is moved daily.
de_de: Wird täglich ein Volumen von geschätzt 100.000 BTC mit einem Wert von $630 Millionen bewegt.

source: The total mining hashrate is about 50 Ehash/s, or 50 × 10^18^ hash/s. + A typical desktop computer can do about 25 Mhash/s.
de_de: Beträgt die gesamte Mining Hashrate rund 50 EHash/s, or 50 × 10^18^ Hash/s. Ein typischer Desktop Computer schafft rund 25 MHash/s.

source: The transaction fees paid each day total around 17 BTC. This averages to 6,800 satoshis per transaction, or about $0.40 per transaction.
de_de: Werden pro Tag rund 17 BTC in Transaction Fee gezahlt. Das sind durchschnittlich 6.800 satoshis pro Transaktion, oder rund $0.40 pro Transaktion.

source: People in all corners of the world use Bitcoin to get around problems in their day-to-day lives.
de_de: Benutzen Leute überall auf der Welt Bitcoin, um Probleme in ihrem Alltag zu umschiffen.

source: This chapter is about Bitcoin’s peer-to-peer network. The first half of the chapter described the network in action after it’s been set up, as illustrated by <<fig0826>>, repeated from <<ch01>>.
de_de: In diesem Kapitel geht es um Bitcoins Peer-to-Peer Netzwerk. Die erste Hälfte des Kapitels beschreibt das Netzwerk in Aktion, nachdem es aufgesetzt wurde, wie in <<fig0826>> dargestellt, einer Wiederholung aus <<ch01>>.

source: The Bitcoin network distributes blocks (and transactions) to all participants.
de_de: Das Bitcoin Netzwerk verteilt Blocks (und Transaktionen) an alle Teilnehmer.

source: The second half of this chapter will look at how a new node joins the network.
de_de: Die zweite Hälfte des Kapitels betrachtet einen Node, der dem Netzwerk neu beitritt.

source: Bootstrapping the network
de_de: Bootstrappen des Netzwerks

source: The scenario in <<the-network-protocol>> assumed that all nodes involved were already connected to each other. But how does a new node start? How would it find other nodes to connect to? How would it download the full blockchain from the genesis block, block 0, up to the latest block? How does it know what the latest block is?
de_de: Das Szenario in <<the-network-protocol>> ging davon aus, dass alle involvierten Nodes bereits miteinander verbunden waren. Aber wie beginnt ein neuer Node? Wie findet er andere Nodes, zu denen er sich verbinden kann? Wie lädt er die volle Blockchain ab dem Genesis Block, Block 0, bis zum letzten Block? Woher weiss er, was der letzte Block ist?

source: Let’s sort it out.
de_de: Klären wir das.

source: Suppose Selma wants to start her own full node. This is how it would typically happen (<<fig0827>>):
de_de: Nehmen wir an, Selma möchte einen eigenen Full Node starten. Folgendes würde typischerweise geschehen (<<fig0827>>):

source: Selma downloads, verifies, and starts the full node computer program.
de_de: Selma lädt, verifiziert und startet das Full Node Computerprogramm.

source: The computer program connects to some nodes.
de_de: Das Computerprogramm verbindet sich mit einigen Nodes.

source: Selma’s node downloads blocks from her peers.
de_de: Selmas Node lädt Blocks von ihren Peers.

source: Selma’s node enters a normal mode of operation.
de_de: Selmas Node geht in den normalen Betrieb über.

source: Running a full node involves downloading and running the software, connecting to other nodes, downloading old blocks, and entering normal operation.
de_de: Der Betrieb eines Full Nodes involviert das Herunterladen und Laufenlassen der Software, das Verbinden zu anderen Nodes, Herunterladen von alten Blocks und den Übergang in den normalen Betrieb.

source: Step 1—Run the software
de_de: Schritt 1–Starte die Software

source: Selma needs a computer program to run a full node. The most commonly used such program is Bitcoin Core. Several others are available, such as libbitcoin, bcoin, bitcoinj, and btcd. We’ll focus only on Bitcoin Core, but you’re encouraged to explore the others yourself.
de_de: Selma braucht ein Computerprogramm, um einen Full Node laufen zu lassen. Das am häufigsten benutzte solche Programm ist Bitcoin Core. Einige andere sind verfügbar, wie libbitcoin, bcoin, bitcoinj und btcd. Wir fokussieren und nur auf Bitcoin Core, aber du kannst gern die anderen selbst ausprobieren.

source: To download Bitcoin Core, Selma visits its web page, https://bitcoincore.org, and finds a download link there. But she encounters a potential problem: Selma isn’t sure the program she downloads is actually the version the developers behind Bitcoin Core released. Someone could have fooled Selma into downloading the program from bitconcore.org instead of bitcoincore.org, or someone might have hacked bitcoincore.org and replaced the downloadable files with alternative programs.
de_de: Um Bitcoin Core herunterzuladen, besucht Selma dessen Webseite, https://bitcoincore.org, und findet dort den Download Link. Aber sie trifft auf ein mögliches Problem: Selma ist sich nicht sicher, ob das Programm, das sie herunterlädt, wirklich die Version ist, die von den Bitcoin Entwicklern freigegeben wurde. Jemand könnte Selma getäuscht haben, sodass sie das Programm von bitconcore.org herunterlädt statt von bitcoincore.org, oder jemand könnte bitcoincore.org gehackt haben und die Download Dateien durch andere Programme ersetzt haben.

source: The Bitcoin Core team therefore signs all released versions of the program with a private key—let’s call it the _Bitcoin Core key_. They provide the signature in a downloadable file, named SHA256SUMS.asc. This file contains the hash value of the released Bitcoin Core software and a signature that signs the contents of the SHA256SUMS.asc file (<<fig0828>>).
de_de: Das Bitcoin Core Team signiert deshalb alle freigegebenen Versionen des Programms mit einem private Key–nennen wir ihn den _Bitcoin Core Key_. Sie liefern die Signatur in einer herunterladbaren Datei namens SHA256SUMS.asc. Diese Datei enthält den Hashwert der freigegebenen Bitcoin Core Software und eine Signatur, die den Inhalt von SHA256SUMS.asc signiert (<<fig0828>>).

source: The Bitcoin Core team signs the released program with their private key.
de_de: Das Bitcoin Core Team signiert das freigegebene Programm mit seinem private Key.

source: Selma has downloaded both the program, in a file called bitcoin-0.17.0-x86_64-linux-gnu.tar.gz, and the signature file, SHA256SUMS.asc. To verify that the program is in fact signed by the Bitcoin Core private key, she needs to know the corresponding public key. But how can she know what this key is?
de_de: Selma hat sowohl das Programm heruntergeladen, in einer Datei namens bitcoin-0.17.0-x86_64-linux-gnu.tar.gz, und die Signaturdatei, SHA256SUMS.asc. Um zu verifizieren, dass das Programm in der Tat mit dem Bitcoin Core private Key signiert wurde, muss sie den korrespondierenden public Key kennen. Aber woher soll sie den kennen?

source: This is a hard problem. Remember when Lisa used to sign blocks with her private key? How would the full nodes verify that the blocks were actually signed by Lisa? They used multiple sources to fetch Lisa’s public key—for example, looking at the bulletin board at the entrance of the office, checking the company’s intranet, and asking colleagues. The same applies here; you shouldn’t trust a single source, but should use at least two different sources. The key that’s currently being used to sign Bitcoin Core releases is named
de_de: Das ist ein schwieriges Problem. Weisst du noch, als Lisa Blocks mit ihrem private Key signiert hat? Wie haben die Full Node verifiziert, dass die Blocks wirklich von Lisa signiert waren? Sie hatten mehrere Quellen benutzt, um Lisas public Key zu holen–zum Beispiel das schwarze Brett am Eingang zum Büro, das Intranet der Firma, und das Befragen von Kollegen. Dasselbe gilt hier; man sollte nicht einer einzelnen Quelle glauben, sondern sollte mindestens zwei verschiedene Quellen heranziehen. Der Key, der zur Zeit zum Signieren der Bitcoin Core Releases benutzt wird, heisst

source: and has the following 160-bit SHA1 hash, called _fingerprint_:
de_de: und hat den folgenden 160-bit SHA1 Hash, oder _Fingerprint_:

source: This book can serve as _one_ of Selma’s sources. She decides to
de_de: Dieses Buch kann als _eine_ von Selmas Quellen dienen. Sie beschliesst

source: Get the fingerprint of the key from https://bitcoincore.org.
de_de: Den Fingerprint des Keys von https://bitcoincore.org zu holen.

source: Verify the fingerprint with the _Grokking Bitcoin_ book.
de_de: Den Fingerprint mit dem _Bitcoin Begreifen_ Buch zu verifizieren.

source: Verify the fingerprint with a friend.
de_de: Den Fingerprint mit einem Freund zu verifizieren.

source: Where to get the key
de_de: Wo bekommt man den Key?

source: It doesn’t really matter where you get the actual public key, but it’s important to verify that its fingerprint is what you expect.
de_de: Es ist eigentlich ziemlich egal, wo du den public Key herbekommst, aber es ist wichtig zu verifizieren, dass der Fingerprint der ist, den du erwartest.

source: The fingerprints from the three sources match, so Selma downloads the public key from a _key server_. A key server is a computer on the internet that provides a repository of keys. Key servers are commonly used to download keys identified by the key’s fingerprint. Selma doesn’t trust the key server, so she needs to verify that the fingerprint of the downloaded key matches the expected fingerprint, which it does.
de_de: Die Fingerprints der drei Quellen stimmen überein, also lädt Selma den public Key von einem _Key Server_ herunter. Ein Key Server ist ein Computer im Internet, der eine Datenbank von Keys bereitstellt. Key Server werden üblicherweise benutzt, um Keys anhand ihrer Fingerprints herunterzuladen. Selma vertraut dem Key Server nicht, also muss sie verifizieren, dass der Fingerprint ihres heruntergeladenen Keys dem erwarteten Fingerprint entspricht, was er tut.

source: Now, when she has the Bitcoin Core public key, she can verify the signature of the SHA256SUMS.asc file (<<fig0829>>).
de_de: Nun, da sie den Bitcoin Core public Key besitzt, kann sie die Signatur der Datei SHA256SUMS.asc überprüfen (<<fig0829>>).

source: She uses the Bitcoin Core public key to verify the signature in the signature file. She must also verify that the program has the same hash value as stated in SHA256SUMS.asc. The signature is valid, and the hashes match, which means Selma can be sure the software she’s about to run is authentic.
de_de: Sie benutzt den Bitcoin Core public Key, um die Signatur in der Signaturdatei zu überprüfen. Sie muss auch verifizieren, dass das Programm denselben Hashwert hat, wie er in SHA256SUMS.asc steht. Die Signatur ist gültig und die Hashes passen, was bedeutet, Selma kann sicher sein, dass die Software, die sie laufen lassen will, authentisch ist.

source: Selma verifies the Bitcoin Core signature and that the hash in the signature file matches the hash of the actual program.
de_de: Selma verifiziert die Bitcoin Core Signatur, und dass der Hash in der Signaturdatei zum Hash des eigentlichen Programms passt.

source: Selma starts the program on her computer.
de_de: Selma startet das Programm auf ihrem Computer.

source: Step 2—Connect to nodes
de_de: Schritt 2–Verbindung zu Nodes

source: When Selma’s full node program starts, it isn’t connected to any other nodes. She’s not part of the Bitcoin network yet. In this step, the node will try to find peers to connect to.
de_de: Als Selmas Full Node Programm startet, ist es noch mit keinem anderen Node verbunden. Sie ist noch nicht Teil des Bitcoin Netzwerks. In diesem Schritt wird der Node versuchen, Peers zum Verbinden zu finden.

source: To connect to a peer, the full node needs the IP address and the TCP port for that peer. For example:
de_de: Um sich mit einem Peer zu verbinden, braucht der Full Node die IP Adresse und die TCP Portnummer für diesen Peer. Zum Beispiel:

source: An IP address and port are often written as
de_de: Eine IP Adresse und Portnummer werden oft geschrieben als

source: Finding initial peers
de_de: Finden der ersten Peers

source: Where does Selma’s node find initial addresses of other peers? Several sources are available (<<fig0830>>):
de_de: Wo findes Selmas Node die ersten Adressen anderer Peers? Mehrere Quellen sind verfügbar (<<fig0830>>):

source: Configure the full node with custom peer addresses. Selma can get an address by asking a friend who’s running a full node.
de_de: Man konfiguriert den Full Node mit benutzerdefinierten Adressen. Selma kann eine Adresse bekommen, indem sie einen Freund fragt, der einen Node am laufen hat.

source: Use the Domain Name System (DNS) to look up initial peer addresses to connect to.
de_de: Man benutzt das Domain Name System (DNS), um die ersten Adressen nachzuschlagen, zu denen man sich verbindet.

source: Use hardcoded peer addresses in the full node program.
de_de: Man benutzt hartkodierte Peer Adressen im Full Node Programm.

source: Selma’s full node has three different types of sources to find initial peers.
de_de: Selmas Full Node hat drei verschiedene Arten von Quellen, um initiale Peers zu finden.
