Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: Do you remember when we introduced p2sh in <<pay-to-script-hash>>? p2sh moves the pubkey script part of the program to the spending input. Let’s have another look at the charity wallet that John, Ellen, and Faiza set up (<<fig1020>>).
de_de: Erinnerst du dich daran, wie wir p2sh in <<pay-to-script-hash>> eingeführt haben? p2sh schiebt den Pubkey Script Teil des Programms in den ausgebenden Output. Schauen wir uns nochmal das Wohlfahrts-Wallet an, das John, Ellen und Faiza eingerichtet haben (<<fig1020>>).

source: John and Faiza spend an output from their multisig wallet.
de_de: John und Faiza verbrauchen einen Output aus ihrem Multisig Wallet.

source: The idea here was that the payer—the donor, in this case—shouldn’t have to pay a higher fee for a big, complex pubkey script. Instead, the recipient wanting to use this fancy scheme will pay for the complexity.
de_de: Ihre Idee war, dass der Zahler–in diesem Falle der Spender–keine höhere Gebühr für ein grosses, komplexes Script zahlen sollte. Stattdessen sollte der Empfänger, der dieses extravagante Modell benutzen will, für die Komplexität bezahlen.

source: With segwit, you can do about the same thing using pay-to-witness-script-hash, which is the segwit version of p2sh. Isn’t naming in Bitcoin fantastic?
de_de: Mit SegWit kannst du ungefähr dasselbe mittels pay-to-witness-script-hash erledigen, was die SegWit Version von p2sh ist. Ist die Namensvergabe in Bitcoin nicht fantastisch?

source: Suppose John, Ellen, and Faiza use segwit for their charity wallet and that the previous popcorn machine owner wants to give the money he received for the popcorn machine to the charity.
de_de: Angenommen, John, Ellen und Faiza benutzen SegWit für ihr Wohlfahrts-Wallet, und dass der vorherige Popcornmaschinenbesitzer das Geld, das er für die Popcornmaschine bekommen hat, der Wohlfahrt spenden möchte.

source: John, Ellen, and Faiza must provide the popcorn guy with a p2wsh address. Their _witness script_ is the same as their p2sh _redeem script_ was when they were using p2sh (<<fig1021>>).
de_de: John, Ellen und Faiza müssen dem Popcorntypen eine p2wsh Adresse geben. Ihr _Witness Script_ ist dasselbe wie das p2sh _Redeem Script_ war als sie p2sh verwendet haben (<<fig1021>>).

source: The witness script is hashed into a witness script hash.
de_de: Das Witness Script wird zu einem Witness Script Hash gehasht.

source: They use this witness script hash to create a p2wsh address in the same way you created your p2wpkh address. They encode
de_de: Sie verwenden diesen Witness Script Hash zur Erzeugung einer p2wsh Adresse auf die gleiche Weise, wie du deine p2wpkh Adresse generiert hast. Sie codieren

source: using Bech32 and get the p2wsh address:
de_de: mittels bech32 und bekommen die p2wsh Adresse:

source: This address is handed to the popcorn guy, who creates and broadcasts a transaction like that shown in <<fig1022>>.
de_de: Diese Adresse wird dem Popcorntypen übergeben, der eine Transaktion erzeugt und sendet, so wie sie in <<fig1022>> steht.

source: The popcorn guy sends the money to the charity’s p2wsh address.
de_de: Der Popcorntyp schickt das Geld an die p2wsh Adresse der Wohlfahrt.

source: The transaction has the witness attached, just like your transaction to the popcorn guy. The only difference between your transaction and the popcorn guy’s transaction is that their outputs have a different witness program length. Your transaction had a 20-byte witness program because it was a SHA256+RIPEMD160 hash of a public key, and the popcorn guy’s transaction has a 32-byte witness program because that’s a SHA256 of a witness script.
de_de: An der Transaktion hängt der Witness dran, genau wie bei deiner Transaktion mit dem Popcorn Typen. Der einzige Unterschied zwischen deiner Transaktion und der des Popcorn Typen ist, dass deren Outputs eine unterschiedliche Witness Programm Länge haben. Deine Transaktion hatte ein 20 Byte Witness Programm, weil es der SHA256+RIPEMD160 Hash eines public Keys war, und die Transaktion des Popcorn Typen hat ein 32 Byte Witness Programm, weil es der SHA256 eines Witness Scripts ist.

source: This transaction will be verified and eventually included in a block.
de_de: Diese Transaktion wird verifiziert und eventuell in einen Block integriert.

source: Spending the p2wsh transaction
de_de: Ausgeben der p2wsh Transaktion

source: Suppose John and Faiza want to spend the 0.08 BTC they got from the popcorn guy by sending it to a shelter for homeless people. The shelter happens to also have a p2wsh address. John and Faiza collaborate to create the transaction <<fig1023>> shows.
de_de: Angenommen, John und Faiza wollen die 0,08 BTC, die sie vom Popcorntypen bekommen haben, ausgeben, indem sie sie an eine Obdachlosen-Unterkunft der Wohlfahrt schicken. Die Unterkunft hat zufälligerweise auch schon eine p2wsh Adresse. John und Faiza arbeiten zusammen, um die neue Transaktion zu erzeugen, die <<fig1023>> zeigt.

source: The charity pays 0.07 BTC to the shelter’s address. The witness is the signatures followed by a data item that contains the actual witness script.
de_de: Die Wohlfahrt bezahlt 0,07 BTC an die Adresse der Unterkunft. Der Witness sind die Signaturen, gefolgt von einem Datenobjekt, das das eigentliche Witness Script enthält.

source: Note how there’s nothing in the signature script. When we used p2sh in <<pay-to-script-hash>>, the signature script got really big because it contained two signatures and the redeem script, which in turn contained three public keys. With segwit, all data is contained in the witness instead.
de_de: Beachte, dass im Signatur Script nichts steht. Als wir p2sh in <<pay-to-script-hash>> benutzt haben, wurde das Signatur Script wirklich gross, weil es zwei Signaturen und das Redeem Script enthielt, welches wiederum drei public Keys enthielt. Bei SegWit werden stattdessen alle Daten im Witness zusammengefasst.

source: Verifying the p2wsh input
de_de: Verifizieren des p2wsh Inputs

source: A full node that wants to verify this transaction needs to determine the type of output being spent (<<fig1024>>). It looks at the output, finds the pattern `<version byte> <2 to 40 bytes data>`, and concludes that this is a segwit output. The next thing to check is the value of the version byte.
de_de: Ein Full Node, der die Transaktion verifizieren will, muss den Typ des ausgegebenen Outputs feststellen (<<fig1024>>). Er schaut sich den Output an, findet das Muster `<version byte> <2 to 40 bytes data>`, und schliesst daraus, dass dies ein SegWit Output ist. Als nächstes muss er den Wert des Versionsbytes prüfen.

source: The version byte is `00`. A version `00` segwit output can have two different lengths of the witness program, 20 or 32 bytes. We covered the first one in the previous sections on p2wpkh. The witness program in this example is 32 bytes, which means this is a p2wsh output.
de_de: Das Versionsbyte ist `00`. Ein Version `00` SegWit Output kann zwei verschiedene Längen des Witness Programms haben, 20 oder 32 Bytes. Wir haben den ersten Fall im vorangegangenen Abschnitt über p2wpkh betrachtet. Das Witness Programm in diesem Beispiel ist 32 Bytes, was bedeutet, es ist ein p2wsh Output.

source: Preparing to verify the p2wsh input
de_de: Vorbereitung zur Verifikation des p2wsh Inputs

source: Special rules apply when spending a p2wsh output. First, the data items in the spending input’s witness field are pushed onto the program stack. Then, the top item on the stack, the witness script, is verified against the witness program in the output (<<fig1025>>).
de_de: Für das Ausgeben eines p2wsh Outputs gelten besondere Regeln. Zuerst werden die Datenobjekte im Witness Feld des ausgebenden Inputs auf den Programm Stack gelegt. Dann wird das oberste Stack-Element, das Witness Script, anhand des Witness Programms im Output geprüft (<<fig1025>>).

source: Verifying the witness of a p2wsh payment
de_de: Verifizieren des Witness einer p2wsh Zahlung

source: The witness script is hashed and compared to the witness program in the spent output before being executed with the three items on the stack. This process is similar to that of verifying a p2sh payment.
de_de: Das Witness Script wird gehasht und mit dem Witness Programm im ausgegebenen Output verglichen, bevor es mit den drei Elementen auf dem Stack ausgeführt wird. Dieser Prozess ist ähnlich wie der der Verifikation einer p2sh Zahlung.

source: Miners and block verifiers handle all segwit transactions the same way, so there’s no difference in how the transaction is included in a block compared to p2wpkh transactions.
de_de: Miner und Blockverifizierer behandeln alle SegWit Transaktionen auf dieselbe Art, es gibt also keinen Unterschied darin, wie eine Transaktion in einen Block integriert wird gegenüber p2wpkh Transaktionen.

source: New hashing method for signatures
de_de: Neues Hashverfahren für Signaturen.

source: This solution is specified in BIP143, “Transaction Signature Verification for Version 0 Witness Program.”
de_de: Diese Lösung wird in BIP143, “Transaction Signature Verification for Version 0 Witness Program,” spezifiziert.

source: One problem that segwit solves is inefficient signature hashing. As explained in <<inefficient-sighash>>, if the number of inputs doubles, the time it takes to verify the transaction roughly quadruples. This is because you
de_de: Ein Problem, das mit SegWit gelöst wird, ist das ineffiziente Hashing von Signaturen. Wie in <<inefficient-sighash>> erklärt, führt eine Verdopplung der Inputs zu einer runden Vervierfachung der Verifikationszeit der Transaktion. Das liegt daran, dass man

source: Double the transaction’s size
de_de: Die Transaktionsgrösse verdoppelt

source: This algorithm is simplified
de_de: Dieser Algorithmus ist vereinfacht

source: In reality, three different intermediate hashes are created: one for all outpoints, one for all sequence numbers, and one for all outputs. However, the effect is the same. Read BIP143 for details.
de_de: In Wirklichkeit werden drei verschiedene Zwischenhashes erzeugt: einer für alle Outpoints, einer für alle Sequenznummern und einer für alle Outputs. Der Effekt ist aber derselbe. Lies BIP143 für Näheres.

source: If you double the number of hashes performed _and_ double the amount of data each hash needs to process, you effectively quadruple the total time spent on hashing.
de_de: Wenn du die Anzahl berechneter Hashes _und_ die Datenmenge verdoppelst, die jeder Hash verarbeiten muss, vervierfacht man effektiv die Gesamtzeit, die für das Hashen gebraucht wird.

source: The solution is to make the signatures in steps. Suppose you want to sign all four inputs of a transaction, as <<fig1026>> shows.
de_de: Die Lösung ist, die Signaturen schrittweise zu machen. Nimm an, du willst alle vier Inputs einer Transaktion signieren, wie in <<fig1026>> gezeigt.

source: Hashing is done in two steps. The intermediate hash is reused for each input.
de_de: Hashen wird in zwei Schritten erledigt. Der Zwischenhash wird für jeden Input wiederverwendet.

source: First you create an intermediate hash of the complete transaction. If the transaction contains non-segwit inputs, those signature scripts will be cleaned prior to hashing. The intermediate hash commits to all of that transaction’s inputs and outputs. Then, for each input, add the intermediate hash to some input-specific data:
de_de: Zuerst generierst du einen Zwischenhash der kompletten Transaktion. Wenn die Transaktion non-SegWit Inputs enthält, werden diese Signatur Scripts vor dem Hashen bereinigt. Der Zwischenhash bindet sich an alle Inputs und Outputs dieser Transaktion. Dann fügst du für jeden Input den Zwischenhash zu bestimmten Input-spezifischen Daten hinzu:

source: _Spent outpoint_—The txid and index of the output this input spends
de_de: _Spent Outpoint_—Die txid und der Index des Outputs, den dieser Input ausgibt

source: _Spent script_—The witness script or p2wpkh script corresponding to the spent output
de_de: _Spent Script_—Das Witness Script oder p2wpkh Script, das zu dem ausgegebenen Output gehört

source: _Spent amount_—The BTC value of the spent output
de_de: _Spent Amount_—Der Wert an BTC des ausgegebenen Outputs

source: Old hashing
de_de: Altes Hashing

source: The bulk of the transaction is hashed only once to create the intermediate hash. This drastically reduces the amount of hashing needed. When the number of inputs doubles, the needed amount of hashing only doubles. This makes the hashing algorithm perform _linearly with the number of inputs_ instead of _quadratically_. The time to verify the transaction with 1,024 inputs discussed in <<fig1007>> is reduced from 262,144 ms to 512 ms.
de_de: Der Grossteil der Transaktion wird nur einmal gehasht, um einen Zwischenhash zu erzeugen. Das reduziert den für das Hashen benötigten Aufwand drastisch. Wenn die Anzahl Inputs sich verdoppelt, verdoppelt sich lediglich der benötigte Aufwand für das Hashen. Das lässt den den Aufwand des Hash-Algorithmus _linear mit der Anzahl Inputs_ wachsen anstatt quadratisch. Die Zeit, eine Transaktion mit 1.024 Inputs zu verifizieren, wie es in <<fig1007>> besprochen wurde, wird von 262.144 ms auf 512 ms verringert.

source: Signature commits to amount
de_de: Die Signatur bindet sich an den Betrag

source: Why do we include the spent amount? We didn’t do that in the old signature-hashing algorithm. This has nothing to do with hashing efficiency, but it fixes yet another problem that offline wallets and some lightweight wallets face.
de_de: Warum nehmen wir den ausgegebenen Betrag mit dazu? Das haben wir im alten Signatur-Hashverfahren nicht getan. Das hat nichts mit der Hash-Effizienz zu tun, sondern behebt ein weiteres Problem, mit dem offline Wallets und einige Lightweight Wallets konfrontiert sind.

source: A _hardware wallet_ is an electronic device designed to keep private keys safe. Unsigned transactions are sent to the device for signing. The device usually requires a PIN code to sign.
de_de: Ein _Hardware Wallet_ ist ein elektronisches Gerät, das zum gesicherten Aufheben von private Keys entworfen wurde. Unsignierte Transaktionen werden zur Signatur an das Gerät geschickt. Das Gerät benötigt normalerweise einen PIN Code zum Signieren.

source: An offline wallet—for example, a hardware wallet—can’t know how much money is being spent. If the offline wallet is to sign a transaction, the wallet can’t display the transaction’s fee amount to the user because it can’t see the values of the outputs it’s spending (<<fig1027>>). It has no access to the blockchain.
de_de: Ein offline Wallet–zum Beispiel ein Hardware Wallet–kann nicht wissen, wie viel Geld ausgegeben wird. Wenn das offline Wallet eine Transaktion signieren soll, kann es dem Benutzer die Gebührenhöhe der Transaktion nicht anzeigen, da es die Werte der Outputs, die die Transaktion ausgibt, nicht sehen kann (<<fig1027>>). Es hat keinen Zugang zur Blockchain.

source: An offline wallet can’t know a transaction’s fee.
de_de: Ein offline Wallet kann die Transaktionsgebühr nicht kennen.

source: This is true for both non-segwit and segwit transactions. But with segwit transactions, when the signatures commit to the spent output amounts, the wallet must get the amounts from somewhere to be able to sign. Suppose the input amounts are somehow provided to the offline wallet, alongside the transaction to sign. The wallet can then sign the transaction using those amounts and even show the user what fee is being paid before signing.
de_de: Das gilt sowohl für SegWit als auch für non-SegWit Transaktionen. Da sich bei SegWit Transaktionen die Signaturen aber an die ausgegebenen Beträge binden, muss das Wallet die Beträge von irgendwoher bekommen, um signieren zu können. Angenommen, die Inputbeträge werden dem offline Wallet irgendwie übermittelt, zusammen mit der zu signierenden Transaktion. Dann kann das Wallet die Transaktion mit Hilfe dieser Beträge signieren, und sogar dem Benutzer anzeigen, welche Fee bezahlt wird, bevor es signiert.

source: If the offline wallet receives the wrong amount, it won’t be able to tell. It can’t verify the input values. But because the signatures now cover the amounts, the transaction will be invalid. A verifying node will know the correct amounts and use them when verifying the signatures. The signature check will fail. The new signature hashing algorithm makes it impossible to trick a wallet into signing a valid transaction with a fee the user didn’t intend.
de_de: Wenn das offline Wallet den falschen Betrag übermittelt bekommt, kann es das nicht feststellen. Es kann ja die Inputwerte nicht überprüfen. Aber weil die Signaturen sich jetzt an die Beträge binden, wäre dann die Transaktion ungültig. Denn ein verifizierender Node kennt die korrekten Beträge und benutzt diese beim Verifizieren der Signaturen. Der Signaturcheck wird scheitern. Der neue Signaturhashing-Algorithmus macht es also unmöglich, ein Wallet dazu zu bringen, eine gültige Transaktion mit einer Gebühr zu signieren, die der Benutzer nicht wollte.

source: Bandwidth savings
de_de: Bandbreitenersparnisse

source: Segwit removes the signature data from the transaction, so when a lightweight wallet requests a transaction from a full node, the full node can send the transaction without the witness data. This means less data traffic is needed per transaction. This fact can be used to either
de_de: SegWit entfernt die Signaturdaten aus der Transaktion, sodass immer dann, wenn ein Lightweight Wallet eine Transaktion von einem Full Node anfordert, der Full Node die Transaktion ohne die Witness Daten schicken kann. Das bedeutet, pro Transaktion wird weniger Datenvolumen verbraucht. Diese Tatsache kann verwendet werden, um entweder

source: Keep the bloom filter size as is and get about 50% reduction in data traffic
de_de: Behalte die Grösse des Bloom Filter bei und erhalte eine Einsparung im Datenvolumen von etwa 50%.

source: Improve privacy by decreasing the size of the bloom filter to get more false positives without increasing data traffic
de_de: Die Privacy zu verbessern, indem die Grösse des Bloom Filters verringert wird, um mehr Fehltreffer zu erzeugen, ohne mehr Datenvolumen zu verbrauchen

source: Upgradable script
de_de: Upgradebares Script

source: The version byte is used for future script language upgrades. Before segwit, we had to use the ``OP_NOP``s to introduce new features to the language—for example, `OP_CSV`. This wasn’t optimal for the following reasons:
de_de: Das Versionsbyte wird für künftige Scriptsprachen-Upgrades benutzt. Vor SegWit mussten wir ``OP_NOP``s benutzen, um der Sprache neue Features hinzuzufügen–zum Beispiel `OP_CSV`. Das war aus folgenden Gründen nicht optimal:

source: We might run out of ``OP_NOP``s—there are eight left.
de_de: Irgendwann haben wir keine ``OP_NOP``s mehr—es gibt nur noch acht.

source: The ``OP_NOP``s can’t be redefined in arbitrary ways; they still need to behave as ``OP_NOP``s in case the new behavior succeeds.
de_de: Die ``OP_NOP``s können nicht beliebig umdefiniert werden; sie müssen sich immer noch so benehmen wie ``OP_NOP``s, wenn das neue Verhalten erfolgreich ist.

source: The version byte allows for much more powerful future upgrades. We can do anything from slight modifications of specific operators to implementing completely new languages.
de_de: Das Versionsbyte erlaubt viel leistungsfähigere zukünftige Upgrades. Wir können alles machen, von leichten Modifikationen bestimmter Operatoren bis zur Implementation vollständig neuer Sprachen.

source: Wallet compatibility
de_de: Wallet Kompatibilität

source: Most old wallets won’t support sending bitcoin to a segwit address. They usually only allow p2pkh and p2sh addresses. So segwit’s developers created _p2wsh nested in p2sh_ and _p2wpkh nested in p2sh_: ways to trigger the segwit verification instead of the legacy script verification.
de_de: Die meisten alten Wallet werden das Senden von bitcoin an eine SegWit Adresse nicht unterstützen. Sie erlauben normalerweise nur p2pkh und p2sh Adressen. Daher haben die SegWit Entwickler zwei Wege geschaffen, die SegWit Verifikation anstelle der herkömmlichen Verifikation auszulösen: _p2wsh eingebettet in p2sh_ und _p2wsh eingebettet in p2wpkh_.

source: Suppose you have a segwit wallet and want to sell your popcorn machine to your neighbor, Nina. But Nina doesn’t have a segwit-aware wallet. She can only pay to ordinary addresses, like p2pkh and p2sh. You can make a p2sh address that Nina can pay to (<<fig1028>>).
de_de: Angenommen, du hast ein SegWit Wallet und willst deine Popcornmaschine an deinen Nachbarn Nina verkaufen. Aber Nina hat kein SegWit-fähiges Wallet. Sie kann nur an normale Adressen zahlen, wie p2pkh und p2sh. Du kannst aber eine p2sh Adresse machen, an die Nina zahlen kann (<<fig1028>>).

source: Nina sends 0.1 BTC to your segwit wallet using a p2wpkh inside a p2sh address.
de_de: Nina schickt 0,1 BTC an dein SegWit Wallet mit Hilfe einer in p2sh eingebetteten p2wpkh Adresse.

source: Nina pays to `3KsJCgA6…k2G6C1Be`, which is an old-style p2sh address that contains the hash of the redeem script `00 bb4d4977…75ff02d1`. This redeem script is a version byte `00` followed by a 20-byte witness program. This is the pattern for p2wpkh, which we covered earlier. Nina’s wallet knows nothing about this. It sees only a p2sh address and makes a payment to that script hash.
de_de: Nina bezahlt an `3KsJCgA6…k2G6C1Be`, was eine klassische p2sh Adresse ist, die den Hash des Redeem Scripts `00 bb4d4977…75ff02d1` enthält. Dieses Redeem Script ist ein Versionsbyte `00`, gefolgt von einem 20 Byte Witness Programm. Es entspricht damit dem Muster für p2wpkh, das wir vorher besprochen haben. Ninas Wallet weiss davon nichts. Es sieht nur eine p2sh Adresse und führt eine Zahlung an diesen Script Hash aus.

source: Later, when you want to spend your output, you create a transaction like the one in <<fig1029>>.
de_de: Später, wenn du deinen Output ausgeben willst, erzeugst du eine Transaktion wie die in <<fig1029>>.

source: You spend the money you got from Nina by setting the version byte and witness program in the redeem script in your input’s signature script.
de_de: Du gibst das von Nina erhaltene Geld aus, indem du das Versionsbyte und Witness Programm als Redeem Script in das Signatur Script deines Inputs einträgst

source: You create a witness, just as you would with a normal p2wpkh input, but you also set the redeem script as a single data item in the signature script. The redeem script happens to be a version byte followed by your 20-byte PKH. Using this signature script, old nodes can verify that the script hash in the spent output matches the hash of the redeem script in the signature script. New nodes will detect that the redeem script is a version byte and a witness program, and verify the witness accordingly.
de_de: Du generierst einen Witness, so wie du es mit einem normalen p2wpkh Input tun würdest, aber du legst das Redeem Script als einzelnes Datenobjekt in das Signatur Script. Das Redeem Script ist zufällig ein Versionsbyte `00` gefolgt von deinem 20 Byte PKH. Mit diesem Signatur Script können alte Nodes verifizieren, das der Script Hash im ausgegebenen Output zu dem Hash des Redeem Scripts im Signatur Script passt. Neue Nodes erkennen, dass das Redeem Script ein Versionsbyte und ein Witness Programm ist, und verifizieren den Witness entsprechend.

source: This way of nesting a segwit payment inside a p2sh payment can also be used for p2wsh payments in a similar fashion: a p2wsh nested in p2sh.
de_de: Diese Art der Einbettung von SegWit Zahlungen in p2sh Zahlungen kann auf ähnliche Weise auch für p2wsh Zahlungen benutzt werden: ein p2wsh eingebettet in p2sh.

source: Recap of payment types
de_de: Zusammenfassung der Zahlungsarten
