Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: In a _user-activated soft fork_, users start enforcing the rules on a specific day (or block height). A standard for this is being developed as of this writing, and it will probably be a hybrid of BIP9 and user-activated soft fork.
de_de: Bei einer _User Activated Soft Fork_ fangen die User ab einem bestimmten Tag (oder einer bestimmten Block Height) an, die neuen Regeln anzuwenden. Ein Standard dafür wird zum Zeitpunkt des Schreibens gerade erarbeitet, und wird wahrscheinlich ein Hybrid aus BIP9 und User Activated Soft Fork werden.

source: The difference from a pure BIP9 deployment is that the user-activated soft fork process is guaranteed to proceed to `ACTIVE` once the node has entered the `STARTED` state. In the `STARTED` state, miners have a chance to move the deployment to a `LOCKED_IN` state; but if they don’t, and the timeout has passed, then the supporting full nodes (including miners that support the upgrade) will start enforcing the rules anyway.
de_de: Der Unterschied zu einem reinen BIP9 Deployment ist, dass die User Activated Soft Fork Prozess garantiert in den `ACTIVE` Zustand übergeht, wenn der Node einmal in den `STARTED` Zustand geht. Im `STARTED` Zustand haben Miner die Chance, das Deployment in einen `LOCKED_IN` Zustand zu befördern; aber wenn sie das nicht tun, und der Timeout abgelaufen ist, dann fangen die unterstützenden Full Nodes (und die Miner, die den Upgrade unterstützen) trotzdem damit an, die Regeln durchzusetzen.

source: A user-activated soft fork was used to deploy BIP16, p2sh, but it was done manually. Other than this, the community has no real-world experience with user-activated soft forks.
de_de: Eine User Activated Soft Fork wurde benutzt, um BIP16, p2sh, auszurollen, aber das wurde manuell erledigt. Abgesehen davon hat die Gemeinde keine Erfahrung mit User Activated Soft Forks.

source: A soft fork is a change of the consensus rules, but what characterizes the changes made in a soft fork?
de_de: Eine Soft Fork ist eine Änderung der Konsensregeln, aber was charakterisiert die Änderungen, die in einer Soft Fork gemacht werden?

source: Suppose a hard fork causes a blockchain split, and the New branch has 51% of the hashrate. Furthermore, suppose the hashrate on the New branch drops to about 45%.
de_de: Angenommen, eine Hard Fork verursacht einen Blockchain Split, und der NEU Zweig hat 51% der Hashrate. Nimm ausserdem an, dass die Hashrate auf dem NEU Zweig auf ungefähr 45% absinkt.

source: What event will eventually happen?
de_de: Was wird irgendwann passieren?

source: Why did I say that the event will _eventually_ happen? When does the event occur?
de_de: Warum habe ich gesagt, das Ereignis wird _eventuell_ passieren? Wann passiert es?

source: What can the developers of Bitcoin New do to prevent the event from happening?
de_de: Was können die Entwickler von Bitcoin NEU tun, um das Ereignis zu verhindern?

source: Suppose an Old node causes a blockchain split due to a soft fork in which 80% of the hashrate runs Bitcoin New. Will the Old branch of the split last long? Explain your answer.
de_de: Angenommen, ein ALT Node verursacht einen Blockchain Split wegen einer Soft Fork, bei der 80% der Hashrate Bitcoin NEU benutzt. Wird der ALT Zweig des Splits lange überleben? Erläutere deine Antwort.

source: Suppose you try to deploy a soft fork using BIP9. Your deployment has just reached the `LOCKED_IN` state. How long do you have to wait before your rules start being enforced?
de_de: Angenommen, du versuchst, eine Soft Fork mittels BIP9 auszurollen. Dein Deployment hat gerade den `LOCKED_IN` Zustand erreicht. Wie lange musst du warten, bevor deine Regeln anfangen durchgesetzt zu werden?

source: Suppose a fork changes the consensus rules such that Old nodes can create blocks invalid to New nodes, and New nodes can create blocks invalid to Old nodes.
de_de: Angenommen, eine Fork ändert die Konsensregeln so, dass ALT Nodes Blocks erzeugen können, die für NEU Nodes ungültig sind, und NEU Nodes können Blocks produzieren, die für ALT Nodes ungültig sind.

source: What nodes (New, Old, both, or none), would be able to cause a blockchain split when this fork is deployed?
de_de: Welche Nodes (NEU, ALT, beide oder keine) könnten einen Blockchain Split verursachen, wenn diese Fork ausgerollt wird?

source: Why is it desirable to have a reassuring majority of the hashrate supporting Bitcoin New in a soft fork before starting to enforce the New rules?
de_de: Warum ist es wünschenswert, eine beruhigende Mehrheit der Hashrate zu haben, die Bitcoin NEU bei einer Soft Fork unterstützt, bevor man damit anfängt, die neuen Regeln durchzusetzen?

source: Suppose a hard fork has caused a permanent blockchain split and you’re about to make a payment using Bitcoin New. Why is replay protection desirable in this scenario?
de_de: Angenommen, eine Hard Fork hat einen dauerhaften Blockchain Split verursacht und du bist dabei, eine Zahlung mittels Bitcoin NEU durchzuführen. Warum ist Replay Protection in diesem Fall wünschenswert?

source: Suppose you want to deploy a soft fork using BIP9 with the following parameters:
de_de: Angenommen, du willst eine Soft Fork mittels BIP9 ausrollen mit folgenden Parametern:

source: bit: 12 start time: 2027-01-01 00:00:00 timeout: 2028-01-01 00:00:00
de_de: Bit: 12 Startzeit: 2027-01-01 00:00:00 Timeout: 2028-01-01 00:00:00

source: Also assume that the deployment is in `STARTED` state, all 2016 blocks in the current retarget period have been mined, and all of them signal support using bit 12. The last (2016th) block, B~1~, in the current retarget period has the following properties:
de_de: Weiter angenommen, dass das Deployment im `STARTED` Zustand ist, alle 2016 Blocks in der aktuellen Retarget Periode produziert worden sind, und alle Blocks Unterstützung mittels Bit 12 signalisieren. Der letzte (2016te) Block, B~1~, in der aktuellen Retarget Periode hat folgende Eigenschaften:

source: Will this deployment eventually get to the `ACTIVE` state?
de_de: Wird dieses Deployment irgendwann in den Zustand `ACTIVE` gehen?

source: Suppose you want to make a user-activated soft fork. You find it hard to convince other users to install your software. What would happen on the flag day if just a small percentage (<30%) of the economy chose to run your software?
de_de: Angenommen, du willst eine User Activated Soft Fork machen. Du findest es schwer, andere User zur Benutzung deiner Software zu überzeugen. Was würde am Flag Day passieren, wenn nur ein kleiner wirtschaftlicher Prozentsatz (<30%) deine Software ausführen würde?

source: Suppose you want to make a user-activated soft fork. Lots of other users seem to like your soft fork. Say that 80% of the economy installs your fork. Why would miners (even those that don’t like your change) probably switch to the New rules during this user-activated soft fork?
de_de: Angenommen, du willst eine User Activated Soft Fork machen. Viele andere Nutzer scheinen deine Soft Fork zu mögen. Sagen wir, 80% der Wirtschaft installiert deine Fork. Warum werden Miner (auch diejenigen, denen Ihre Änderung nicht gefällt) während dieser vom Benutzer aktivierten Soft Fork wahrscheinlich zu den neuen Regeln wechseln?

source: In the previous exercise, your soft fork had support from 80% of the economy. Suppose also that a majority of the hashrate decides to follow your New rules. What happens with the nonmining nodes that don’t run your fork?
de_de: In der vorangegangenen Übung hatte deine Soft Fork eine Unterstützung von 80% der Wirtschaft. Nimm ausserdem an, dass eine Mehrheit der Hashrate beschliesst, deinen NEU Regeln zu folgen. Was passiert mit nicht-minenden Nodes, die deiner Fork nicht folgen?

source: You don’t want a blockchain split when deploying a fork because this would cause disruption in the Bitcoin economy.
de_de: Du willst keinen Blockchain Split beim Ausrollen einer Fork, weil das eine Störung in der Bitcoin Wirtschaft bedeuten würde.

source: A hard fork is a consensus rule change that requires every miner to upgrade. Otherwise, the blockchain will split.
de_de: Eine Hard Fork ist eine Änderung der Konsensregeln, die jeden Miner zum Upgrade zwingt. Ansonsten erfolgt ein Blockchain Split.

source: A soft fork is a consensus rule change that doesn’t require simultaneous upgrade of the entire network.
de_de: Eine Soft Fork ist eine Änderung der Konsensregeln, die kein gleichzeitiges Upgrade des gesamten Netzwerks verlangt.

source: During a blockchain split due to a hard fork, you want wipeout protection to make sure the New branch isn’t reorged by Old nodes.
de_de: Während eines Blockchain Splits wegen einer Hard Fork möchtest du Wipeout Protection haben, um sicherzustellen, dass der NEU Zweig nicht von den ALT Nodes weg reorganisiert wird.

source: In a blockchain split, you want replay protection to let you select what branch your transactions are applied to.
de_de: Bei einem Blockchain Split möchtest du Replay Protection, um den Zweig auswählen zu können, auf dem deine Transaktionen durchgeführt werden.

source: A miner-activated soft fork—for example, one using BIP9 for deployment—lets miners deploy a noncontroversial soft fork.
de_de: Eine Miner-activierte Soft Fork–zum Beispiel, eine die BIP9 zum Ausrollen benutzt–lässt Miner eine nicht kontroverse Soft Fork ausrollen.

source: A user-activated soft fork lets users enforce a soft fork deployment. If a hashrate majority eventually follows, the soft fork succeeds without a lasting blockchain split.
de_de: Eine User Activated Soft Fork lässt User eine Soft Fork ausrollen. Wenn eine Hashrate Mehrheit irgendwann folgt, ist die Soft Fork ohne bleibenden Blockchain Split erfolgreich.

source: Using bitcoin-cli
de_de: Benutzung von bitcoin-cli

source: This appendix continues from <<run-your-own-full-node>>. I’ll show you how to set up a Bitcoin wallet, receive and send bitcoins, and explore the Bitcoin blockchain using `bitcoin-cli`, Bitcoin Core’s command-line tool.
de_de: Dieser Anhang führt <<run-your-own-full-node>> weiter. Ich zeige dir, wie du ein Bitcoin Wallet aufsetzt, bitcoin empfängst und verschickst, und die Blockchain mit dem `bitcoin-cli` Kommandozeilen Tool erforschst.

source: Note that this appendix won’t go into great depth on `bitcoin-cli`. This should only be regarded as a source of inspiration; it will provide you with the basics to get started. You’re encouraged to explore further.
de_de: Beachte, dass dieser Anhang `bitcoin-cli` nicht in grosser Tiefe behandelt. Er sollte nur als Quelle der Inspiration verstanden werden; er wird dich mit den Grundlagen ausstatten, damit du anfangen kannst. Ich ermuntere dich ausdrücklich, weiter herum zu forschen.

source: Communicating with bitcoind
de_de: Kommunikation mit bitcoind

source: When `bitcoind` starts, it also starts a web server that listens on TCP port 8332 by default. When you use `bitcoin-cli`, it will connect to the web server, send your command to the web server over HTTP, and display relevant parts of the response to you.
de_de: Wenn `bitcoind` startet, startet es auch einen Web Server, der defaultmässig auf TCP Port 8332 horcht. Wenn du `bitcoin-cli` benutzt, verbindet der sich an diesen Web Server schickt dein Kommando an ihn über HTTP, und zeigt dir relevante Teile der Antwort an.

source: For example, suppose I want to know the block ID of the genesis block (the block at height 0), and I issue the following command:
de_de: Zum Beispiel angenommen, du willst die Block ID des Genesis Blocks (Block an Height 0) wissen, und schickst das folgende Kommando ab:

source: `bitcoin-cli` creates an HTTP `POST` request with the body
de_de: `bitcoin-cli` erzeugt einen HTTP `POST` Request mit dem Body

source: and sends it to the web server that `bitcoind` runs. The request body’s `method` property is the command you want to execute, and the argument `0` is passed to the web server as an array with a single element.
de_de: und schickt ihn an den Web Server, den `bitcoind` laufen lässt. Die `method` Property des Request-Inhalts ist das Kommando, das du ausführen willst, und das Argument `0` wird an den Web Server als Array mit einem einzelnen Element übergeben.

source: The web server processes the HTTP request by looking up the block hash in the blockchain and replies with an HTTP response with the following body:
de_de: Der Web Server arbeitet den HTTP Request ab, indem er in der Blockchain den Block Hash nachschaut, und antwortet mit einer HTTP Antwort mit dem folgenden Body:

source: `bitcoin-cli` then displays the value of the `result` property on the terminal:
de_de: `bitcoin-cli` zeigt dann den Wert der `result` Property auf dem Terminal an:

source: This body of the HTTP request follows a standard called JSON-RPC, which describes how a client can call functions on a remote process using JavaScript Object Notation (JSON).
de_de: Dieser Body des HTTP Requests folgt einem Standard namens JSON-RPC, der beschreibt, wie ein Client Funktionen auf einem Remote Prozess mittels JavaScript Object Notation (JSON) aufrufen kann.

source: Using curl
de_de: Benutzung von curl

source: Because the communication with `bitcoind` happens through `HTTP`, any program that can send `HTTP POST` requests, such as the command-line tool `curl`, can be used to communicate with `bitcoind`. But to use tools other than `bitcoin-cli`, you need to set up a username and password to use as authentication to the web server.
de_de: Weil die Kommunikation mit `bitcoind` über HTTP geht, kann jedes Programm, das `HTTP POST` Requests schicken kann, wie das Kommandozeilen Tool `curl`, zum kommunizieren mit `bitcoind` benutzt werden. Aber um andere Tools als `bitcoin-cli` zu verwenden, musst du einen Usernamen und Passwort definieren, mit denen du dich gegenüber dem Web Server authentifizierst.

source: More parameters
de_de: Mehr Parameter

source: Bitcoin Core offers a lot of options. Run `./bitcoind --help` to get a complete list.
de_de: Bitcoin Core bietet eine Menge Optionen. Gib `./bitcoind --help` ein, um die vollständige Liste zu bekommen.

source: Stop the node with `./bitcoin-cli stop`. Open—or create, if it doesn’t exist—Bitcoin Core’s configuration file ~/.bitcoin/bitcoin.conf, and add these lines:
de_de: Stoppe den Node mit `./bitcoin-cli stop`. Öffnen oder erstelle die Konfigurationsdatei ~ / .bitcoin / bitcoin.conf von Bitcoin Core, falls diese nicht vorhanden ist, und füge die folgenden Zeilen hinzu:

source: After you’ve modified and saved the ~/.bitcoin/bitcoin.conf file, start your node using `./bitcoind -daemon`, to make the changes effective.
de_de: Nachdem du die Datei ~/.bitcoin/bitcoin.conf geändert und abgespeichert hast, starte deinen Node wieder mit `bitcoind -daemon`, um die Änderungen wirksam zu machen.

source: Here’s how I called `getblockhash` using `curl` (the backslash `\` character means the command continues on the next line):
de_de: So habe ich `getblockhash` mit `curl` aufgerufen (Das Backslash `\` Zeichen bedeutet, die Kommandozeile setzt sich auf der nächsten Zeile fort):

source: Remember to change the username from `kalle` to the username you configured in bitcoin.conf.
de_de: Denk daran, den Usernamen von `kalle` auf den Usernamen zu ändern, den du in bitcoind.conf konfiguriert hast.

source: This command will prompt you for the password. Enter the password, and press Enter. The reply from the web server will be the same as when you used `bitcoin-cli`, but you’ll need to scan through the response body to spot the result, which is the hash of block 0.
de_de: Das Kommando fordert zur Eingabe des Passworts auf. Gib das Passwort ein und drücke Enter. Die Antwort vom Webserver ist dieselbe wie bei Verwendung von "bitcoin-cli", du musst jedoch den Antworttext durchsuchen, um das Ergebnis zu erkennen, bei dem es sich um den Hash von Block 0 handelt.

source: Graphical user interface
de_de: Graphisches User Interface

source: Bitcoin Core comes with a graphical user interface (GUI). This appendix mainly deals with the command-line interface `bitcoin-cli` for controlling and querying your running `bitcoind`. But if you want to use Bitcoin Core as a Bitcoin wallet (and not just as a full node), it can be useful to familiarize yourself with the GUI version. The GUI version of Bitcoin Core lets you perform most common tasks expected from a Bitcoin wallet, but to access Bitcoin Core’s full set of features, you’ll need to use `bitcoin-cli`.
de_de: Bitcoin Core kommt mit einem grafischen User Interface (GUI). Dieser Anhang beschäftigt sich hauptsächlich mit dem Kommandozeilen-Interface `bitcoin-cli` zur Kontrolle und Abfrage deines laufenden `bitcoind`. Aber wenn du Bitcoin Core als Bitcoin Wallet benutzen willst (und nicht nur als Full Node), dann kann es nützlich sein, sich mit dem GUI vertraut zu machen. Die GUI Version von Bitcoin Core lässt dich die meisten gängigen Aufgaben erledigen, die von einem Bitcoin Wallet erwartet werden, aber um den vollen Satz an Features von Bitcoin Core zu benutzen, musst du `bitcoin-cli` verwenden.

source: To use the GUI version of Bitcoin Core, you need to stop the current node and start the GUI version, called `bitcoin-qt`:
de_de: Um die GUI Version von Bitcoin Core zu benutzen, musst du den laufenden Node stoppen und die GUI Version starten, die `bitcoin-qt` heisst.

source: Why -qt?
de_de: Warum -qt?

source: The Bitcoin Core GUI is built using a GUI programming library called QT. Hence the name, `bitcoin-qt`.
de_de: Das Bitcoin Core GUI wurde mit einer GUI Programmierbibliothek geschrieben, die QT heisst. Daher der Name `bitcoin-qt`.

source: If `bitcoind` didn’t have time to finish shutting down before you started `bitcoin-qt`, you’ll get an error message from `bitcoin-qt`. If so, click OK and try running `./bitcoin-qt &` again in a few seconds.
de_de: Wenn `bitcoind` nicht genügend Zeit zum Herunterfahren hatte, bevor du `bitcoin-qt` gestartet hast, bekommst du eine Fehlermeldung von `bitcoin-qt`. In diesem Fall, klicke auf OK und versuche es damit, `./bitcoin-qt &` in ein paar Sekunden nochmal zu starten.

source: `bitcoin-qt` uses the same data directory, ~/.bitcoin/, as `bitcoind`, which means `bitcoin-qt` will use the already downloaded and verified blockchain and the same wallet as `bitcoind`. It’s just the user interface that differs.
de_de: `bitcoin-qt` benutzt dasselbe Datenverzeichnis, ~/.bitcoin/, wie `bitcoind`, was bedeutet, `bitcoin-qt` wird die bereits heruntergeladene und verifizierte Blockchain und dasselbe Wallet wie `bitcoind` benutzen. Es ist nur das User Interface, das anders ist.

source: By default, `bitcoin-qt` won’t start the web server to accept JSON-RPC requests as `bitcoind` does. To use `bitcoin-cli` with `bitcoin-qt`, start `bitcoin-qt` as follows, instead:
de_de: Per Default wird `bitcoin-qt` den Web Server zum Akzeptieren von JSON-RPC Requests nicht starten, so wie `bitcoind` das tut. Um `bitcoin-cli` zu verwenden, starte `bitcoin-qt` stattdessen wie folgt:

source: Getting to know bitcoin-cli
de_de: bitcoin-cli kennenlernen

source: You’ve started Bitcoin Core in the background by running
de_de: Du hast Bitcoin Core im Hintergrund gestartet, indem du eingegeben hast

source: The most important command to know is the `help` command. Run it without any arguments to get a list of all available commands:
de_de: Das wichtigste Kommando, das man kennen muss, ist das `help` Kommando. Starte es ohne Argumente, um eine Liste aller möglichen Kommandos zu bekommen:

source: You’ll get a long list of commands grouped by subject—for example, `Blockchain`, `Mining`, and `Wallet`. Some commands are self-explanatory, but if you want to know more about a specific command, you can run `help` with the command name as an argument. For example:
de_de: Dir wird eine lange Liste von Kommandos angezeigt, die nach Thema gruppiert sind–zum Beispiel `Blockchain`, `Mining` und `Wallet`. Einige Kommandos sind selbsterklärend, aber wenn du mehr über ein bestimmtes Kommando wissen willst, kannst du `help` mit dem Kommandonamen als Argument eingeben, zum Beispiel:

source: You can invoke `bitcoin-cli` in two ways:
de_de: Du kannst `bitcoin-cli` auf zwei Arten aufrufen:

source: _Using positional arguments_—The meanings of the arguments are based on their relative positions: for example, `./bitcoin-cli getblockhash 1000`. This is the most common way to use `bitcoin-cli.`
de_de: _Mit Positions-Argumenten_–Die Bedeutungen der Argumente basieren auf deren relativer Position: zum Beispiel `./bitcoin-cli getblockhash 1000`. Dies ist der gängigste Weg, `bitcoin-cli` zu verwenden.

source: _Using named arguments_—The arguments are named on the command line: for example, `./bitcoin-cli -named getblockhash height=1000`. This is sometimes useful when the command takes optional arguments and you want to specify the second optional argument but not the first. You’ll see examples later.
de_de: _Mit benannten Argumenten_–Die Argumente werden auf der Kommandozeile namentlich genannt: zum Beispiel `./bitcoin-cli -named getblockhash height=1000`. Das ist manchmal nützlich, wenn das Kommando optionale Argumente nimmt, und du das zweite optionale Argument angeben willst, aber nicht das erste. Du wirst später Beispiele dazu sehen.

source: Getting to work
de_de: An die Arbeit

source: Let’s create an encrypted wallet and back it up. You’ll then receive some bitcoins and pass that money on to another address while dissecting the transactions for details—all using `bitcoin-cli`.
de_de: Erzeugen wir ein verschlüsseltes Wallet und machen ein Backup davon. Dann bekommst du etwas bitcoin und gibst das Geld an eine andere Adresse weiter, während wir die Details der Transaktionen auseinandernehmen–alles mit `bitcoin-cli`.

source: Creating an encrypted wallet
de_de: Erzeugen eines verschlüsselten Wallets

source: When `bitcoind` (or `bitcoin-qt`) starts, it will automatically create a wallet for you and store it in the file ~/.bitcoin/wallet.dat. But this wallet isn’t encrypted, which means its private keys and its seed, used to derive key pairs as discussed in <<ch04>>, are stored in the clear on your hard drive. Let’s look at some data for such a wallet:
de_de: Wenn `bitcoind` (oder `bitcoin-qt`) startet, erzeugt es automatisch ein Wallet und speichert es in der Datei ~/.bitcoin/wallet.dat. Aber dieses Wallet ist nicht verschlüsselt, was bedeutet, die private Keys darin und der Seed, der wie in <<ch04>> besprochen zur Ableitung von Keypaaren dient, werden im Klartext auf deiner Festplatte gespeichert. Schauen wir uns ein paar Daten zu solch einem Wallet an:

source: The output from the `getwalletinfo` command shows various information about the wallet currently being used. This automatically created wallet is unnamed, which is why `walletname` is empty.
de_de: Der Output des Befehls "getwalletinfo" zeigt verschiedene Informationen zu der aktuell verwendeten Wallet an. Diese automatisch erstellte Wallet ist unbenannt, weshalb "walletname" leer ist.

source: `balance` is how many confirmed bitcoins you have (including unconfirmed outgoing transactions), and `unconfirmed_balance` is the sum of incoming unconfirmed payments. `immature_balance` is relevant only for miners and denotes the number of newly created bitcoins, which can’t be spent until after 100 blocks passed. Refer to the help section on `getwalletinfo` for more details about the output.
de_de: `balance` ist die Summe der bestätigten bitcoins, die du hast (einschliesslich unbestätigten ausgehenden Transaktionen), und `unconfirmed_balance` ist die Summe der eingehenden Zahlungen. `immature_balance` ist nur für Miner relevant und gibt die Anzahl neu erzeugter bitcoins an, die nicht vor Ablauf von 100 Blocks ausgegeben werden können. Schaue in den Hilfeabschnitt über `getwalletinfo` für mehr Details zum Output.
