Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: The fee merkle root can be placed in the right branch under the witness commitment. But you also need to put the fee merkle root in the witness for the coinbase input so that old segwit nodes can verify the witness root hash.
de_de: Der Fee Merkle Root kann in den rechten Zweig unter das Witness Commitment gehängt werden. Aber du musst den Fee Merkle Root auch in den Witness für den Coinbase Input einbetten, sodass alte SegWit Nodes den Witness Root Hash verifizieren können.

source: An old segwit node will verify the block exactly as before. The witness reserved value will be taken from the witness of the coinbase input. Using the hash from the witness lets the old node build the witness commitment and compare it with the hash in the `OP_RETURN` output, but it won’t know that the witness reserved value is a fee merkle root. Old nodes thus won’t be able to verify the fee merkle tree.
de_de: Ein alter SegWit Node wird den Block genau wie vorher verifizieren. Der Reservierte Witness Wert wird dem Witness im Coinbase Input entnommen. Mit dem Hash aus dem Witness kann der alte Node das Witness Commitment bauen und mit dem Hash im `OP_RETURN` Output vergleichen, aber er kann nicht feststellen, ob der Reservierte Witness Wert ein Merkle Root ist. Alte Nodes werden daher den Merkle Tree nicht verifizieren können.

source: A new node will do the same verification as an old node, but it will also calculate the fee merkle root and compare it to the hash in the coinbase’s witness.
de_de: Ein neuer Node führt dieselbe Verifikation durch wie ein alter, wird aber zusätzlich den Fee Merkle Root berechnen und mit dem Hash im Coinbase Witness vergleichen.

source: Chapter 11
de_de: Kapitel 11

source: A soft fork tightens the consensus rules. This means blocks created by Bitcoin New nodes are guaranteed to be accepted by Bitcoin Old nodes.
de_de: Ein Soft Fork engt die Konsensregeln ein. Das bedeutet, von Bitcoin NEU Nodes erzeugte Blocks werden von Bitcoin ALT Nodes garantiert akzeptiert.

source: The New branch will get wiped out by the Old branch.
de_de: Der NEU Zweig wird vom ALT Zweig ausgelöscht.

source: It will _eventually_ get wiped out when the Old branch catches up with the New branch and surpasses it. This can take quite a few blocks, depending on the initial deficit.
de_de: Er wird _irgendwann_ ausgelöscht, wenn der ALT Zweig zum NEU Zweig aufholt und ihn überholt. Das kann eine ganze Menge Blocks dauern, je nach dem initialen Defizit.

source: Bitcoin New could be equipped with wipeout protection—for example, by requiring that the first block in the split have a certain property that’s not valid in the Old chain. Bitcoin Cash, for example, required that the first block be > 1,000,000 bytes.
de_de: Bitcoin NEU könnte mit Wipeout Protection ausgerüstet werden–zum Beispiel durch erzwungene Eigenschaften des ersten Blocks im Split, die in der ALT Chain nicht gültig sind. Bitcoin Cash verlangte zum Beispiel, dass der erste Block > 1.000.000 Bytes ist.

source: No, it will be outperformed by the New branch, and the Old branch will pretty quickly be wiped out, or reorged.
de_de: Nein, er wird vom NEU Zweig überwältigt und der ALT Zweig wird ziemlich schnell ausgelöscht oder reorganisiert werden.

source: 2,016 blocks. The `LOCKED_IN` state is always one retarget period.
de_de: 2.016 Blocks. Der `LOCKED_IN` Zustand dauert immer eine Retarget Periode.

source: Both. Old nodes can create a block that’s not valid according to New nodes. Conversely, New nodes can create a block that’s not valid according to Old nodes.
de_de: Beide. ALT Nodes können einen Block erzeugen, der gemäss der NEU Regeln nicht gültig ist. Umgekehrt können NEU Nodes einen Block erzeugen, der auf den ALT Nodes nicht gültig ist.

source: If the New nodes don’t have a majority of the hashrate, the Old nodes can cause a lasting blockchain split. This would effectively result in two cryptocurrencies.
de_de: Wenn die NEU Nodes keine Mehrheit der Hashrate haben, können die ALT Nodes einen dauerhaften Blockchain Split verursachen. Das würde im Effekt zu zwei Kryptowährungen führen.

source: Replay protection is desirable because a transaction intended for one branch of the split shouldn’t risk ending up on the other branch.
de_de: Replay Protection ist wünschenswert, weil eine für einen Zweig des Splits gedachte Transaktion nicht Gefahr laufen sollte, auf dem anderen Zweig zu enden.

source: Yes. Suppose the 11 timestamps before B~1~, sorted by value, are
de_de: Ja. Angenommen, die 11 Timestamps vor B~1~, nach Wert sortiert, lauten

source: To calculate MTP~2~ of block B~2~ following B~1~, add T~1~ to this list. Because a timestamp of a block needs to be strictly later than the MTP of the block, T~1~ must be sorted to the right of MTP~1~ in the list. For example:
de_de: Um MTP~2~ von Block B~2~, der auf B~1~ folgt, zu berechnen, fügt man T~1~ dieser Liste hinzu. Weil der Timestamp eines Blocks strikt hinter der MTP des Blocks liegen muss, muss T~1~ in der Liste rechts von MTP~1~ einsortiert werden. Zum Beispiel:

source: You must also remove the timestamp of the block with lowest height from the list of timestamps. No matter what timestamp you remove, MTP~2~ will be either MTP~1~ (if you remove a timestamp to the right of it), or the timestamp immediately to the right of MTP~1~ (if you remove a timestamp to the left of it) which can be either g or T~1~:
de_de: Man muss ausserdem den Timestamp des Blocks mit der niedrigsten Height aus der Liste der Timestamps entfernen. Egal welchen Timestamp man entfernt, MTP~2~ wird entweder MTP~1~ sein (wenn man einen Timestamp rechts davon entfernt), oder der Timestamp direkt rechts von MTP~1~ (wenn man einen Timestamp links davon entfernt) was entweder g oder T~1~ sein kann:

source: If MTP~2~ = MTP~1~, then MTP~2~ < timeout because MTP~1~ < timeout.
de_de: Wenn MTP~2~ = MTP~1~, dann MTP~2~ < Timeout weil MTP~1~ < Timeout.

source: If MTP~2~ = g, then MTP~2~ ≤ T~1~ < timeout.
de_de: Wenn MTP~2~ = g, dann MTP~2~ ≤ T~1~ < Timeout.

source: If MTP~2~ = T~1~ then MTP~2~ < timeout because T~1~ < timeout.
de_de: Wenn MTP~2~ = T~1~, dann MTP~2~ < Timeout weil T~1~ < Timeout.

source: So, the MTP of B~2~ is less than timeout in all cases, and all blocks (>95%) of the last 2,016 blocks signal support, which means the deployment will move to `LOCKED_IN` and—2,016 blocks later—to `ACTIVE`.
de_de: Die MTP von B~2~ ist also in jedem Falle kleiner als der Timeout, und alle Blocks (>95%) der letzten 2.016 Blocks signalisieren Support, was bedeutet, das Deployment geht in `LOCKED_IN` über und—2.016 Blocks später—in `ACTIVE`.

source: A portion (<30%) of the economy starts rejecting blocks that don’t comply with your soft fork. This means you’ll cause a blockchain split that will remain as long as a majority of miners support the Old branch.
de_de: Ein Teil (<30%) der Wirtschaft beginnt, Blocks abzulehnen, die nicht den Regeln deines Soft Forks folgen. Das bedeutet, du verursachst einen Blockchain Split, der so lange bleibt, wie die Mehrheit der Miner den ALT Zweig unterstützt.

source: When most of the economy starts rejecting Old blocks, miners probably won’t want to mine Old blocks because the block rewards will become nearly worthless for them. It would be hard for miners to sell their Old coins on an exchange or pay for electricity with them. If they switch to mine New blocks instead, plenty of options exist for exchanging their block rewards for goods, services, or other currencies.
de_de: Wenn der Grossteil der Wirtschaft anfängt, ALT Blocks abzulehnen, werden Miner wahrscheinlich nicht weiter ALT Blocks minen, denn die Block Rewards werden fast wertlos. Es wäre schwer für die Miner, ihre ALT Coins auf einer Exchange zu verkaufen oder ihren Strom damit zu bezahlen. Schwenken sie ihre Produktion dagegen auf NEU Blocks über, haben sie eine Menge Optionen, ihre Block Rewards gegen Güter, Dienstleistungen und andere Währungen einzutauschen.

source: The nonmining users using Old software will automatically switch to the New branch once that branch is stronger than the Old branch. This is because, in a soft fork, the New branch is valid according to the Old software.
de_de: Die nicht minenden Benutzer, die die ALT Software benutzen, werden automatisch auf den NEU Zweig schwenken, sobald dieser stärker ist als der ALT Zweig. Das kommt daher, dass der NEU Zweig gemäss den ALT Regeln gültig ist.

source: Web resources
de_de: Web Ressourcen

source: Web resource {counter:webresourceid}
de_de: Web Ressource {counter:webresourceid}

source: Bitcoin source code repository, http://mng.bz/rBBj.
de_de: Bitcoin Quellcode Repository, http://mng.bz/rBBj.

source: Kalle Rosenbaum, source code for _Grokking Bitcoin_, http://mng.bz/qBO2.
de_de: Kalle Rosenbaum, Quellcode für _Grokking Bitcoin_, http://mng.bz/qBO2.

source: “Financial Inclusion Data / Global Findex,” The World Bank, 2014, http://mng.bz/Vqqx.
de_de: “Financial Inclusion Data / Global Findex,” Die Weltbank, 2014, http://mng.bz/Vqqx.

source: Bitcoin improvement proposals (BIPs), GitHub, http://mng.bz/OA0E.
de_de: Bitcoin Verbesserungsvorschläge (BIPs), GitHub, http://mng.bz/OA0E.

source: Choose Your Bitcoin Wallet, http://mng.bz/xJJ6.
de_de: Auswahlhilfe für Bitcoin Wallets, http://mng.bz/xJJ6.

source: Discussion of why double SHA256 is used in Bitcoin, Stack Exchange Cryptography, http://mng.bz/G2aO.
de_de: Discussion über die Gründe für SHA256 in Bitcoin, Stack Exchange Cryptography, http://mng.bz/G2aO.

source: Complete list of Script operators in Bitcoin, Bitcoin Wiki, http://mng.bz/A22Q.
de_de: Vollständige Liste der Script Operatoren in Bitcoin, Bitcoin Wiki, http://mng.bz/A22Q.

source: A blockchain explorer showing the ascii-art transaction discussed in <<ch09>>, http://mng.bz/J88Q.
de_de: Ein Blockchain Explorer, der die ASCII-Kunst Transaktion zeigt, die in <<ch09>> besprochen wird, http://mng.bz/J88Q.

source: Running a Full Node, http://mng.bz/2AAw.
de_de: Betrieb eines Full Node, http://mng.bz/2AAw.

source: Bitcoin Core download page, http://mng.bz/177R.
de_de: Bitcoin Core Downloadseite, http://mng.bz/177R.

source: Getting Started with Bitcoin, http://mng.bz/P885.
de_de: Anfangen mit Bitcoin, http://mng.bz/P885.
