Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: They create one transaction each (<<fig0911>>). John creates a Bitcoin transaction that spends 2 BTC. Fadime creates a Namecoin transaction that spends 100 NMC. They don’t broadcast their transactions yet.
de_de: Sie erzeugen jeder eine Transaktion (<<fig0911>>). John erzeugt eine Bitcoin Transaktion, die 2 BTC ausgibt. Fadime erzeugt eine Namecoin Transaktion, die 100 NMC ausgibt. Sie übermitteln ihre Transaktionen noch nicht.

source: John and Fadime create a contract transaction each. The redeem script of the p2sh output contains the contract details.
de_de: John und Fadime erzeugen jeweils eine Transaktion. Das Redeem Script des p2sh Outputs enthält die Vertragsdetails.

source: The output of John’s contract transaction can be spent in one of two ways:
de_de: Der Output von Johns Vertragstransaktion kann in einer von zwei Weisen ausgegeben werden:

source: By providing the pre-image of H and Fadime’s signature. John knows this pre-image—his secret number S from the conversation described earlier—but Fadime doesn’t.
de_de: Indem das Pre-Image von H und Fadimes Signatur mitgeliefert wird. John kennt dieses Pre-Image–die geheime Zahl S aus der vorhin beschriebenen Unterhaltung–aber Fadime kennt diese Zahl S nicht.

source: With John’s signature after 48 hours.
de_de: Mit Johns Signatur nach 48 Stunden.

source: Likewise, the output of Fadime’s contract transaction can be spent in one of two ways:
de_de: Ebenso kann der Output von Fadimes Transaktion auf zwei Arten ausgegeben werden:

source: By providing the pre-image of H and John’s signature
de_de: Durch Angabe des Pre-Images von H und Johns Signatur.

source: With Fadime’s signature after 24 hours
de_de: Mit Fadimes Signatur nach 24 Stunden.

source: The relative lock time is enforced by the script operator `OP_CHECKSEQUENCEVERIFY`. This operator ensures that the output of John’s contract transaction can’t be spent by John until 48 hours have passed since the contract transaction was confirmed. In Fadime’s contract transaction, the operator ensures that Fadime doesn’t spend the output until after 24 hours.
de_de: Die relative Lock Time wird durch den Script Operator `OP_CHECKSEQUENCEVERIFY` erzwungen. Der Operator stellt sicher, dass der Output von Johns Transaktion durch John nicht ausgegeben werden kann, bevor 48 Stunden nach Bestätigung der Vertragstransaktion vergangen sind. In Fadimes Vertragstransaktion garantiert der Operator, dass Fadime den Output nicht ausgibt, bevor 24 Stunden abgelaufen sind.

source: Fadime knows John has the secret number. If Fadime broadcasts her contract transaction now, John can take the money and not fulfill his part of the deal. For this reason, she won’t broadcast her transaction until she’s seen John’s transaction safely confirmed in the blockchain. Because Fadime doesn’t know the secret, S, John can safely broadcast his contract transaction without Fadime running away with the money.
de_de: Fadime weiss, dass John die Geheimzahl kennt. Wenn Fadime jetzt ihre Vertragstransaktion übermittelt, kann John das Geld nehmen und seinen Teil des Vertrags unerfüllt lassen. Deshalb sendet sie ihre Transaktion nicht, bis sie gesehen hat, dass Johns Transaktion sicher in der Blockchain bestätigt wurde. Weil Fadime die Geheimzahl S nicht kennt, kann John seine Vertragstransaktion beruhigt übermitteln, ohne dass Fadime sich das Geld schnappen kann.

source: John broadcasts his contract transaction. Remember that the output of the contract transaction in this example is a pay-to-script-hash (p2sh) output. The output contains a p2sh address that doesn’t say anything about this being John’s contract output. For Fadime to identify John’s contract transaction on the Bitcoin blockchain, she’ll construct the same redeem script as John created for his contract transaction and generate the p2sh address that John’s contract transaction paid to. She can then look for that p2sh address in the Bitcoin blockchain.
de_de: John übermittelt seine Vertragstransaktion. Denke daran, dass der Output der Vertragstransaktion in diesem Beispiel ein pay-to-script-hash (p2sh) Output ist. Der Output enthält eine p2sh Adresse, die nichts darüber sagt, dass dies Johns Vertragsoutput ist. Damit Fadime Johns Vertragstransaktion auf der Bitcoin Blockchain findet, wird sie dasselbe Redeem Script bauen, das John für seine Vertragstransaktion generiert hat, und erzeugt die p2sh Adresse, an die Johns Vertragstransaktion gezahlt hat. Sie kann dann in der Bitcoin Blockchain nach der p2sh Adresse schauen.

source: When Fadime finds that John’s transaction is confirmed, she broadcasts her own contract transaction. John waits until Fadime’s transaction is sufficiently confirmed on the Namecoin blockchain. Then, the actual swap happens in two steps. <<fig0912>> shows the first step.
de_de: Wenn Fadime sieht, dass Johns Transaktion bestätigt wurde, übermittelt sie ihre eigene Transaktion. John wartet, bis Fadimes Transaktion hinreichend tief in der Namecoin bestätigt wurde. Dann geschieht der eigentliche Tausch in zwei Schritten. <<fig0912>> zeigt den ersten Schritt.

source: The first step of the actual swap. John claims Fadime’s 100 NMC by revealing the secret S.
de_de: Der erste Schritt des eigentlichen Tauschgeschäfts. John holt sich Fadimes 100 NMC, indem er das Geheimnis S preisgibt.

source: John broadcasts his swap transaction. John’s swap transaction spends Fadime’s contract transaction output by providing S and his signature. Again, note that John is spending a p2sh output. This means the first thing that happens during script validation is that the redeem script John provided in the signature script will be hashed and compared to the hash in the pubkey script. The actual redeem script will then be run.
de_de: John übermittelt seine Swap Transaktion. Johns Swap Transaktion gibt Fadimes Vertragstransaktions Output aus, indem es das Geheimnis S und seine Signatur liefert. Beachte wieder, dass John einen p2sh Output ausgibt. Das bedeutet, dass während der Script-Validierung als erstes das Redeem Script, das John im Signatur Script geliefert hat, gehasht und mit dem Hash im Pubkey Script verglichen wird. Danach läuft das eigentliche Redeem Script.

source: We won’t go through the program in detail. But when the redeem script starts running, the stack will have `1` on top. This means `true` in Namecoin, just as in Bitcoin. This value will cause the program to run the part of the script that requires a pre-image and John’s signature. The other part isn’t run at all.
de_de: Wir gehen das Programm nicht detailliert durch. Aber wenn das Redeem Script zu laufen anfängt, liegt oben auf dem Stack eine `1`. Das bedeutet `true` in Namecoin ebenso wie in Bitcoin. Dieser Wert führt dazu, dass das Programm den Teil des Scripts laufen lässt, der das Pre-Image und Johns Signatur benötigt. Der andere Teil läuft überhaupt nicht ab.

source: The script will leave the stack with a `true` on top because John provides both required items in the correct order—his signature and the pre-image, `S`. He successfully claims his 100 NMC.
de_de: Das Script hinterlässt `true` auf dem Stack, weil John beide benötigten Objekte in der richtigen Reihenfolge geliefert hat–seine Signatur und das Pre-Image `S`. Er holt sich erfolgreich die 100 NMC.

source: As soon as Fadime sees John’s swap transaction on the Namecoin network, she can create her own swap transaction for the Bitcoin blockchain (<<fig0913>>).
de_de: Sobald Fadime Johns Swap Transaktion auf dem Namecoin Netzwerk sieht, kann sie ihre eigene Swap Transaktion für das Bitcoin Netzwerk erzeugen (<<fig0913>>).

source: Fadime completes the atomic swap by sending her swap transaction to the Bitcoin network.
de_de: Fadime komplettiert den Atomic Swap, indem sie ihre Swap Transaktion an das Bitcoin Netzwerk sendet.

source: She takes the pre-image, S, from John’s swap transaction and puts it into her own swap transaction, which pays 2 BTC to Fadime’s public key hash, PKH~F~. When the two swap transactions are confirmed, the atomic swap is complete. The effect of all this is that John has sent 2 BTC to Fadime under the condition that Fadime sends 100 NMC to him, and Fadime sends 100 NMC to John under the condition that John sends + 2 BTC to her.
de_de: Sie nimmt das Pre-Image, S, aus Johns Swap Transaktion, und tut es in ihre eigene Swap Transaktion, die 2 BTC an Fadimes public Key Hash PKH~F~ zahlt. Mit Bestätigung der beiden Swap Transaktionen ist der Atomic Swap erledigt. Der Effekt all dessen ist, dass John 2 BTC an Fadime unter der Bedingung geschickt hat, dass Fadime ihm 100 NMC schickt, und dass Fadime 100 NMC an John schickt, sofern er + 2 BTC an sie schickt.

source: Atomic swap failure
de_de: Atomic Swap Fehlschlag

source: The sequence of events in this atomic swap example illustrates a case in which both parties, John and Fadime, play by the rules. No one had to actually use the time-locked branches of the contract transaction outputs. This subsection will go through some ways the swap might fail:
de_de: Die Abfolge von Ereignissen in diesem Atomic Swap Beispiel illustriert einen Fall, in dem beide Seiten, John und Fadime, sich an die Regeln halten. Niemand musste auf die time-locked Zweige der Vertragstransaktions-Outputs zurückgreifen. Dieser Abschnitt bespricht einige der Arten, auf die der Swap vielleicht schiefgehen könnte:

source: Fadime doesn’t broadcast her contract transaction.
de_de: Fadime übermittelt ihre Vertragstransaktion nicht.

source: This means John can’t spend the output of Fadime’s contract transaction, which means Fadime will never get to see S. Without S, she can’t spend John’s contract output. The only possible outcome is that John must wait 48 hours for the relative time lock to pass and then reclaim his money.
de_de: Das bedeutet, John kann den Output von Fadimes Vertragstransaktion nicht ausgeben, was wiederum bedeutet, dass Fadime S nie zu Gesicht bekommt. Ohne S kann sie Johns Vertragsoutput nicht ausgeben. Das einzige mögliche Ergebnis ist, dass John 48 Stunden warten muss, damit das relative Time Lock ausläuft, und er dann sein Geld wiederholen kann.

source: John doesn’t spend Fadime’s contract output in 24 hours.
de_de: John gibt Fadimes Vertragsoutput 24 Stunden lang nicht aus.

source: Fadime can reclaim her coins, and John must wait another 24 hours before claiming his coins back.
de_de: Fadime kann ihre Coins zurückholen und John muss noch weitere 24 Stunden warten, bis er seine Coins auch wiederbekommt.

source: John spends Fadime’s contract output just after 24 hours has passed but before Fadime claims back her coins.
de_de: John gibt Fadimes Coinbase Output aus, kurz nach Ablauf der 24 Stunden aber bevor Fadime ihre Coins zurückholt.

source: Fortunately, John’s contract output has a 48-hour relative lock time as opposed to the 24 hours in Fadime’s contract output, so John can’t claim his coins back until he’s waited another 24 hours. During this time, Fadime can claim her BTC from John’s contract output using S and her signature.
de_de: Glücklicherweise hat Johns Vertragsoutput eine 48 Stunden relative Lock Time, im Gegensatz zu den 24 Stunden in Fadimes Vertragsoutput, also kann John seine Coins erst zurückholen, nachdem er weitere 24 Stunden abgewartet hat. Während dieser Zeit kann Fadime ihre BTC aus Johns Vertragsoutput holen, indem sie S und ihre Signatur liefert.

source: Fadime gets hit by a bus just after broadcasting her contract output.
de_de: Fadime wird kurz nach Übermittlung ihres Vertragsoutputs vom Bus überfahren.

source: This is no good. John will be able to take his NMC from Fadime’s contract output and then wait 48 hours to also claim back his BTC. Fadime loses out on this one.
de_de: Das ist nicht gut. John kann sich die NMC aus Fadimes Vertragsoutput holen und nach 48 Stunden Wartezeit auch seine BTC zurückholen. Hier hat Fadime verloren.

source: In the final case, we could argue that the swap wasn’t atomic. After all, it didn’t go through, and John ended up with all the coins. This is a somewhat philosophical question. But we can think of swaps as being atomic under the condition that Fadime can take action. We don’t have this condition for John, though. It’s a matter of who creates the secret, S.
de_de: Im letzten Fall könnten wir argumentieren, dass der Swap nicht atomar ablief. Schliesslich ist er nicht durchgegangen und John hat am Ende alle Coins bekommen. Das ist eine etwas philosophische Frage. Aber wir können Swaps als atomar bezeichnen unter der Bedingung, dass Fadime agieren kann. Wir haben diese Bedingung aber nicht für John. Es hängt davon ab, wer das Geheimnis S erzeugt.

source: Storing stuff in the Bitcoin blockchain
de_de: Speichern von Zeug in der Bitcoin Blockchain

source: In the early days of Bitcoin, it became clear that people wanted to put stuff in transactions in the Bitcoin blockchain that didn’t have anything to do with Bitcoin itself: for example, <<lis0901>>, which is a blockchain tribute to cryptographer Sassama, allegedly posted by Dan Kaminsky. (The message is wrapped into three columns here to save space.)
de_de: In der Anfangszeit von Bitcoin wurde klar, dass Leute Zeug in Transaktionen auf der Bitcoin Blockchain speichern wollten, das nichts mit Bitcoin zu tun hatte: zum Beispiel <<lis0901>>, was eine Blockchain Ehrung des Kryptografen Sassama darstellt, die angeblich von Dan Kaminsky gepostet wurde (die Nachricht wurde in drei Kolumnen umgebrochen, um Platz zu sparen.)

source: A tribute in a transaction
de_de: Eine Ehrung in einer Transaktion

source: Although this was certainly interesting and funny, it had some implications for Bitcoin’s full nodes.
de_de: Obwohl dies sicher interessant und originell war, hatte es ein paar Implikationen für Bitcoins Full Nodes.

source: The message in <<lis0901>> was written into the blockchain using a single transaction with txid
de_de: Die Nachricht in <<lis0901>> wurde in der Blockchain verewigt mit einer einzigen Transaktion mit der txid

source: You can take a closer look at this transaction using a blockchain explorer, such as the one at <<web-bernanke-ascii-art>>.
de_de: Du kannst dir die Transaktion mit Hilfe eines Blockchain Explorers anscheuen, zum Beispiel dem hier <<web-bernanke-ascii-art>>.

source: The author created a transaction with 78 outputs, one for each 20-character line in the message. Each line ends with a space, so only 19 characters are visible.
de_de: Der Autor hat eine Transaktion mit 78 Outputs erzeugt, eine pro 20-Zeichen Zeile in der Nachricht. Jede Zeile endet mit einem Leerzeichen, sodass nur 19 Zeichen sichtbar sind.

source: For example, the last output’s pubkey script looks like this:
de_de: Das Pubkey Script des letzten Outputs sieht zum Beispiel so aus:

source: The interesting part is the PKH. This isn’t an actual PKH, but a made-up one. Maybe you can see a pattern when you compare it to the line “``----END TRIBUTE---- ``”:
de_de: Der interessante Teil ist der PKH. Dies ist kein eigentlicher PKH, sondern ein erfundener. Vielleicht kannst du das Muster erkennen, wenn du ihn mit der Zeile “``----END TRIBUTE---- ``” vergleichst:

source: This “public key hash” encodes one 20-character line in the message. It uses the _ASCII table_ to encode characters. For example, the character `-` is encoded as the byte `2d`. The characters A–Z are encoded by the bytes `41`–`5a`, and a space is encoded as byte `20`.
de_de: Dieser “public Key Hash” kodiert eine 20-Zeichen Zeile in der Nachricht. Er benutzt die _ASCII Tabelle_, um Zeichen zu kodieren. Zum Beispiel wird das Zeichen `-` als Byte `2d` kodiert. Die Zeichen A-Z werden durch die Bytes `41`-`5a` kodiert, und die Leerstelle als das Byte `20`.

source: Let’s look at the PKHs of the message’s last 10 lines along with the ASCII-decoded text:
de_de: Schauen wir uns die PKHs der letzten 10 Zeilen der Nachricht an, zusammen mit dem ASCII-kodierten Text:

source: Bloated UTXO set
de_de: Aufgeblähtes UTXO Set

source: Because these PKHs are made up, they have no known pre-images. This also means no known public/private key pairs are associated with them, so no one can ever spend the outputs. They’re _unspendable_. The last PKH’s Bitcoin address is `157sXYpj…QnHB6FGU`. Anyone who pays money to this address is throwing that money in the trash. The money is lost forever. It’s the equivalent of burning a dollar bill.
de_de: Weil die PKHs erfunden sind, haben sie keine bekannten Pre-Images. Das bedeutet auch, dass keine bekannten public/private Key Paare mit ihnen assoziiert sind, sodass niemand jemals diese Outputs wird ausgeben können. Sie sind nicht verwendbar, oder _unspendable_. Die Bitcoin Adresse des letzten PKHs ist `157sXYpj…QnHB6FGU`. Jeder, der Geld an diese Adresse zahlt, wirft dieses Geld in den Mülleimer. Das Geld ist für immer verloren. Es entspricht dem Verbrennen eines Dollarscheins.

source: Unspendable outputs like these are indistinguishable from ordinary, spendable outputs. You can’t prove that they’re unspendable. Full nodes have to treat them as spendable, meaning they have to keep these unspendable outputs in their unspent transaction output (UTXO) set forever. This places an unnecessary burden on nodes, which need to keep all these outputs in memory.
de_de: Unspendable Outputs wie diese sind von normalen, verwendbaren Outputs nicht zu unterscheiden. Man kann nicht beweisen, dass sie unspendable sind. Full Nodes müssen sie als verwendbar betrachten, was bedeutet, sie müssen auf ewig diese unspendable Outputs in ihrem Unausgegebenen Transaktions Output (UTXO) Set halten. Das belastet die Nodes unnötig, weil sie all diese Outputs im Speicher halten müssen.

source: Bitcoin’s developers came up with a partial solution to this problem. Instead of sending money to unprovably unspendable outputs, users can create _provably unspendable_ outputs. If a full node can determine if an output is unspendable, + it doesn’t have to insert that output into its UTXO set.
de_de: Bitcoin Entwickler haben eine partielle Lösung für dieses Problem entwickelt- Statt Geld an nicht beweisbar unspendable Outputs zu schicken, können Benutzer _beweisbar unspendable_ Outputs erzeugen. Wenn ein Full Node feststellen kann, ob ein Output unspendable ist + dann muss er diesen nicht zum UTXO Set hinzufügen.

source: The partial solution involves a new script operator called `OP_RETURN`. This operator immediately fails when executed. A typical `OP_RETURN` pubkey script can look like this:
de_de: Die teilweise Lösung involviert einen neuen Script Operator namens `OP_RETURN`. Dieser Operator bricht die Ausführung des Scripts sofort ab. Ein typisches `OP_RETURN` Script kann zum Beispiel so aussehen:

source: OP_RETURN "I'm Grokking Bitcoin"
de_de: OP_RETURN "Ich begreife Bitcoin"

source: If someone tried to spend this output, the script would fail once it encountered the `OP_RETURN`. If the pubkey script contains this operator, a full node can determine that the output isn’t spendable and ignore it, saving the UTXO set from being forever bloated with this nonsense. A typical `OP_RETURN` output pays 0 BTC, but it can also set a value greater than 0 to “burn” money.
de_de: Wenn jemand versucht, diesen Output auszugeben, wird das Script abbrechen, sobald es auf den `OP_RETURN` Operator trifft. Wenn das Pubkey Script diesen Operator enthält, kann ein Full Node feststellen, dass der Output nicht verwendbar ist und ihn ignorieren, um zu verhindern, dass das UTXO Set für immer von diesem Unsinn aufgebläht wird. Ein typischer `OP_RETURN` Outpus zahlt 0 BTC, aber er kann auch einen Wert grösser als 0 BTC zahlen, um Geld zu “verbrennen.”

source: There are a few policies regarding `OP_RETURN`:
de_de: Es gibt ein paar Policies hinsichtlich `OP_RETURN`:

source: The full pubkey script must not be bigger than 83 bytes.
de_de: Das gesamte Pubkey Script darf nicht grösser als 83 Bytes sein.

source: There can be only one `OP_RETURN` output per transaction.
de_de: Es ist nur ein `OP_RETURN` Output pro Transaktion erlaubt.

source: These two policies are just that—policies. Full nodes adhering to these policies won’t relay transactions that violate them. But if they encounter a block that contains transactions that violate the policies, the block will be accepted and relayed. I’ll talk more about policies and _consensus rules_, strict rules that apply to blocks, in <<ch10>> and <<ch11>>.
de_de: Diese beiden Policies sind genau das–Policies, also Grundsätze. Full Nodes, die sich an diese Policies halten, relayen keine Transaktionen, die die Policies verletzen. Aber wenn sie einem Block begegnen, der Transaktionen enthält, die die Policies verletzen, dann wird der Block akzeptiert und weitergeleitet. Ich spreche mehr über Policies und _Konsensregeln_, strenge Regeln, die für Blocks gelten, in <<ch10>> und <<ch11>>.

source: Creating a token in Bitcoin
de_de: Erzeugung eines Tokens in Bitcoin

source: I talked briefly about tracking ownership on the blockchain in <<ch01>>. Suppose a car manufacturer, let’s call it Ampere, decides that it wants to digitally track the ownership of its cars on the Bitcoin blockchain. This can be accomplished by creating a token in Bitcoin.
de_de: Ich bin in <<ch01>> kurz auf das Protokollieren von Eigentumsrechten auf der Blockchain eingegangen. Angenommen ein Autohersteller, nennen wir ihn mal Ampere, beschliesst, dass er die Eigentumsrechte an seinen Autos auf digitalem Wege auf der Bitcoin Blockchain verfolgen will. Dies kann durch Erzeugung eines Tokens in Bitcoin erreicht werden.

source: Suppose Ampere wants to create a token for a newly manufactured car with chassis number 123456. It broadcasts a Bitcoin transaction as shown in <<fig0914>>.
de_de: Angenommen Ampere möchte für ein neu hergestelltes Auto mit der Fahrgestellnummer 123456 ein Token erzeugen. Es übermittelt dazu eine Bitcoin Transaktion wie in <<fig0914>> gezeigt.

source: Ampere creates a new token for a newly built car. It issues the token to itself because it still owns this car.
de_de: Ampere erzeugt ein neuen Token für ein neu gebautes Auto. Ampere gibt das Token an sich selbst heraus, weil die Firma das Auto immer noch besitzt.

source: This “Ampere token protocol” specifies that a new token is created when
de_de: Das “Ampere Token Protokoll” spezifiziert, dass ein neues Token generiert wird, wenn

source: Ampere spends a coin from PKH~A~.
de_de: Ampere eine Coin von PKH~ A~ ausgibt.

source: The transaction contains an `OP_RETURN` output with the text `"ampere <chassis number>"`.
de_de: Die Transaktion einen `OP_RETURN` Output mit dem Text `"ampere <chassis number>"` enthält.

source: The first output is the initial token owner.
de_de: Der erste Output ist der initiale Tokenbesitzer.

source: Ampere has a well-known web page at https://www.ampere.example.com, where it has published its public key corresponding to PKH~A~. It also pumps out its public key through advertisements and via Facebook and Twitter. It does all this so people can verify that PKH~A~ actually belongs to Ampere.
de_de: Ampere hat eine wohlbekannte Webseite auf https://www.ampere.example.com, wo es seinen public Key, der mit PKH~A~ korrespondiert, veröffentlicht hat. Die Firma verbreitet ausserdem den public Key durch Werbung und über Facebook und Twitter. Es tut all dies, damit Leute sicherstellen können, dass PKH~A~ tatsächlich Ampere gehört.

source: Suppose Ampere sells this car to a car dealer. The dealer has a public key hash, PKH~D~. <<fig0915>> shows how Ampere will transfer digital ownership to the dealer.
de_de: Angenommen Ampere verkauft dieses Auto an einen Händler. Der Händler hat einen public Key Hash, PKH~D~. <<fig0915>> zeigt, wie Ampere das digitale Eigentum an den Händler übergibt.
