Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: Suppose Alice wants to make a payment of 1 BTC to Bob. The payment starts with Alice creating a transaction and sending it to the Bitcoin network, as shown in <<payment-overview>>. I outline the process’s four steps here and explain each step further in the following subsections. <<payment-overview>> will appear in the introduction of chapters 2 through 8, where I’ll point out which part of the figure we’ll cover in the chapter.
de_de: Angenommen, Alice möchte eine Zahlung von 1 BTC an Bob vornehmen. Die Zahlung beginnt damit, dass Alice eine Transaktion erzeugt und an das Bitcoin Netzwerk schickt, wie in <<payment-overview>> dargestellt. Ich skizziere hier die vier Schritte des Vorgangs und erkläre jeden einzelnen Schritt näher in den einzelnen Unterabschnitten. <<payment-overview>> erscheint in der Einführung der Kapitel 2 bis 8, wobei ich jeweils angebe, welchen Teil der Grafik wir im jeweiligen Kapitel behandeln werden.

source: A Bitcoin payment. The payment is processed in four steps.
de_de: Eine Bitcoin Zahlung. Die Zahlung wird in vier Schritten abgearbeitet.

source: I thought Bitcoin was anonymous!
de_de: Ich dachte Bitcoin wäre anonym!

source: Bitcoin doesn’t use names or any other personal information, but I use names in this first example for simplicity.
de_de: Bitcoin benutzt weder Namen noch irgendwelche sonstige personenbezogene Information, aber ich verwende der Einfachheit halber Namen in diesem ersten Beispiel.

source: Now, let’s follow Alice’s payment from Alice to Bob:
de_de: Verfolgen wir jetzt Alices Zahlung von Alice zu Bob:

source: Alice creates and signs a transaction that moves 1 bitcoin from her to Bob. She then sends the transaction to the Bitcoin network.
de_de: Alice erzeugt und signiert eine Transaktion, die 1 bitcoin von ihr zu Bob sendet. Anschliessend schickt sie die Transaktion an das Bitcoin Netzwerk.

source: The computers in the network—the Bitcoin nodes—check that Alice actually has the money to spend and that the transaction is authentic. They then pass the transaction to their neighbors, called _peers_.
de_de: Die Computer im Netzwerk–die Bitcoin Nodes–prüfen, dass Alice das Geld, das sie senden will, auch tatsächlich besitzt und das die Transaktion echt ist. Dann geben sie die Transaktion an ihre Nachbarn weiter, die als _Peers_ bezeichnet werden.

source: Each computer updates its own copy of the _Bitcoin blockchain_, or the _ledger_, with the new payment information.
de_de: Jeder Computer aktualisiert seine Kopie der _Bitcoin Blockchain_, oder die _Buchhaltung_, mit der neuen Zahlungsinformation.

source: The network notifies Bob that he has received 1 bitcoin.
de_de: Das Netzwerk gibt Bob bescheid, dass er 1 bitcoin erhalten hat.

source: Note how Alice does not really _send_ 1 bitcoin to Bob, but asks the Bitcoin network to move 1 bitcoin from Alice to Bob in the Bitcoin blockchain.
de_de: Bedenke, dass Alice nicht wirklich 1 bitcoin an Bob _gesendet_ hat, sondern das Netzwerk bittet, 1 bitcoin von Alice zu Bob auf der Blockchain umzubuchen.

source: The Bitcoin blockchain is a database that each computer in the Bitcoin network has a copy of. Think of the blockchain as a ledger of all transactions ever made.
de_de: Die Bitcoin Blockchain ist eine Datenbank, von der jeder Computer im Bitcoin Netzwerk eine Kopie besitzt. Stell dir die Blockchain als eine Buchhaltung vor, in der alle jemals getätigten Transaktionen eingetragen sind.

source: We’ll go through these steps in more detail in the next four sections, one step per section.
de_de: Wir gehen in den nächsten vier Abschnitten diese Schritte detaillierter durch, ein Schritt pro Abschnitt.

source: Step 1: Transactions
de_de: Schritt 1: Transaktionen

source: Transaction
de_de: Transaktion

source: A _transaction_ is a _payment_. The terms are interchangeable. We cover transactions in <<ch05>> and <<ch09>>.
de_de: Eine _Transaktion_ ist eine _Zahlung_. Die Begriffe sind austauschbar. Wir besprechen Transaktionen in <<ch05>> und <<ch09>>.

source: Step 1 of the process (<<bitcoin-payment>>) is when Alice asks the network to move 1 bitcoin to Bob. She does this by sending a Bitcoin transaction to the Bitcoin network. This transaction contains instructions on how to move the money and a digital signature that proves it’s really Alice requesting that the money be moved.
de_de: Schritt 1 des Prozesses (<<bitcoin-payment>>) ist, dass Alice das Netzwerk bittet, 1 bitcoin auf Bob umzubuchen. Um dies zu tun, schickt sie eine Transaktion an das Bitcoin Netzwerk. Diese Transaktion enthält Anweisungen, wie das Geld zu bewegen ist, sowie eine digitale Signatur, die beweist, dass die Transaktion wirklich von Alice stammt.

source: Alice creates a transaction, signs it, and sends it to one or more Bitcoin nodes in the Bitcoin network.
de_de: Alice erzeugt die Transaktion, signiert sie, und schickt sie an einen oder mehrere Bitcoin Nodes im Bitcoin Netzwerk.

source: The Bitcoin _transaction_ is a piece of data specifying
de_de: Die Bitcoin _Transaktion_ ist ein Datenblock, der angibt

source: The amount to move (1 bitcoin)
de_de: Die Menge, die umzubuchen ist (1 bitcoin)

source: The Bitcoin address to move the money to (Bob’s Bitcoin address, `15vwoaN74MBeF5nr2BH4DKqndEFjHA6MzT`)
de_de: Die Bitcoin Adresse, an die das Geld verschoben werden soll (Bobs Bitcoin Adresse "15vwoaN74MBeF5nr2BH4DKqndEFjHA6MzT")

source: A _digital signature_ (made with Alice’s private key)
de_de: Eine _Digitale Signatur_ (erzeugt mit Alices privatem Schlüssel)

source: Digital signatures
de_de: Digitale Signaturen

source: We’ll discuss digital signatures in depth in <<ch02>>.
de_de: Wir gehen in <<ch02>> näher auf digitale Signaturen ein.

source: The digital signature is created from the transaction and a huge secret number, called a _private key_, that only Alice has access to. The result is a digital signature that only the private key’s owner could have created.
de_de: Die digitale Signature wird erzeugt aus der Transaktion und einer riesengrossen geheimen Zahl, dem sogenannten _privaten Schlüssel_, auf den ausschliesslich Alice Zugriff hat. Das Ergebnis ist eine digitale Signatur, die nur der Besitzer des privaten Schlüssels erzeugt haben konnte.

source: Alice’s mobile wallet app is connected to one or more nodes in the Bitcoin network and sends the transaction to those nodes.
de_de: Alices mobiles Wallet ist mit einem oder mehreren Nodes im Bitcoin Netzwerk verbunden und schickt die Transaktion an diese Nodes.

source: Step 2: The Bitcoin network
de_de: Schritt 2: Das Bitcoin Netzwerk

source: Alice has sent a transaction to one or more Bitcoin nodes. In step 2 of the process (<<overview-bitcoin-network>>), each such node checks that the transaction is valid and passes it on to its peers. It does this by consulting its local copy of the blockchain and verifying that
de_de: Alice hat eine Bitcoin Transaktion an einen oder mehrere Bitcoin Nodes geschickt. In Schritt 2 des Vorgangs (<<overview-bitcoin-network>>) prüft jeder dieser Nodes, dass die Transaktion gültig ist und leitet sie dann an seine Peers weiter. Die Prüfung geschieht anhand seiner lokalen Kopie der Blockchain und indem er sichergeht, dass

source: The bitcoin that Alice spends exists.
de_de: Der bitcoin, den Alice ausgibt, existiert.

source: Alice’s digital signature is valid.
de_de: Alices digitale Signatur gültig ist.

source: Alice has sent her transaction to a node in the network. The node verifies the transaction and forwards it to other nodes. Eventually, the transaction will reach all nodes in the network.
de_de: Alice hat ihre Transaktion an einen Node im netzwerk geschickt. Der Node prüft die Transaktion und leitet sie an andere Nodes weiter. Irgendwann erreicht die Transaktion alle Nodes im Netzwerk.

source: Invalid transactions
de_de: Ungültige Transaktionen

source: Invalid transactions are dropped. They won’t reach further than the first node.
de_de: Ungültige Transaktion werden verworfen. Sie kommen nicht über den ersten Node hinaus.

source: If all checks pass, a node forwards the transaction to its peers in the Bitcoin network. This is known as _relaying_. Alice’s transaction will shortly have traveled the entire network while each node verifies it along the way. The blockchain hasn’t been updated yet; that’s the next step.
de_de: Wenn alle Prüfungen erfolgreich waren, leitet ein Node die Transaktion an seine Peers im Bitcoin Netzwerk weiter. Dies wird als _Relaying_ bezeichnet. Alices Transaktion wird in Kürze das gesamte Netzwerk durchwandert haben, wobei sie von jedem Node auf dem Weg überprüft wird. Die Blockchain wird noch nicht aktualisiert; das geschieht im nächsten Schritt.

source: Step 3: The blockchain
de_de: Schritt 3: Die Blockchain

source: The blockchain
de_de: Die Blockchain

source: The name _blockchain_ comes from how the ledger is structured. It uses blocks that are chained together in such a way that modifications to the blockchain can be detected. I’ll have more on that in <<ch06>>.
de_de: Der Name _Blockchain_ ist abgeleitet von der Struktur des Ledgers (Hauptbuch der Buchhaltung, Anm. des Übersetzers). Es werden Blöcke verwendet, die so miteinander verkettet sind, dass Änderungen an der Blockchain erkannt werden können. Mehr dazu gibt es in <<ch06>>.

source: In step 3, nodes update their local copies of the Bitcoin blockchain with Alice’s transaction. The blockchain contains historic information about all previous transactions; new transactions, such as Alice’s, are appended to it every now and then.
de_de: In Schritt 3 aktualisieren die Nodes ihre lokalen Kopien der Bitcoin Blockchain mit Alices Transaktion. Die Blockchain enthält historische Informationen über alle früheren Transaktion; neue Transaktion, solche wie Alices, werden ab und zu hinten angehängt.

source: Updating the blockchain with Alice’s transaction isn’t as straightforward as it might seem. Alice’s transaction isn’t the only one going on in the Bitcoin network. Potentially thousands of transactions can be in flight at the same time. If all nodes updated their copy of the blockchain as they received transactions, the copies wouldn’t remain copies for long because transactions can come in different orders on different nodes, as <<txs-unordered>> shows.
de_de: Das Aktualisieren der Blockchain mit Alices Transaktion ist nicht ganz so einfach wie man denkt. Alices Transaktion ist ja nicht die einzige, die im Bitcoin Netzwerk passiert. Möglicherweise sind tausende von Transaktionen gleichzeitig unterwegs. Würden nun alle Nodes ihre jeweilige Kopie der Blockchain mit Transaktion in der Reihenfolge aktualisieren, in der sie sie erhalten haben, dann wären das schnell keine Kopien mehr voneinander. Denn Transaktionen kommen auf verschiedenen Nodes in unterschiedlicher Reihenfolge an, wie man an <<txs-unordered>> sehen kann.

source: Transactions arrive in different orders at different nodes. If all nodes wrote their transactions to the blockchain in order of arrival, the different nodes’ blockchains would differ.
de_de: Transaktionen kommen an unterschiedlichen Nodes in unterschiedlicher Reihenfolge an. Wenn alle Nodes ihre Transaktionen in der Reihenfolge in die Blockchain schreiben würden, in der sie sie erhalten, würden sich die verschiedenen Blockchains der Nodes voneinander unterscheiden.

source: To coordinate the ordering of transactions, one node takes the lead, saying “I want to add these two transactions to the blockchain in the order Y, X!” This message, known as a _block_, is sent out on the network by that leader (<<step-3>>), in the same way that Alice sent the transaction.
de_de: Zur Koordination der Reihenfolge der Transaktionen übernimmt ein Node die Führung und sagt: “Ich möchte folgende zwei Transaktionen in der Reihenfolge X, Y an die Blockchain anhängen.” Diese Nachricht, bekannt als _Block_, wird von diesem Führungsnode an das Netzwerk geschickt (<<step-3>>), genau so wie Alice die Transaktion an das Netzwerk geschickt hatte.

source: One node takes the lead and tells the others in what order to add transactions. The other nodes verify the block and update their blockchain copies accordingly.
de_de: Ein Node übernimmt die Führung und sagt den anderen, in welcher Reihenfolge die Transaktionen hinzuzufügen sind. Die anderen Nodes prüfen den Block und aktualisieren ihre Blockchain Kopien entsprechend.

source: The blockchain is append-only
de_de: Die Blockchain kann nur erweitert werden

source: New transactions are added to the end of the blockchain only—it grows only from the end.
de_de: Neue Transaktionen werden nur am Ende der Blockchain angefügt–sie wächst nur am Ende.

source: As nodes see this block, they update their copy of the blockchain according to the message and pass the block on to their peers. Alice’s transaction was one of the transactions in the block and is now part of the blockchain.
de_de: Wenn Nodes diesen Block sehen, aktualisieren sie ihre Kopie der Blockchain entsprechend der Nachricht und geben den Block an ihre Peers weiter. Alices Transaktion war eine der Transaktionen in dem Block und ist jetzt Teil der Blockchain.

source: Why would a node want to take the lead? The node that takes the lead is rewarded with newly minted bitcoins and transaction fees paid by the transactions it includes in the block.
de_de: Warum würde ein Node die Führung übernehmen wollen? Der Node, der die Führung übernimmt, wird mit frisch erzeugten bitcoins und den Transaktionsgebühren belohnt, die von den im Block enthaltenen Transaktionen bezahlt werden.

source: But wouldn’t every node constantly take the lead to collect the rewards? No, because to take the lead, a node must solve a hard problem. This requires the node to consume considerable time and electricity, which ensures that leaders don’t pop up often. The problem is so hard that most nodes in the network don’t even try. Nodes that do try are called _miners_ because they mine new coins, similar to a gold miner digging for gold. We’ll discuss this process further in <<ch07>>.
de_de: Aber würde nicht jeder Node ständig die Führung übernehmen, um die Belohnung zu kassieren? Nein, denn um die Führung übernehmen zu können, muss ein Node ein schwieriges Problem lösen. Das verlangt vom Node den Verbrauch einer erheblichen Menge an Zeit und Strom, womit gewährleistet wird, dass nicht ständig neue Führungsnodes auftauchen. Das Problem ist so schwierig, dass die meisten Nodes im Netzwerk es noch nicht einmal probieren zu lösen. Nodes, die es probieren, nennt man _Miner_, denn sie schürfen neue Coins, ähnlich wie ein Goldgräber nach Gold schürft. Wir besprechen diesen Prozess näher in <<ch07>>.

source: Step 4: Wallets
de_de: Schritt 4: Wallets

source: Bob and Alice are Bitcoin network users, and they both need a computer program to interact with the network. Such a program is called a _Bitcoin wallet_. Several types of Bitcoin wallets are available for different devices, such as mobile phones and desktop computers, and there are even specialized hardware wallet devices.
de_de: Bob und Alice sind Nutzer des Bitcoin Netzwerks und die beiden brauchen ein Computerprogramm, um mit dem Netzwerk zu interagieren. Solch ein Programm nennt man _Bitcoin Wallet_ (Wallet = Geldbörse, der Übers.). Verschiedene Arten von Bitcoin Wallets sind für diverse Geräte erhältlich, zum Beispiel für Smartphones und Desktop Computer und es gibt sogar einige spezielle Hardware Wallets.

source: Before step 4 of the payment process, the nodes in the network update their local copy of the blockchain. Now, the network needs to notify Alice and Bob that the transaction went through, as <<wallet-connection>> shows.
de_de: Vor Schritt 4 des Zahlungsprozesses aktualisieren die Nodes im Netzwerk ihre lokale Kopie der Blockchain. Nun muss das Netzwerk Alice und Bob darüber informieren, dass die Transaktion durchgegangen ist, wie in <<wallet-connection>> dargestellt.

source: Bob’s wallet has asked a node to notify the wallet upon activity at Bob’s Bitcoin address. Alice pays to Bob’s address, and the node has just written the transaction to the blockchain, so it notifies Bob’s wallet.
de_de: Bobs Wallet hat einen Node gebeten, das Wallet zu informieren, wenn es eine Aktivität auf Bobs Bitcoin Adresse feststellt. Alice bezahlt an Bobs Adresse, und der Node hat soeben die Transaktion in die Blockchain geschrieben, also gibt es jetzt Bobs Wallet bescheid.

source: Wallet duties
de_de: Aufgaben von Wallets

source: A typical Bitcoin wallet will
de_de: Ein typisches Bitcoin Wallet übernimmt folgende Aufgaben

source: Manage keys
de_de: Schlüssel verwalten

source: Watch incoming/outgoing bitcoins
de_de: Nach hereinkommenden und herausgehenden bitcoins Ausschau halten

source: Send bitcoins
de_de: Bitcoins versenden

source: Bob’s wallet is connected to some of the nodes in the Bitcoin network. When a transaction concerning Bob is added to the blockchain, the nodes that Bob’s wallet is connected to will notify Bob’s wallet. The wallet will then display a message to Bob that he received 1 bitcoin. Alice also uses a wallet. Her wallet will be notified of her own transaction.
de_de: Bobs Wallet ist mit einigen der Nodes im Bitcoin Netzwerk verbunden. Wenn eine Transaktion zur Blockchain hinzugefügt wird, die Bob betrifft, dann informieren die mit Bobs Wallet verbundenen Nodes dieses Wallet entsprechend. Das Wallet zeigt dann im Display eine Meldung an, dass er 1 bitcoin erhalten hat. Alice benutzt ebenfalls ein Wallet. Ihr Wallet wird über ihre eigene Transaktion informiert.

source: Besides sending and receiving transactions, Bob’s and Alice’s wallets also manage their private keys for them. As described earlier, a private key is used to create digital signatures, as well as to generate a Bitcoin address. Alice created her digital signature with one of her private keys. When Bob later wants to spend the money he received at his Bitcoin address, which he generated from his private key, he needs to create a transaction and digitally sign it with that private key.
de_de: Abgesehen vom Senden und Empfangen von Transaktionen verwalten die Wallets von Bob und Alice auch deren private Schlüssel. Wie zuvor beschrieben werden private Schlüssel zum Erzeugen digitaler Signaturen und auch zur Generierung von Bitcoin Adressen benutzt. Alice hat ihre digitale Signatur mit einem ihrer privaten Schlüssel erzeugt. Wenn Bob später das Geld, das er von Alice auf der Bitcoin Adresse erhielt, die er mit seinem privaten Schlüssel erzeugt hatte, ausgeben will, so muss er eine Transaktion erzeugen und sie mit dem privaten Schlüssel genau dieser Adresse signieren.

source: Problems with money today
de_de: Probleme mit Geld Stand heute

source: Bitcoin wouldn’t be this widespread if it didn’t solve real problems for real people. Bitcoin solves several problems inherent to the traditional financial system. Let’s look at some commonly discussed problem areas.
de_de: Bitcoin wäre nicht so verbreitet, wenn es nicht echte Probleme für echte Leute lösen würde. Bitcoin löst mehrere Probleme, die dem traditionellen Finanzsystem innewohnen. Betrachten wir einige häufig diskutierte Problembereiche.

source: Segregation
de_de: Ausgrenzung

source: People with bank accounts and access to banking services such as online payments or loans are privileged. According to the World Bank, about 38% of the world’s population doesn’t have a bank account (see <<web-financial-inclusion>>). The numbers are slowly improving, but many people are still stuck in a cash-only environment.
de_de: Leute mit Bankkonten und Zugang zu Bankdienstleistungen wie online Zahlungen oder Kredite sind privilegiert. Laut der Weltbank besitzen rund 38% der Weltbevölkerung überhaupt kein Bankkonto. (siehe <<web-financial-inclusion>>). Diese Zahlen bessern sich langsam, aber viele Leute stecken immer noch in einer Umgebung fest, die ausschliesslich auf Bargeld basiert.

source: Without a bank account and basic banking services, such as online payments, people can’t expand their businesses outside their local communities. A merchant won’t be able to offer goods or services on the internet to increase its customer base. A person living in a rural area might have to travel half a day to pay a utility bill or top up their prepaid mobile phone.
de_de: Ohne Bankkonto und elementare Bankdienstleistungen, wie online Zahlungen, können Leute ihre Geschäfte nicht auf Bereiche ausserhalb ihrer lokalen Gemeinde ausdehnen. Ein Händler kann dann seine Waren und Dienstleistungen nicht im Internet anbieten, um seine Kundenbasis zu vergrössern. Jemand auf dem Lande muss vielleicht eine halbe Tagesreise unternehmen, um eine Versorgerrechnung zu bezahlen oder sein Prepaid Mobiltelefon aufzufüllen.

source: Problems
de_de: Probleme

source: [ ] *Segregation*
de_de: [ ] *Ausgrenzung*

source: This segregation between banked people and unbanked people is driven by several factors:
de_de: Diese Ausgrenzung von Leuten ohne Bankzugang wird von mehreren Faktoren getrieben:

source: Banking services are too expensive for some people.
de_de: Bankdienstleistungen sind für manche Leute zu teuer.

source: To use banking services, you need documentation, such as an ID card, that many people don’t have.
de_de: Um Bankdienste in Anspruch zu nehmen, benötigt man Dokumente wie Ausweise, die viele Leute nicht besitzen.

source: Banking services can be denied to people with certain political views or those conducting certain businesses. People might also be denied service due to their ethnicity, nationality, sexual preferences, or skin color.
de_de: Bankdienste können Leuten mit bestimmten politischen Ansichten verwehrt werden, oder solchen, die in bestimmten Geschäftsfeldern tätig sind. Leuten kann auch aufgrund ihrer ethnischen Herkunft, Nationalität, sexueller Vorlieben oder Hautfarbe die Dienstleistung verwehrt werden.

source: Privacy issues
de_de: Vertraulichkeitsfragen

source: When it comes to electronic payments such as credit cards or bank transfers, traditional money poses several privacy problems. States can easily
de_de: Wenn es um elektronische Zahlungen wie solche mittels Kreditkarten oder Überweisungen geht, hat traditionelles Geld mehrere Vertraulichkeitsprobleme. Staaten können recht einfach

source: Trace payments
de_de: Zahlungen verfolgen

source: Censor payments
de_de: Zahlungen zensieren

source: Freeze funds
de_de: Guthaben einfrieren

source: Seize funds
de_de: Guthaben beschlagnahmen

source: You might say, “I have nothing to hide, and the government needs these tools to fight crime.” The problem is, you don’t know what your government will look like in five years and how that government defines crime. New laws are just an election away. After the next election, your government could pass a law that allows it to freeze the funds of people with your political view. In some parts of the world, this is already happening.
de_de: Sie können sagen: “Ich habe nichts zu verbergen und die Regierung braucht diese Werkzeuge zur Verbrechensbekämpfung.” Das Problem ist, du weisst nicht, wie deine Regierung in fünf Jahren aussieht und wie diese Regierung Verbrechen definieren wird. Neue Gesetze sind nur eine Legislaturperiode entfernt. Nach der nächsten Wahl könnte deine Regierung ein Gesetz erlassen, das es ihr erlaubt die Guthaben von Leuten mit deiner politischen Gesinnung zu beschlagnahmen. In manchen Teilen der Welt geschieht dies bereits.

source: [ ] Segregation
de_de: [ ] Ausgrenzung

source: [ ] *Privacy issues*
de_de: [ ] *Vertraulichkeitsfragen*
