Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: Ampere sells the car to a car dealer with public key hash PKH~D~.
de_de: Ampere verkauft das Auto an der Händler mit dem public Key Hash PKH~D~.

source: According to our simple protocol, car ownership is transferred by spending the old owner’s output. The following rules apply:
de_de: Gemäss unserem einfachen Protokoll wird das Eigentum am Auto übertragen, indem der Output des alten Besitzers ausgegeben wird. Hierbei gelten folgende Regeln:

source: The spending transaction spends the old owner’s output.
de_de: Die ausgebende Transaktion gibt den Output des vorigen Besitzers aus.

source: The first output of the spending transaction is the new owner of the car.
de_de: Der erste Output der ausgebenden Transaktion ist der neue Besitzer der Autos.

source: The car dealer is now the new owner because PKH~D~ is the first output of the spending transaction. That’s it. When the dealer sells this car to a consumer, Fadime, it transfers the car’s ownership to Fadime’s address, PKH~F~ (<<fig0916>>).
de_de: Der Autohändler ist nun der neue Besitzer, weil PKH~D~ der erste Output der ausgebenden Transaktion ist. Das ist alles. Wenn der Händler das Auto an eine Kundin verkauft, Fadime, überträgt er die Eigentumsrechte auf Fadimes Adresse PKH~F~ (<<fig0916>>).

source: The car dealer transfers the car’s ownership to Fadime’s PKH~F~.
de_de: Der Autohändler überträgt die Eigentumsrechte an dem Auto an Fadimes PKH~F~.

source: Starting the car with proof of ownership
de_de: Anlassen des Autos mit Proof of Ownership

source: Now that Fadime is the rightful owner of this car, wouldn’t it be cool if she could start it by proving she’s the owner? She can. The car is equipped with an ignition lock that starts the engine when Fadime sends a proof of ownership to the car (<<fig0917>>).
de_de: Nun, da Fadime die rechtmässige Besitzerin des Autos ist, wäre es da nicht toll, wenn sie es anlassen könnte, indem sie beweist, dass sie die Eigentümerin ist? Das kann sie. Der Wagen ist mit einem Zündschloss versehen, das den Motor startet, wenn Fadime den Beweis des Eigentums, den _Proof of Ownership_, an das Auto schickt (<<fig0917>>).

source: Fadime starts her car by signing a challenge with her private key.
de_de: Fadime startet ihr Auto, indem sie eine Aufforderung des Autos, oder _Challenge_, signiert.

source: Fadime first asks the car to start. The car won’t start if it doesn’t know that Fadime has the private key belonging to PKH~F~. The car generates a big random number and sends it to Fadime, who signs this random number with the private key and sends the signature and her public key to the car.
de_de: Fadime bittet zunächst den Wagen, zu starten. Das Auto startet aber nicht, wenn es nicht weiss, dass Fadime den private Key hat, der zu PKH~F~ gehört. Daher erzeugt das Auto eine sehr grosse Zufallszahl und schickt sie an Fadime, welche diese Zufallszahl mit ihrem private Key signiert und die Signatur und ihren public Key an das Auto zurückschickt. Man nennt diese Zufallszahl eine _Challenge_.

source: The car needs the public key to verify that it corresponds to PKH~F~ as written in the blockchain. The car keeps track of who currently owns it by running a lightweight wallet that understands the Ampere token protocol.
de_de: Das Auto benötigt den public Key, um zu prüfen, dass er mit dem in der Blockchain gespeicherten PKH~F~ korrespondiert. Das Fahrzeug bleibt über die Eigentumsrechte an ihm im Bilde, indem es ein Lightweight Wallet beherbergt, welches das Ampere Token Protokoll versteht.

source: When the car has verified that the signature is valid and from the correct private key, it will start the engine.
de_de: Wenn der Wagen überprüft hat, dass die Signatur gültig ist und vom korrekten private Key stammt, startet es die Maschine.

source: Replacing pending transactions
de_de: Ersetzen ausstehender Transaktionen

source: When you send a Bitcoin transaction to buy a book online, the bookstore will wait for the transaction to confirm before it sends the book to you. Usually, your transaction will be confirmed within an hour or so, but what if it isn’t? What if no miner ever wants to include your transaction? This can certainly happen if your transaction fee isn’t sufficient (<<fig0918>>).
de_de: Wenn du eine Bitcoin Transaktion schickst, um ein Buch online zu kaufen, wartet der Buchladen, bis die Transaktion bestätigt wurde, bevor er dir das Buch schickt. Normalerweise wird deine Transaktion innerhalb von einer Stunde oder so bestätigt. Aber was, wenn nicht? Was, wenn kein Miner jemals deine Transaktion in einen Block hineinnehmen will? Das kann sicherlich passieren, wenn die Transaktionsgebühr zu gering ist (<<fig0918>>).

source: You pay for your book and set the transaction fee to 0.00001 BTC.
de_de: Du bezahlst ein Buch und setzt die Transaction Fee auf 0,00001 BTC.

source: You might recall from <<transaction-fees>> that the transaction fee is the sum of the input values minus the sum of the output values. The fee per byte that miners care about is calculated by dividing that fee by the transaction’s size—in this case, 1,000 satoshis divided by 226 bytes, which is about 4.4 sat/byte.
de_de: Du erinnerst sich vielleicht aus <<transaction-fees>>, dass die Transaction Fee der Summe der Input Werte minus der Summe der Output Werte entspricht. Die Fee pro Byte, die die Miner interessiert, wird durch Division dieser Fee durch die Transaktionsgrösse berechnet–in diesem Fall sind das 1.000 satoshi geteilt duch 226 Bytes, was etwa 4,4 sat/Byte entspricht.

source: If no miner is willing to include the transaction for that fee, your transaction will be stuck waiting for confirmation. If the transaction isn’t confirmed, you won’t get your book. You probably want to do something about this situation. Maybe you can create a new, similar transaction, but with a higher fee. Let’s try (<<fig0919>>).
de_de: Wenn kein Miner bereit ist, die Transaktion für diese Gebühr zu minen, bleibt deine Transaktion beim Warten auf die Bestätigung stecken. Wird die Transaktion nicht bestätigt, bekommst du dein Buch nicht. Du würdest jetzt wahrscheinlich gerne Abhilfe schaffen. Vielleicht kannst du eine neue, ähnliche Transaktion erzeugen, die aber eine höhere Gebühr zahlt. Probieren wir es (<<fig0919>>).

source: You try to replace your old, stuck transaction with a new one with a higher fee.
de_de: Du versuchst deine alte, festgefahrene Transaktion durch eine neue mit einer höheren Gebühr zu ersetzen.

source: That’s nice: you’ve created and signed a new transaction with a fee 20 times higher. This will surely get mined, you think, and broadcast the transaction.
de_de: Das ist schick: du hast eine neue Transaktion erzeugt und signiert, die eine 20 mal höhere Fee zahlt. Die wird ganz sicher bestätigt, denkst du, und übermittelst die Transaktion.

source: The problem is that your new transaction will probably be regarded as a double-spend attempt and be dropped by most nodes. They’ll think the first transaction is the one that counts, and they’ll disregard any further transactions that spend the same output. How to handle the second transaction is completely up to the nodes, but the most common policy is to drop it. This is what Bitcoin Core does, and that’s the most widely used Bitcoin software. This policy is known as the _first-seen policy_.
de_de: Das Problem ist, dass deine neue Transaktion wahrscheinlich von den meisten Nodes als Double-Spend Versuch gewertet und fallengelassen wird. Die werden denken, dass die erste Transaktion diejenige ist, die zählt, und sie werden alle weiteren Transaktionen ignorieren, die denselben Output ausgeben. Wie sie mit der zweiten Transaktion umgehen, ist völlig den Nodes überlassen, aber die verbreitetste Policy besteht darin, die Transaktion zu verwerfen. Das ist das, was Bitcoin Core tut, und das ist die am weitesten verbreitete Bitcoin Software. Diese Policy heisst zuerst-gesehen-Policy, oder _first-seen policy_.

source: Hint for exercises
de_de: Hinweis zu den Übungen

source: Keep this in mind for <<exercise-rbf>>.
de_de: Behalte dies im Hinterkopf für <<exercise-rbf>>.

source: You might be able to circumvent this policy by sending the second transaction directly to one or more miners. Miners have different incentives than full nodes. Mining full nodes want to earn rewards—subsidy + fees—by providing proof of work to the blockchain, whereas non-mining full nodes want to keep their memory and computing resource consumption down. If a miner could get hold of the second, high-fee transaction, it would probably decide to include it despite the fact that the low-fee transaction was the first seen. Replacing transactions in this way is impractical because you don’t know any miners’ IP addresses unless they’re published somehow. You also reveal your IP address to the miners, and the miners then become targets for various surveillance organizations or companies wanting to monetize information about you.
de_de: Du könntest es schaffen, diese Policy zu umschiffen, indem du die zweite Transaktion direkt an einen oder mehrere Miner schickst. Miner haben andere Anreize als Full Nodes. Minende Full Nodes wollen Block Rewards verdienen, wogegen nicht minende Full Nodes ihren Verbrauch an Speicher- und Verarbeitungsressourcen niedrig halten wollen. Würde sich ein Miner die zweite, hoch bezahlte Transaktion schnappen, würde er sie höchstwahrscheinlich in seinen Block tun, obwohl die wenig zahlende Transaktion die zuerst gesehene war. Transaktionen auf solche Weise zu ersetzen ist impraktikabel, weil du die Adressen von Minern nicht kennst, solange sie nicht irgendwo veröffentlicht worden sind. Ausserdem gibst du den Minern gegenüber deine IP Adresse preis, und damit werden die Miner zum Ziel für diverse Überwachungsorganisationen oder Firmen, die Informationen über dich zu Geld machen wollen.

source: Opt-in replace-by-fee
de_de: Optionaler Gebührenersatz / Replace-by-Fee

source: This BIP describes how transactions can declare themselves replaceable.
de_de: Dieser BIP beschreibt, wie Transaktionen sich selbst für ersetzbar erklären können.

source: In 2016, a policy was deployed for transaction replacement. It’s generally called _opt-in replace-by-fee_, or opt-in RBF (<<fig0920>>). It works by using the sequence numbers of a transaction’s inputs.
de_de: Im Jahre 2016 wurde eine Policy für das Ersetzen von Transaktionen ausgerollt. Sie wird im Allgemeinen als _opt-in replace-by-fee_, oder opt-in RBF bezeichnet (<<fig0920>>). Sie funktioniert durch Verwendung der Sequenznummern in den Transaktionsinputs.

source: Use opt-in RBF to easily replace a transaction before it’s confirmed.
de_de: Benutze Opt-In RBF, um eine Transaktion auf einfachem Wege zu ersetzen, bevor sie confirmed ist.

source: Suppose again that you want to pay for a book in an online bookstore. When you create the transaction, you make sure one of the inputs (there’s only one in this example) has a sequence number less than `fffffffe`. This signals to nodes that you want this transaction to be replaceable.
de_de: Wieder einmal angenommen, dass du ein Buch in einem Online Buchladen kaufen willst. Wenn du die Transaktion erzeugst, sorgst du dafür, dass einer der Inputs (in diesem Beispiel gibt es nur einen) eine Folgenummer kleiner als `fffffffe` besitzt. Dies signalisiert den Nodes, dass du diese Transaktion als ersetzbar markieren möchtest.

source: When a node receives this transaction, it will be treated as a normal transaction, but the replaceability will be remembered.
de_de: Wenn ein Node diese Transaktion empfängt, behandelt er sie wie eine normale Transaktion, aber er merkt sich die Ersetzbarkeit.

source: When you later notice that your transaction doesn’t confirm because of a too-low fee, you can create a new, replacement transaction with a higher fee. When you broadcast the replacement transaction, the nodes receiving it will—if they implement the opt-in RBF policy—kindly replace the old transaction with the new one and relay the new one to their peers. The old transaction will be dropped. This way, the replacement transaction will eventually reach all nodes, including miners, and will hopefully be confirmed within a reasonable time.
de_de: Wenn dir später klar wird, dass die Transaktion wegen zu geringer Gebühren nicht bestätigt wird, erzeugst eine neue Ersatztransaktion mit einer höheren Gebühr. Wenn du diese Ersatztransaktion sendest, werden die Nodes, die diese empfangen–sofern sie die opt-in RBF Policy umgesetzt haben–die alte Transaktion freundlicherweise durch die neue ersetzen und die neue an ihre Peers weiterleiten. Die alte Transaktion wird verworfen. Auf diesem Weg wird die Ersatztransaktion irgendwann bei allen Nodes ankommen und hoffentlich innerhalb einer vernünftigen Zeit bestätigt werden.

source: In this example, you set the sequence number of the replacement transaction’s input to `ffffffff`. This means the replacement transaction is not itself replaceable. If you want the replacement transaction to also be replaceable, you must set its sequence number to `fffffffd` or less, just as you did with the replaced transaction.
de_de: In diesem Beispiel setzt du die Folgenummer des Transaktionsinputs auf `ffffffff`. Das bedeutet, die Ersatztransaktion ist nicht selbst wieder ersetzbar. Wenn du die Ersatztransaktion wiederum ebenfalls ersetzbar haben willst, musst du ihre Folgenummer auf `fffffffd` oder weniger setzen, genau wie du es mit der ersetzten Transaktion getan hast.

source: You might be wondering where these sequence numbers come from. The intention with sequence numbers from the beginning was to allow for another kind of transaction replacement. The feature was disabled early in Bitcoin, but the sequence numbers remained in the transaction inputs. These sequence numbers have since been repurposed for absolute lock time, relative lock time, and replace-by-fee, as described throughout this chapter. If you feel confused, don’t worry; I’ll summarize the different uses of sequence numbers in <<ch09-recap>>.
de_de: Du magst dich vielleicht fragen, wo diese Folgenummern herkommen. Die Intention mit den Folgenummern oder Sequenznummern war von Anfang an, eine andere Art von Transaktionsersatz zu erlauben. Dieses Feature wurde in Bitcoin früh disabled, aber die Folgenummern in den Transaktionsinputs blieben. Diese Nummern wurden seitdem zur Benutzung für absolute und relative Lock Time und replace-by-fee umgewidmet, wie im Laufe dieses Kapitels besprochen. Wenn du jetzt verwirrt bist, mach dir keine Sorgen; Ich summiere die verschiedenen Anwendungen von Folgenummern in <<ch09-recap>> auf.

source: Child pays for parent
de_de: Kind zahlt für Eltern, Child Pays for Parent

source: There is yet another way to bump up a fee. Suppose you have the situation depicted earlier in <<fig0918>>, and you notice that this transaction gets stuck (<<fig0921>>).
de_de: Es gibt noch eine Art, eine Gebühr nachträglich zu erhöhen. Angenommen du hast die in <<fig0918>> beschriebene Situation und merkst, dass die Transaktion steckenbleibt (<<fig0921>>).

source: You haven’t paid a sufficient transaction fee. The transaction is stuck pending because miners don’t want to include it in a block.
de_de: Du hast keine ausreichende Transaction Fee bezahlt. Die Transaktion ist im _pending_ Zustand steckengeblieben, weil die Miner sie nicht in einen Block hineintun wollen.

source: You can make another transaction that spends your change and pays an extra-high fee to compensate for the low fee in the original transaction (<<fig0922>>).
de_de: Du kannst eine weitere Transaktion erstellen, die dein Wechselgeld, deine Change, ausgibt und eine extra hohe Gebühr zahlt, um die zu geringe Gebühr in der originalen Transaktion zu kompensieren (<<fig0922>>).

source: Spending your change and paying an extra fee for the “parent” transaction
de_de: Deine Change ausgeben und eine extra hohe Gebühr für die “Parent” Transaktion zahlen.

source: Suppose a miner sees these two transactions. If the miner wants to collect the fee from the child transaction, it has to include both the parent and the child transactions. If it tries to include only the child transaction, the block won’t be valid because the child transaction spends money that doesn’t exist in the blockchain.
de_de: Angenommen, ein Miner sieht diese beiden Transaktionen. Wenn der Miner die Fee von der Child Transaktion einsammeln will, muss er sowohl Parent als auch Child Transaktion in seinen Block einbringen. Versucht er, nur die Child Transaktion einzubringen, wäre der Block ungültig, weil die Child Transaktion Geld ausgibt, das in der Blockchain nicht existiert.

source: Both you and the bookstore can perform this trick. If you don’t bump the fee, the bookstore can spend its output of 10 BTC and pay itself 9.9998 BTC to add 0.0002 BTC to the combined fee.
de_de: Sowohl du als auch der Buchladen können diesen Trick anwenden. Wenn du die Gebühr nicht hochschraubst, kann der Buchladen seinen Output von 10 BTC ausgeben und sich selbst davon 9,9998 BTC schicken, was 0,0002 BTC zu der gesamten Gebühr der beiden Transaktionen hinzufügt.

source: Different signature types
de_de: Verschiedene Signaturtypen

source: When you sign a typical Bitcoin transaction, you sign the entire transaction, excluding the signature script (<<fig0923>>).
de_de: Wenn du eine typische Bitcoin Transaktion signierst, signierst du die gesamte Transaktion bis auf das Signatur Script (<<fig0923>>).

source: Normally, the entire transaction is signed. All inputs and all outputs are covered.
de_de: Normalerweise wird eine ganze Transaktion signiert. Alle Inputs und alle Outputs sind abgedeckt.

source: This transaction contains two inputs, and each input signs the complete transaction. A signature _commits to_ all inputs and all outputs. If any of the inputs or outputs change, the signature will become invalid.
de_de: Diese Transaktion enthält zwei Inputs, und jeder Input signiert die komplette Transaktion. Eine Signatur bindet, oder _committet_, sich an alle Inputs und alle Outputs. Wenn irgendwelche Inputs oder Outputs sich ändern, wird die Signatur ungültig.

source: You can change this signature behavior using a parameter in the signature called the `SIGHASH` type. You can commit to outputs in three ways (`ALL`, `SINGLE`, and `NONE`) and to inputs in two ways (`ANYONECANPAY` set or not set). Any combination of an input `SIGHASH` type and an output `SIGHASH` type can be used, which makes six different combinations, as <<fig0924>> shows.
de_de: Du kannst dieses Signaturverhalten ändern, indem du einen Parameter in der Signatur namens `SIGHASH` Typ verwendest. Du kannst die Signatur auf drei Arten an die Outputs binden (`ALL`, `SINGLE` und `NONE`) und auf zwei Arten an die Inputs (`ANYONECANPAY` gesetzt oder nicht gesetzt). Jede beliebige Kombination eines Input `SIGHASH` Typs mit einem Output `SIGHASH` Typ ist verwendbar, was sechs verschiedene Kombinationen ergibt, wie <<fig0924>> zeigt.

source: A signature can commit to different parts of the transaction depending on the `SIGHASH` types. The signature doesn’t include the grayed-out parts.
de_de: Eine Signatur kann sich, je nach `SIGHASH` Typ, an verschiedene Teile der Transaktion binden. Die Signatur beinhaltet nicht die ausgegrauten Teile.

source: For the outputs, you can commit to the following:
de_de: Für die Outputs kannst du dich an das folgende binden:

source: _All outputs (`ALL`)_—No one gets to change any outputs.
de_de: _Alle Outputs (`ALL`)_—Niemand darf irgendeinen Output ändern.

source: _A single output at the same index as the input (`SINGLE`)_—You only care about the specific output. The other outputs can change.
de_de: _Ein einzelner Output an derselben Stelle wie der Input (`SINGLE`)_—Dir geht es nur um einen bestimmten Output. Die anderen Outputs können sich ändern.

source: _No outputs (`NONE`)_—You don’t care where the money goes. Anyone can add any outputs without invalidating your signature.
de_de: _Keine Outputs (`NONE`)_—Dir ist egal, wo das Geld hingeht. Jeder kann Outputs hinzufügen, ohne dass deine Signatur ungültig wird.

source: For the inputs, you can commit as follows:
de_de: Für die Inputs kannst du dich wie folgt binden:

source: _All inputs (`ANYONECANPAY` is not set)_—No one can change any input without invalidating your signature.
de_de: _Alle Inputs (`ANYONECANPAY` ist nicht gesetzt)_—Niemand kann irgendeinen Input verändern, ohne dass deine Signatur ungültig wird.

source: _Only the current input (`ANYONECANPAY` is set)_—Other inputs might be changed, removed, or added. You don’t care who pays. Anyone can pay.
de_de: _Nur der aktuelle Input (`ANYONECANPAY` ist gesetzt)_—Andere Inputs können sich ändern, entfernt oder hinzugefügt werden. Dir ist egal, wer zahlt. Jeder darf zahlen.

source: For the vast majority of signatures, `ALL` combined with an unset `ANYONECANPAY` is used to commit to the whole transaction. This is what you’re used to from the earlier chapters in this book. Other types are rare and are used primarily for specialized digital contracts.
de_de: Für die überwältigende Mehrheit der Signaturen wird `ALL` zusammen mit einem nicht gesetzten `ANYONECANPAY` benutzt, um sich an die gesamte Transaktion zu binden. Das entspricht dem, was du aus den früheren Kapiteln dieses Buches gewohnt bist. Andere Typen sind selten und werden in erster Linie für spezielle digitale Verträge verwendet.

source: This chapter has been a potpourri of things you can do with transactions.
de_de: Dieses Kapitel war ein Potpourri von Dingen, die man mit Transaktionen anstellen kann.

source: Transactions and transaction outputs can be time-locked in different ways to prevent funds from being spent until a certain date or time span has occurred, as the following table shows.
de_de: Transaktionen und Transaktions Outputs können auf verschiedene Arten zeitgesperrt werden, um zu verhindern, dass Geld vor einem bestimmten Datum oder vor Ablauf einer bestimmten Zeitspanne ausgegeben wird, wie die folgende Tabelle zeigt.

source: | Action | Result | Set the lock time of a transaction. | The transaction won’t be valid until a certain time or block height. | Set the relative time lock on an input using the sequence number. | The transaction won’t be valid until a certain amount of time or number of blocks have passed. | Use `OP_CHECKLOCKTIMEVERIFY` in a pubkey script. | The output can’t be spent until a certain time or block height. | Use `OP_CHECKSEQUENCEVERIFY` in a pubkey script. | The output can’t be spent until a certain amount of time or number of blocks have passed.
de_de: | Aktion | Ergebnis | Setze die Lock Time einer Transaktion. | Die Transaktion wird erst bei einer bestimmten Block Height gültig. | Setze das relative Time Lock auf einem Input mittels der Folgenummer . | Die Transaktion wird erst nach Ablauf einer bestimmten Zeit oder Anzahl Blocks gültig. | Verwende `OP_CHECKLOCKTIMEVERIFY` in einem Pubkey Script. | Der Output kann erst ab einer bestimmten Zeit oder Block Height ausgegeben werden. | Verwende `OP_CHECKSEQUENCEVERIFY` in einem Pubkey Script. | Der Output kann erst nach Ablauf einer bestimmten Zeit oder Anzahl Blocks ausgegeben werden.

source: All these variants can be expressed in either block height or time. Time locks are useful mostly in digital contracts, such as atomic swaps. An atomic swap lets people who don’t trust each other swap coins without using a trusted third party.
de_de: All diese Varianten können entweder in Form von Block Height oder Zeit angegeben werden. Time Locks sind am nützlichsten in digitalen Verträgen wie Atomic Swaps. Ein Atomic Swap erlaubt es Leuten, die sich gegenseitig nicht trauen, ohne vertrauenswürdige Drittpartei Coins miteinander zu tauschen.
