Repository: abraham-nixon/grokkingbitcoin
Catalog: lang/po4a/po/*.po
Languages: de_de

source: Lisa extended Tom’s block, so the branch Tom and Lisa were working on gets 1 block longer. A rule for this blockchain is that the _longest_ chain is the correct one. This will change further along in this chapter, but for now, we follow the longest chain.
de_de: Lisa erweitert Toms Block, sodass der Ast, an dem Lisa und Tom arbeiten, 1 Block länger wird. Eine Regel für diese Blockchain lautet, dass die _längste_ Blockchain die korrekte ist. Das wird sich später im Kapitel ändern, aber für jetzt folgen wir der längsten Chain.

source: Qi, who was trying to extend her branch, notices that the other branch just got longer because Lisa published a block for that branch. Qi knows everyone else will follow the longer branch. If she stays on her short branch, she’ll probably never catch up and become longer than the other branch. She’s better off abandoning her short branch and moving over to the longer branch. Now, everyone is working on the same branch again, and the tie is resolved.
de_de: Qi, die versucht hatte, ihren eigenen Zweig zu verlängern, stellt fest, dass der andere Zweig gerade verlängert wurde, weil Lisa einen neuen Block für diesen Zweig veröffentlich hat. Qi weiss, dass alle diesem Zweig folgen werden. Wenn sie auf ihrem kurzen Zweig bleibt, wird sie wahrscheinlich nie aufholen und länger werden als der andere Zweig. Sie hat mehr davon, wenn sie ihren eigenen, kurzen Zweig verwaisen lässt und auf den längeren Zweig wechselt. Jetzt arbeitet wieder jeder an demselben Zweig, und die Situation ist gelöst.

source: The UTXO set is built from a single chain. It cannot be built from multiple branches simultaneously. Full nodes have to chose which branch to follow.
de_de: Das UTXO Set wird aus einer einzigen Chain hergeleitet. Es kann nicht aus mehreren Zweigen gleichzeitig erstellt werden. Full Nodes müssen sich für einen Zweig entscheiden.

source: When Qi switches over to the new branch, she’ll mark all transactions of her old branch (that aren’t already in the new branch) as pending. They will be up for grabs for future blocks on the new branch. Nodes maintain a pool of pending transactions, generally called the _memory pool_, or _mempool_. To mark a transaction as pending means putting it in the mempool.
de_de: Wenn Qi auf den anderen Zweig herüberschwenkt, markiert sie alle Transaktionen ihres alten Zweigs (die nicht bereits im neuen Zeig enthalten sind) als schwebend, oder _pending_. Die sind jetzt für zukünftige Blocks auf dem neuen Zweig wieder zu haben. Nodes pflegen einen Pool von schwebenden Transaktionen, der üblicherweise als Speicherpool, _Memory Pool_ oder _Mempool_ bezeichnet wird. Eine Transaktion als schwebend zu markieren heisst, sie in den Mempool zu tun.

source: Because Qi abandoned her branch, she also abandoned her block reward. Her block will never be part of the longest chain, so she’ll never be able to spend the block reward in her block. Only blocks on the longest chain will affect the UTXO set.
de_de: Indem Qi ihren Zweig aufgegeben hat, hat sie auch auf ihre Blockbelohnung verzichtet. Ihr Block wird niemals Teil der längsten Chain werden, also wird sie nie in der Lage sein, die Blockbelohnung in ihrem Block auszugeben.. Nur Blocks in der längsten Chain haben Einfluss auf das UTXO Set.

source: Delayed resolution
de_de: Verzögerte Lösung

source: But what would happen if both Lisa and Qi happened to draw a lucky number at the same second (<<fig0706>>)? This would mean both branches would be extended by 1 block each. You still don’t know which one is the correct branch. Miners will again pick sides and try to extend their branch of choice.
de_de: Aber was wäre gewesen, wenn Lisa und Qi gleichzeitig eine Glückszahl gezogen hätten (<<fig0706>>)? Das würde bedeuten, dass beide Zweige um 1 Block erweitert worden wären. Dann wüssten wir immer noch nicht, welcher Zweig der richtige ist. Die Miner würden sich wieder eine Seite aussuchen und versuchen, den Zweig ihrer Wahl zu verlängern.

source: Both Lisa and Qi draw a lucky number at the same time. The situation isn’t resolved yet.
de_de: Lisa und Qi ziehen gleichzeitig eine Glückszahl. Die Situation ist immer noch nicht gelöst.

source: Let’s say Tom is the next to draw a lucky number. He builds the next block on his branch, which now becomes 3 blocks long. It becomes longer than the other branch, which is only 2 blocks long (<<fig0707>>).
de_de: Sagen wir mal, Tom zieht als Nächster die Glückszahl. Er baut den nächsten Block auf seinem Zweig auf, der jetzt 3 Blocks lang ist. Er wird länger als der andere Zweig, der nur 2 Blocks lang ist (<<fig0707>>).

source: Tom is the next lucky miner, and he gets to extend “his” branch, which will now become the longest.
de_de: Tom ist der nächste glückliche Gewinner und darf “seinen” Zweig erweitern, der jetzt zum längsten wird.

source: Every miner acknowledges this by switching to Tom’s branch and moving on from there. You finally have a winning branch. Again, Qi happens to be the loser in this fight.
de_de: Jeder Miner bestätigt das, indem er auf Toms Zweig umschwenkt und dort weitermacht. Endlich hat ein Zweig gewonnen. Wieder einmal ist Qi der Verlierer in diesem Kampf.

source: Split of split
de_de: Split eines Splits

source: Say instead Tom and Lisa both draw a lucky number at the same time. They would then both extend Tom’s branch. The result would be a split of the split (<<fig0708>>).
de_de: Nehmen wir stattdessen an, Tom und Lisa ziehen gleichzeitig eine Glückszahl. Sie würden dann beide Toms Zweig verlängern.Das Ergebnis wäre ein Split eines Splits (<<fig0708>>).

source: One of the branches experiences yet another split. This new split is resolved like the previous one.
de_de: Einer der Zweige erfährt einen weiteren Split. Der neue Split wird genauso gelöst wie der vorige.

source: You now have three branches. Qi’s branch is probably abandoned because it’s shorter than the two new branches, Lisa’s branch and Tom’s branch. This new competition will be resolved in the same way as the first split. It will be resolved
de_de: Jetzt haben wir drei Zweige. Qis Zweig wird wahrscheinlich verwaisen, weil er kürzer ist als die beiden neuen Zweige, Lisas Zweig und Toms Zweig. Dieser neue Wettbewerb wird sich auf die gleiche Weise lösen wie der erste Split. Er wird gelöst werden.

source: Immediately by the next block
de_de: Gleich beim nächsten Block

source: After a delay because 2 blocks appear simultaneously, one on each branch
de_de: Nach einer Verzögerung, weil 2 Blocks gleichzeitig erscheinen, einer pro Zweig

source: When a new split is introduced on either of the two new branches
de_de: Wenn auf einem der beiden Zweige ein neuer Split geschieht

source: Probability of splits
de_de: Wahrscheinlichkeit von Splits

source: Scientific notation
de_de: Wissenschaftliche Notation

source: stem:[Xe{-Y}] is shorthand for stem:[X\times10^{-Y}]
de_de: stem:[Xe{-Y}] ist die Kurzfassung von stem:[X\times10^{-Y}]

source: Eventually, one branch of a split will win. The likelihood that two branches of length _X_ happen next diminishes rapidly for increasing _X_:
de_de: Irgendwann wird ein Zweig in einem Split gewinnen. Die Wahrscheinlichkeit, dass zwei Zweige der Länge _X_ als nächstes passieren sinkt rapide für steigende _X_:

source: | Branch length | Probability | Happens about every … | 1 | 5.6e-4 | 2 weeks | 2 | 2.1e-7 | 90 years | 3 | 7.6e-11 | 250,000 years | 4 | 2.8e-14 | 700,000,000 years
de_de: | Zweiglänge | Wahrscheinlichkeit | Passiert etwa alle … | 1 | 5.6e-4 | 2 Wochen | 2 | 2.1e-7 | 90 Jahre | 3 | 7.6e-11 | 250,000 Jahre | 4 | 2.8e-14 | 700,000,000 Jahre

source: Splits in Bitcoin occur less than once a month, and the trend is for them to become rarer over time due to more efficient verification and transport mechanisms.
de_de: Splits in Bitcoin passieren seltener als einmal im Monat, und tendenziell werden sie im Laufe der Zeit weniger, weil die Verifikations- und Transportmechanismen effizienter werden.

source: A split of branch length 1 is quite likely to happen, but a branch of length 2 probably won’t happen during Lisa’s lifetime (she’s 45). No matter how long the splits are, eventually they’ll resolve with a winner. This seems like a nice scheme. But it has its issues:
de_de: Dass ein Split von Länge 1 passiert, ist relativ wahrscheinlich, aber ein Split von Länge 2 passiert wahrscheinlich nicht mehr, solange Lisa lebt (sie ist 45). Egal wie lang Splits sind, irgendwann lösen sie sich mit einem Gewinner auf. Das sieht noch einem netten Verfahren aus. Aber es hat Probleme:

source: [ ] You can cheat with lucky numbers. You can’t prove you actually drew an honest lucky number.
de_de: [ ] Man kann bei Glückszahlen mogeln. Man kann nicht beweisen, dass man ehrlich durch Glück eine passende Zahl gefunden hat.

source: [ ] For every new miner, the system becomes more censorship resistant but also more vulnerable to private-key theft. More computers containing private keys means a higher probability that a key gets stolen. A stolen block-signing private key will let the thief create blocks by cheating with lucky numbers and collect the rewards for themselves.
de_de: [] Mit jedem neuen Miner wird das System robuster gegen Zensur, aber auch empfindlicher gegen private Key Diebstahl. Mehr Computer mit mehr private Keys bedeutet höhere Wahrscheinlichkeit, dass ein Key getohlen wird. Ein gestohlener Blocksignier-private Key lässt einen Dieb Blocks erzeugen, bei denen er mit den Glückszahlen betrügt und die Block-Belohnungen einkassiert.

source: [ ] For each new miner, the risk that one miner cheats with lucky numbers increases.
de_de: [ ] Mit jedem neuen Miner steigt das Risiko, dass ein Miner mit getürkten Glückszahlen mogelt.

source: [ ] You can’t just add new miners to the system. You need to lower the lucky-number threshold as more miners are added, to keep the average of 10 minutes per block and the money issuance at the desired rate.
de_de: [ ] Man kann nicht einfach neue Miner zum System hinzufügen. Man muss den Schwellwert für die Glückszahlen mit anpassen, wenn mehr Miner dazukommen, damit der Durchschnitt von 10 Minuten pro Block und damit die Geldproduktion bei der gewünschten Rate bleibt.

source: Clearly, this system won’t be able to increase the number of miners beyond a controlled group of highly trusted participants. You’ll get a flood of blocks as miners start cheating, but you can’t prove they’re cheating. It’s possible they’re just really, really lucky.
de_de: Offensichtlich kann dieses System die Anzahl Miner nicht über eine kontrollierte Gruppe von vertrauenswürdigen Teilnehmern hinaus erweitern. Man würde mit Blocks geflutet werden, wenn Miner anfangen zu mogeln, aber man könnte ihnen nicht nachweisen, dass sie mogeln. Es kann ja immer sein, dass sie einfach unheimlich viel Glück haben.

source: This chapter is about _proof of work_. I haven’t introduced that term properly yet, but I’ll do so in the next section.
de_de: Dieses Kapitel behandelt _Proof of Work_. Ich habe diesen Begriff noch nicht richtig eingeführt, werde das aber im nächsten Abschnitt tun.

source: In the Bitcoin overview in <<ch01>>, <<step-3-the-blockchain>>, you saw that one miner takes the lead and decides which transactions go into the next block and in what order. Bitcoin uses proof of work to decide who gets to take the lead (<<fig0709>>).
de_de: Im Bitcoin Überblick in <<ch01>>, <<step-3-the-blockchain>>hast du gesehen, dass ein Miner die Führung übernimmt und entscheidet, welche Transaktionen in den nächsten Block kommen und in welcher Reihenfolge. Bitcoin benutzt Proof of Work zur Entscheidung darüber, wer die Führung übernimmt (<<fig0709>>).

source: Proof of work is how you select a leader without a leader.
de_de: Proof of Work ist die Methode, wie man einen Anführer wählt, ohne einen Anführer zu haben.

source: Proof of work lets you randomly select a leader among all miners without using a central authority. Pay close attention to this chapter because this is the essence of Bitcoin. It’s what makes Bitcoin truly _decentralized_. We want the system decentralized because this makes it censorship resistant. If the system has a central authority, then transactions can be censored.
de_de: Proof of Work lässt uns ohne zentrale Autorität einen Anführer zufällig unter allen Minern auswählen. Pass in diesem Kapitel gut auf, denn es ist die Essenz von Bitcoin. Es ist das, was Bitcoin wirklich _dezentralisiert_ macht. Wir wollen das System dezentralisiert, weil es dadurch zensurresistent wird. Wenn das System eine zentrale Autorität hat, dann können Transaktionen zensiert werden.

source: Cloning Lisa was a first step toward decentralization, but it isn’t perfect because you trust miners to draw honest lucky numbers.
de_de: Lisa zu klonen war der erste Schritt zur Dezentralisierung, aber es ist noch nicht perfekt, weil man den Minern trauen muss, dass sie beim Ziehen der Glückszahlen nicht schummeln.

source: Forcing honest lucky numbers
de_de: Erzwingen von ehrlichen Glückszahlen

source: What if you could force miners to not cheat with lucky numbers? It turns out that you can! You can make them perform huge amounts of computations with their computers and have them prove they’ve performed the work. You can make them perform so much work that it takes each of the three miners about 30 minutes on average to produce a block, which will result in a 10-minute block interval, just as before.
de_de: Was, wenn wir die Miner zwingen könnten, beim Glückszahlen ziehen nicht zu schummeln? Es stellt sich heraus, dass wir das können! Man kann sie zwingen, mit ihren Computern gigantische Mengen an Rechenleistung zu verbrauchen und dann zu beweisen, dass sie diese Arbeit tatsächlich erbracht haben. Man kann sie zwingen, so viel Rechenleistung einzubringen, dass es jeden der Miner im Durchschnitt 30 Minuten kosten würde, einen Block zu erzeugen, was zu 10-minütigen Blockintervallen führen würde, genau wie vorher.

source: The block signatures are replaced by proof of work.
de_de: Die Block Signaturen werden durch Proof of Work ersetzt

source: Old-style block
de_de: Herkömmlicher Block

source: The trick is to replace the digital signatures in the block header with proof of work (<<fig0710>>). Suppose Qi just published a block, and the cafe’s full node wants to verify that this block is valid. Besides verifying the usual stuff like transactions and the merkle root, the full node must verify that Qi’s block includes a valid proof of work. The proof of work is valid if the block-header hash—block ID—is less than or equal to an agreed-on target that’s written in the block header, as <<fig0711>> shows.
de_de: Der Trick ist, die digitalen Signaturen im Block Header durch Proof of Work zu ersetzen (<<fig0710>>). Nimm an, Qi hat gerade einen Block veröffentlicht und das Café will verifizieren, ob der Block gültig ist. Ausser das übliche Zeug wie Transaktionen und den Merkle Root zu verifizieren, muss der Full Node noch prüfen, ob Qis Block einen gültigen Proof of Work enthält. Der Proof of Work ist dann gültig, wenn der hash des Block Headers–die Block ID–kleiner oder gleich einem vereinbarten Zielwert ist, der im Block Header steht, wie <<fig0711>> darstellt.

source: Targets in Bitcoin
de_de: Ziele in Bitcoin

source: The target is written in the block header as 4 bytes, `ABCD`; the 32-byte target is calculated as `BCD` × 2^8*(A-3)^. That’s `BCD` with `A-3` zero bytes after it. It’s this awkward because we must be able to express a wide range of targets, 1–2^256^, with only 32 bits. The target in Qi’s block is written as `1c926eb9`, meaning `926eb9` with 25 zero bytes after (`1c–3 `= `19`, hex code for 25).
de_de: Das Ziel wird als 4 Bytes in den Block Header geschrieben; `ABCD`; das 32 Byte Ziel wird berechnet als `BCD` × 2^8*(A-3)^. Der ergibt `BCD` mit `A-3` Nullbytes dahinter. Das ist deshalb so unelegant, weil wir einen grossen Wertebereich, 1–2^256^, in nur 32 Bits ausdrücken müssen. Das Ziel in Qis Block steht da als `1c926eb9`, also `926eb9` mit 25 Nullbytes danach (`1c–3 `= `19`, Hexcode für 25).

source: The block ID must be less than or equal to the target in the header. Otherwise, the block is invalid.
de_de: Die Block-ID muss kleiner oder gleich dem Zielwert im Header sein. Ansonsten ist der Block ungültig.

source: The nonce in this block header is `492781982`. Qi selects this value using trial and error. The next section will explain how this works.
de_de: Die Nonce in diesem Block Header ist `492781982`. Qi sucht sich diesen Wert durch Versuch und Irrtum aus. Der nächste Abschnitt erklärt, wie das funktioniert.

source: To determine whether a block’s proof of work is valid, compare the 256-bit block ID to the 256-bit target written in the block header. In <<fig0711>>, the block ID and target are
de_de: Um festzustellen, ob der Proof of Work eines Blocks gültig ist, vergleiche die 256 Bit Block-ID mit dem 256 Bit Ziel, das im Block Header steht. Das Ziel wird in Bitcoin als _Target_ bezeichnet. In <<fig0711>> sind Block-ID und Ziel

source: In this example, the block ID starts with `000000003…`, whereas the target starts with `000000009…`. The block ID is less than the target, which means this block’s proof of work is valid.
de_de: In diesem Beispiel beginnt die Block-ID mit `000000003…`, während das Target mit `000000009…` beginnt. Die Block-ID ist also kleiner als das Target, was bedeutet, dass der Proof of Work des Blocks gültig ist.

source: The target is a number agreed on by all full nodes and miners. This target will change every now and then according to some common rules. Such a change is called a _retarget_, and I’ll describe it in a later section. For now, you can regard it as a fixed number that must be set in the block header.
de_de: Das Target ist eine Zahl, auf die sich alle Nodes und Miner geeinigt haben. Dieses Target ändert sich gelegentlich gemäss einiger gemeinsamer Regeln. Eine solche Änderung wird als _retarget_ bezeichnet, und ich beschreibe es in einem späteren Abschnitt. Für den Moment kann man es als eine feste Zahl betrachten, die im Block Header gesetzt werden muss.

source: Producing a valid proof of work
de_de: Produktion eines gültigen Proof of Work

source: To create a new block, a miner must produce a valid proof of work for the block before it’s considered valid. To make a valid proof of work, the miner must create a block-header hash that’s less than or equal to the target in the block header.
de_de: Um einen neuen Block zu erzeugen, muss ein Miner ein gültigen Proof of Work für den Block produzieren, bevor der Block als gültig durchgeht. Um einen gültigen Proof of Work zu schaffen, muss der Miner einen Block Header Hash erzeugen, der kleiner oder gleich dem Target im Block Header ist.

source: A block ID is a double SHA256 of the block header. As you learned in <<ch02>>, the only way to find a pre-image to a cryptographic hash function is to try different inputs over and over until you find one. The same goes here; the miner must try different block headers until it finds one that hashes to a value less than or equal to the target.
de_de: Eine Block-ID ist ein Doppel-SHA256 des Block Headers. Wie wir in <<ch02>> gelernt haben, besteht der einzige Weg, ein Pre-Image für einen kryptografischen Hash zu finden darin, immer wieder verschiedene Inputs durchzuprobieren, bis man ein passendes findet. Hier gilt dasselbe; der Miner muss verschiedene Block Header ausprobieren, bis er einen findet, der zu einem Hashwert führt, der kleiner oder gleich dem Target ist.

source: Let’s go back in time and look at how Qi created her block. She creates a block, sets the target to `00000000926e…`, and sets the nonce to `0`. She then tests whether the proof of work is valid (<<fig0712>>).
de_de: Springen wir mal in der Zeit zurück und schauen, wie Qi ihren Block erzeugt hat. Sie erzeugt den Block, setzt das Target auf `00000000926e…`, und setzt die Nonce auf `0`. Dann prüft sie, ob der Proof of Work gültig ist (<<fig0712>>).

source: Qi tests if her block is valid by verifying the proof of work.
de_de: Qi testet, ob ihr Block gültig ist, indem sie ihren Proof of Work verifiziert.

source: She calculates the block ID by hashing her block header with double SHA256. In this case, the block ID is `aa9c614e7f50…`. This number is bigger than the target:
de_de: Sie berechnet die Block-ID, indem sie ihren Block Header mit Doppel-SHA256 hasht. In diesem Fall ist die Block-ID `aa9c614e7f50…`. Diese Zahl ist grösser als das Target.

source: The rule is that the block ID must be less than or equal to the target for the proof of work to be valid. Qi fails miserably.
de_de: Die Regel besagt, dass die Block-ID kleiner oder gleich dem Target sein muss, damit der Proof of Work gültig ist. Qi scheitert kläglich.

source: The nonce is a 32-bit number, so there are “only” 2^32^ = 4,294,967,296 possible different nonces to choose from.
de_de: Die Nonce ist eine 32 Bit Zahl, also gibt es “nur” 2^32^ = 4,294,967,296 mögliche verschiedene Nonces zum durchprobieren.

source: This is where the nonce comes in. A _nonce_ is just a silly number that doesn’t mean anything. It can be set to any value. Qi initially set the nonce to `0`, but she could just as well have set it to `123` or `92178237`. The nonce helps make a change in the block that will affect the block ID without changing any real data, like transactions or the previous block ID.
de_de: Hier kommt die Nonce ins Spiel. Eine _Nonce_ ist einfach eine alberne Zahl, die nichts bedeutet. Sie kann auf jeden beliebigen Wert gesetzt werden. Qi setzt sie anfangs auf `0`, aber sie könnte sie genausogut auf `123` oder 92178237` setzen. Die Nonce hilft, den Block Header abzuwandeln, ohne irgendwelche echten Daten zu ändern, wie Transaktionen oder Vorgänger Block-ID.

source: Qi will now try again to make a valid proof of work. She increases the nonce from `0` to `1` and tests the validity again (<<fig0713>>).
de_de: Qi probiert jetzt wieder, einen gültigen Proof of Work zu erzeugen. Sie erhöht die Nonce von `0` auf `1` und prüft die Gültigkeit erneut (<<fig0713>>).

source: Qi increases the nonce and makes a second attempt at finding a valid proof of work. This also fails.
de_de: Qi erhöht die Nonce und unternimmt einen zweiten Versuch, einen gültigen Proof of Work zu finden. Auch dies scheitert.

source: When Qi changes the block header by increasing the nonce, the block ID changes—any tiny change in the header will result in a completely different block ID. This is the same property displayed in <<cryptographic_hashing>> in <<ch02>>, when we changed the cat picture (<<fig0714>>).
de_de: Wenn Qi den Block Header durch Variieren der Nonce ändert, ändert sich die Block-ID–jede kleinste Änderung im Header führt zu einer völlig anderen Block-ID. Das ist dieselbe Eigenschaft, die in <<cryptographic_hashing>> in <<ch02>> dargestellt wurde, als wir das Katzenbild geändert haben (<<fig0714>>).

source: Changing the input of a cryptographic hash function results in completely different output.
de_de: Änderungen am Input einer kryptografischen Hashfunktion führen zu einem völlig anderen Output.

source: The new block ID is `863c9bea5fd8…` This is also bigger than the target. Qi fails again. I’m sorry, but there’s no way around it—Qi must try once more. She increases the nonce from `1` to `2` and tests again (<<fig0715>>).
de_de: Die neue Block ID ist `863c9bea5fd8…` Auch sie ist grösser als das Target. Qi scheitert erneut. Es tut mir leid, aber es führt kein Weg daran vorbei–Qi muss es erneut probieren. Sie erhöht die Nonce von `1` auf `2` und testet erneut (<<fig0715>>).

source: Qi’s third attempt at finding a valid proof of work. She fails again.
de_de: Qis dritter Versuch, einen gültigen Proof of Work zu finden. Sie scheitert schon wieder.
